#ifndef KS_SCRIPT_A1_MONDAY_RU_TL_INDEX
#define KS_SCRIPT_A1_MONDAY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int script_a1_monday_ru_intl[] = {
    0x0000, // Лёгкий ветерок колышет голые ветви над головой, заставляя их шуметь, словно деревянные колокольчики.
    0x00BA, // Летом в этом месте любят уединяться парочки. Густые зелёные своды крон надёжно укрывают их от взглядов учителей и остальных учеников.
    0x01B0, // Но сейчас, в середине зимы, у меня создаётся впечатление, будто я стою под кучей хвороста.
    0x0253, // Сложив ладони, я дышу на них и яростно тру друг о друга, чтобы они не онемели на таком морозе.
    0x02FB, // Сколько мне ещё ждать? Я уверен, что в записке говорилось: «В 16:00».
    0x0372, // Ах да, записка… Её незаметно подсунули в мой учебник математики.
    0x03E9, // Если говорить о штампах, то, хоть этот вариант и демонстрирует некоторую решительность, мне больше по душе вариант с письмом в шкафчике.
    0x04E2, // Пока я размышляю над смыслом записки, снегопад постепенно усиливается.
    0x0565, // Падающие с белого неба снежинки остаются единственным признаком того, что время ещё продолжает свой ход в этом оцепеневшем мире.
    0x0652, // То, насколько неспешно они опускаются на замёрзший лес, создаёт впечатление, будто время едва ползёт.
    0x070C, // Хруст шагов по свежему снегу нарушает тишину, заставляя меня вздрогнуть. Кто-то приближается сзади.
    0x07C3, // Хи… Хисао? Ты пришёл?
    0x07EA, // Неуверенный, едва слышный вопрос.
    0x0828, // Однако я сразу узнаю этот нежный голос.
    0x0870, // Моё сердце замирает.
    0x0896, // Сотни раз я слышал, как его обладательница обращается к кому-то другому.
    0x091A, // Я оборачиваюсь на него, на голос из моих снов, и сердце начинает учащённо биться…
    0x09AF, // Иванако? Я получил записку с просьбой прийти сюда… Она от тебя?
    0x0A23, // Чёрт. Я всё утро пытался придумать какую-нибудь хорошую фразу – и вот что вышло.
    0x0AB5, // Вышло ужасно.
    0x0ACE, // Эм… да. Я попросила подругу передать тебе эту записку. Рада, что ты получил её.
    0x0B5D, // Взволнованный её застенчивой, радостной улыбкой, я замираю, не в силах пошевелить ни единым мускулом.
    0x0C17, // Только сердце неистово бьётся, словно пытается выскочить из груди прямо к ней.
    0x0CA7, // Ну… э… вот мы и здесь. На морозе…
    0x0CE5, // Ветер вновь принимается качать ветви. Их нестройный шум – словно музыка для моих ушей.
    0x0D84, // Иванако слегка вздрагивает от порыва ветра.
    0x0DD5, // Когда он стихает, она выпрямляется, будто набравшись смелости.
    0x0E48, // Наши взгляды встречаются. Она неспешно играет прядью своих длинных тёмных волос.
    0x0EDD, // Всё это время тревожное биение моего сердца усиливается.
    0x0F46, // Горло сводит судорогой; сомневаюсь, что способен выдавить из себя хоть слово.
    0x0FD4, // Знаешь…
    0x0FE4, // …Я хотела спросить…
    0x100B, // Не хочешь ли ты… встречаться со мной?
    0x1050, // Я стою словно истукан, и лишь сердце бешено колотится.
    0x10B3, // Я бы и рад что-нибудь ответить, но мои голосовые связки словно натянуты до предела.
    0x114A, // …Хисао?
    0x1159, // Пытаясь помассировать горло, я поднимаю руки, но в них словно впиваются тысячи игл, отзываясь жгучей болью.
    0x121D, // Хисао?!
    0x122A, // Тело цепенеет, широко открытые глаза мечутся в ужасе.
    0x128C, // ХИСАО!
    0x1298, // Внезапно стук в груди прекращается и колени подкашиваются.
    0x1305, // {vspace=210}Полог из голых ветвей, хмурое зимнее небо, Иванако, бегущая ко мне, – весь мир вокруг погружается во тьму.
    0x13D1, // {vspace=30}Последнее, что я успеваю запомнить, прежде чем меня поглощает забытьё, – голос Иванако, зовущий на помощь, и непрерывный шум ветвей на ветру…
    0x14DF, // После моего сердечного приступа прошло четыре месяца.
    0x1543, // {vspace=60}За это время все разы, когда я покидал палату без присмотра, можно сосчитать по пальцам одной руки.
    0x1602, // Четыре месяца – довольно долгий срок, когда остаёшься наедине со своими мыслями. У меня было достаточно времени, чтобы смириться со своим положением.
    0x1715, // Аритмия.
    0x1725, // Странное слово. Незнакомое, чужое. Такое, с которым не хочется иметь ничего общего.
    0x17BC, // Редкая болезнь. Вызывает перебои в работе сердца, иногда заставляя его биться слишком быстро. Это может быть смертельно.
    0x1899, // Очевидно, она была у меня уже давно. Мне сказали, это просто чудо, что я смог прожить так долго безо всяких происшествий.
    0x1973, // Чудо ли это? Мне кажется, что так они просто хотели заставить меня чуть больше ценить свою жизнь.
    0x1A23, // Однако это нисколько меня не ободрило.
    0x1A6A, // {vspace=150}Думаю, мои родители были потрясены куда сильнее меня. Их обоих чуть удар не хватил.
    0x1B0D, // {vspace=30}У меня, по крайней мере, был целый день, чтобы переварить это. Для них же это стало полнейшей неожиданностью. Они готовы были даже продать дом, чтобы заплатить за лекарство от этой болезни.
    0x1C6E, // {vspace=60}Но, конечно, лекарства не существует.
    0x1CBD, // {vspace=30}Из-за позднего обнаружения этого… состояния, я должен был оставаться в больнице до полного восстановления.
    0x1D8E, // Вначале, когда ко мне начали приходить посетители, казалось, будто они по мне скучают…
    0x1E2D, // Примерно неделю моя палата была полна цветов, воздушных шаров и открыток.
    0x1EB4, // Но вскоре поток посетителей стал редеть, и все их подарки с пожеланиями скорейшего выздоровления понемногу иссякли.
    0x1F8A, // Я понял, что единственной причиной, по которой я получил так много открыток и цветов, было то, что выражение сочувствия ко мне превратили в задание для класса.
    0x20AB, // Может, некоторые и правда волновались, но я сомневаюсь в этом. Даже с самого начала ко мне приходили нечасто. К концу первого месяца меня продолжали регулярно навещать лишь родители.
    0x21F8, // Иванако перестала приходить последней.
    0x2241, // Спустя полтора месяца я перестал видеть её в больнице. В любом случае нам не о чем было разговаривать.
    0x22FB, // Мы никогда больше не касались темы, которая свела нас в тот снежный день.
    0x2380, // {vspace=30}Больница?
    0x239D, // Это точно не то место, где я хотел бы быть.
    0x23E9, // Доктора и медсёстры казались отстранёнными и безликими.
    0x2451, // Думаю, потому что они спешат и у них миллион других пациентов, о которых нужно заботиться… но мне от этого становится не по себе.
    0x253C, // На протяжении первого месяца каждый раз, когда я встречал главного кардиолога, я спрашивал о хотя бы приблизительной дате, когда смогу покинуть больницу.
    0x2656, // Он никогда не отвечал прямо, говоря только, что надо подождать и понять, насколько эффективно идёт лечение и насколько успешно прошла операция.
    0x275D, // {vspace=30}Поэтому мне оставалось лишь наблюдать, как шрам, оставшийся на груди после операции, со временем меняется. Он казался клеймом, оставленным судьбой.
    0x2876, // Я продолжал спрашивать кардиолога о сроках моей выписки, но уже практически не надеялся услышать ответ, поэтому его отсутствие меня не разочаровывало. То, какие слова он использовал, уходя от ответа, по крайней мере оставляло хоть какую-то надежду.
    0x2A3C, // {vspace=120}В какой-то момент я перестал смотреть телевизор. Не знаю почему. Просто перестал, и всё.
    0x2AE7, // Возможно, в моей ситуации, это был неподходящий способ ухода от реальности.
    0x2B71, // {vspace=30}Вместо этого я начал читать. В больнице была небольшая «библиотека», которая, впрочем, больше походила на кладовку. Я поглощал книгу за книгой, проглатывая по небольшой стопке, и возвращался за добавкой.
    0x2CEF, // Внезапно я обнаружил, что мне нравится чтение, я даже немного пристрастился к нему. Я стал чувствовать себя голым без книги в руках.
    0x2DDF, // {vspace=30}Но мне так нравились все эти истории…
    0x2E30, // {vspace=30}Так я и жил.
    0x2E50, // {vspace=30}Дни становились всё более одноликими, различались только погода за окном да обложка книги у меня в руках. Время словно превратилось в какую-то клейкую массу, в которой я увязал, вместо того чтобы плыть дальше.
    0x2FD8, // Я не замечал, как пролетали недели.
    0x3018, // Случалось, что я даже не знал, какое сегодня число.
    0x3074, // Но иногда окружающая действительность вдруг пробивалась через барьер безразличия, которым я себя окружил.
    0x3139, // Страницы книги начинали казаться острыми и жгли руки, а тяжесть в груди становилась невыносимой. Я вынужден был откладывать книгу и просто лежать некоторое время, глядя в потолок, словно собираясь заплакать.
    0x32B6, // Но это случалось нечасто.
    0x32E5, // {vspace=30}Да я даже не мог плакать.
    0x331D, // Сегодня ко мне с улыбкой на лице пришёл доктор. Он кажется слегка взволнованным. Как будто он пытается порадоваться и от моего имени.
    0x3410, // Мои родители тоже здесь. Я не видел их несколько дней. Они даже одеты как-то по-праздничному. Сегодня должно произойти что-то особенное? Не слишком похоже на вечеринку.
    0x3541, // Начинается привычный ритуал главного кардиолога: он не спеша раскладывает бумаги, затем убирает их в сторону, словно подчёркивая бессмысленность этого действия.
    0x366B, // Он небрежно садится на край соседней койки и пару мгновений смотрит мне в глаза.
    0x36FE, // Здравствуй, Хисао. Как ты себя чувствуешь?
    0x374B, // Я молчу, но слегка улыбаюсь в ответ.
    0x378C, // Думаю, ты уже можешь вернуться домой. Твоё сердце стало сильнее, и, если ты будешь соблюдать некоторые меры предосторожности, всё будет в порядке.
    0x3896, // Мы определились с необходимыми для тебя лекарствами. Я отдам рецепт твоему отцу.
    0x392A, // Доктор протягивает ему лист бумаги. Когда отец пробегается глазами по рецепту, его лицо принимает каменное выражение.
    0x3A03, // Так много…
    0x3A18, // Я беру листок у него из рук, чтобы посмотреть самому, и ошеломлённо замираю. Как ещё мне на это реагировать?
    0x3ADB, // Абсурдно длинный список лекарств, смотрящий на меня с листа бумаги, кажется недоступным для восприятия. Текст сливается в сплошное море букв.
    0x3BDF, // Это безумие.
    0x3BF6, // Побочные эффекты, противопоказания и дозировки перечислены строка за строкой с холодной точностью.
    0x3CAE, // Я пытаюсь прочесть, что там написано, но тщетно.
    0x3D05, // Я не могу понять ни слова. Попытки сделать это лишь вызывают раздражение.
    0x3D8B, // Всё это… каждый день, всю мою оставшуюся жизнь?
    0x3DE2, // Боюсь, это всё, что мы пока можем сделать.
    0x3E2D, // Однако постоянно появляются новые лекарства, и я не удивлюсь, если с годами список уменьшится.
    0x3EDA, // С годами… Каким образом это должно вселить в меня уверенность? Я бы чувствовал себя спокойнее, если бы он промолчал.
    0x3FAF, // И ещё. Я поговорил с твоими родителями, и мы решили, что тебе лучше не возвращаться в твою прежнюю школу.
    0x406C, // Что?!
    0x4075, // Хисао, пожалуйста, успокойся. Послушай, что скажет доктор.
    0x40DF, // Успокоиться? Тон, которым он просит об этом, показывает, что он предвидел моё недовольство. Я что, перевожусь на домашнее обучение?
    0x41CD, // Но все мои проявления беспокойства игнорируются.
    0x4228, // Мы все понимаем, что твоё образование – это главное. Вместе с тем оставлять тебя без медицинского присмотра будет неразумно.
    0x430D, // По крайней мере, пока мы не убедимся, что эти лекарства тебе подходят.
    0x438C, // Так что я поговорил с твоими родителями о переводе.
    0x43EA, // Речь идёт о школе «Ямаку», созданной специально для учащихся с ограниченными физическими возможностями.
    0x44AB, // С ограниченными возможностями? Что? Получается, я…
    0x4509, // Их медперсонал работает круглосуточно, и всего в нескольких минутах находится престижная больница. Большинство учеников живёт в общежитии при школе.
    0x461D, // Считай это своего рода престижной частной школой. Она организована так, чтобы ученики могли научиться самостоятельности и при этом помощь всегда находилась неподалёку.
    0x4754, // «Самостоятельности»? Это школа для детей-инвалидов. Не пытайтесь это скрыть!
    0x47E1, // Будь она на самом деле такой «свободной», там бы не было постоянного медицинского надзора и наличие поблизости больницы не было бы включено в её рекламу.
    0x48FA, // Конечно, тебе решать, переводиться туда или нет. Но… мы с мамой не сможем обучать тебя дома.
    0x49A1, // Мы ездили туда пару недель назад и внимательно присмотрелись к ней. Думаю, тебе там понравится.
    0x4A4F, // Кажется, у меня и правда нет выбора.
    0x4A90, // Люди с проблемой вроде твоей обычно живут дольше, чем люди с другими сердечными заболеваниями. Однажды тебе понадобится работа, и это хорошая возможность продолжить обучение.
    0x4BD2, // Это не возможность, не называйте это возможностью. Какая это, к чертям, возможность?
    0x4C6B, // Ты должен радоваться такому шансу. Я помню, как ты хотел снова вернуться в школу, и пусть это не та же самая…
    0x4D30, // Специальная школа… Это же…
    0x4D64, // Оскорбление. Вот что я хочу сказать. Это шаг назад.
    0x4DC0, // Это не то, о чём ты думаешь. Все ученики там ведут достаточно активный образ жизни, каждый по-своему.
    0x4E76, // Школа создана специально для ребят, которые продолжают жить своей жизнью и учиться, но нуждаются в небольшой помощи… того или иного рода.
    0x4F73, // Твой отец прав. И немалое число выпускников этой школы достигли поразительно многого. Инвалидность не должна препятствовать развитию человека.
    0x507C, // Один мой коллега из другой больницы – их выпускник.
    0x50DB, // Мне плевать. Инвалидность не должна препятствовать развитию? Как раз препятствием она и является.
    0x518F, // Меня ужасно злит, что столь важное решение было принято за меня. Но что я могу поделать? О нормальной жизни теперь не может быть и речи.
    0x5284, // Забавно, я всегда думал, что моя жизнь довольно скучна, но теперь мне её не хватает.
    0x531B, // Я хочу протестовать, но мне остаётся только списать мою вялую реакцию на шок или усталость. Я мог бы закричать, что я, несмотря ни на что, хочу вернуться в прежнюю школу. Но нет.
    0x545A, // Я молчу, потому что знаю, что это бесполезно.
    0x54AB, // Я окидываю взглядом свою палату, и меня охватывает усталость от всего этого. От больницы, от докторов, от болезни – всего. Не вижу ничего, что заставило бы меня изменить настрой.
    0x55EE, // Выбора действительно нет. Я знаю это, но мысль о том, чтобы пойти в школу для инвалидов… Какая она вообще? Очень трудно думать об этом в позитивном ключе.
    0x5705, // Но я должен попытаться.
    0x5730, // Новое начало – не так уж и плохо.
    0x576C, // Это всё, о чём я могу думать, чтобы заставить себя пережить это. По крайней мере, у меня остаётся ещё хоть что-то, даже спецшкола всё же лучше, чем ничего. Это новое начало, не всё потеряно. Я не могу позволить себе думать иначе.
    0x5904, // Я хотя бы должен увидеть, на что будет похожа моя новая жизнь.
    0x5974, // Ворота выглядят слишком помпезно.
    0x59B3, // Впрочем, ворота часто производят подобное впечатление, но эти выделяются особенно.
    0x5A4C, // Красный кирпич, чёрное кованое железо и серая лепнина составляют совершенно негостеприимную композицию.
    0x5B0E, // Я задумываюсь, должны ли школьные ворота вызывать подобные эмоции, но не могу прийти ни к чему определённому. Наверное, всё же нет.
    0x5BFC, // Конечно, я не собираюсь вечно тут стоять и думать о воротах, так что прохожу в них быстрым шагом, что оказывается довольно приятно.
    0x5CEA, // Двигаться по жизни вперёд вообще приятно.
    0x5D37, // Я направляюсь к главному корпусу интерната «Ямаку», где кто-то должен меня встретить. Один, потому что родители отвозят мои вещи в общежитие.
    0x5E39, // Вокруг всё покрыто пышной зеленью.
    0x5E79, // Это мало похоже на обычные школьные клумбы. Скорее напоминает парк с чистыми дорожками, вьющимися между деревьями, запахом свежеподстриженной травы – со всем, что делает парк парком.
    0x5FC9, // Мне сразу приходят на ум слова «стерильный» и «гигиеничный», и меня передёргивает.
    0x6061, // Выбрось это из головы. Оставайся непредвзятым. Это твоя новая жизнь – прими её такой, какая она есть.
    0x6119, // Вот что я говорю себе.
    0x6141, // За кронами деревьев виднеются очертания нескольких больших зданий. Их слишком много, и они необычайно велики для простой школы.
    0x622C, // Зрелище открывается непривычное и совсем не соответствующее моим прежним представлениям об учебных заведениях.
    0x62FC, // Всё какое-то неестественное. Пусть мне и сказали, что это моя новая школа, но я чувствую себя здесь чужим.
    0x63BB, // Интересно, правдиво это впечатление или оно является результатом моего предубеждения?
    0x645B, // Кстати, я до сих пор не встретил ни души. Как-то жутковато.
    0x64C4, // Мне уже хочется увидеть хоть кого-нибудь, лишь бы избавиться от ощущения, что я попал в другое измерение.
    0x6583, // Шумящие на ветру деревья и пышная сверкающая зелень вокруг отвлекают моё внимание.
    0x661C, // Я снова думаю о больницах, где «операционные покрашены в зелёный цвет, потому что он успокаивает».
    0x66D0, // Так почему же, несмотря на всю эту зелень, мне так тревожно?
    0x673C, // …
    0x6740, // Уже дойдя до главного корпуса, я внезапно осознаю причину заминки у ворот.
    0x67C8, // Там у меня был последний шанс повернуть назад, пусть я и не смог бы вернуться к прежней жизни.
    0x6872, // Но, когда я вошёл, пути назад не осталось.
    0x68BD, // С этой мыслью, по-прежнему волнуясь, я отворяю парадную дверь.
    0x692E, // Когда я вхожу, меня сразу замечает высокий, слегка сутулый мужчина. Неудивительно: кроме нас, в вестибюле никого нет.
    0x6A03, // Ты, наверное… Ни… На… Ники?
    0x6A37, // Накай.
    0x6A43, // Да, именно. Отлично. Я твой классный руководитель и учитель естественных наук. Меня зовут Муто.
    0x6AF0, // Добро пожаловать.
    0x6B11, // Мы обмениваемся небрежным рукопожатием, и он смотрит на часы.
    0x6B82, // Тебе следует зайти в медкабинет, но сейчас на это нет времени.
    0x6BF3, // Ага. Наверное, я тогда загляну туда попозже?
    0x6C43, // Да, после обеда было бы замечательно. Сейчас нам нужно представить тебя одноклассникам. Они уже ждут.
    0x6CFC, // Ждут меня? Я не люблю быть в центре внимания, но, думаю, в подобной ситуации это неизбежно.
    0x6D9F, // Беспокойство о том, какой мне окажут приём, снова заставляет меня нервничать.
    0x6E2D, // В результате я пропускаю мимо ушей практически всё, что говорит мне учитель.
    0x6EB9, // Когда я поднимаюсь за учителем по лестнице, сердце бешеным стуком в груди напоминает о причине моего появления здесь.
    0x6F91, // Третья дверь третьего этажа помечена как класс 3-3.
    0x6FED, // Муто открывает её и входит.
    0x701F, // Всем доброе утро. Извиняюсь, что снова опоздал.
    0x7075, // У самых дверей меня охватывает сомнение.
    0x70C0, // Ну же, соберись! Я понимаю, что это важный шаг, но… Наверное, нет причин так сильно переживать, по крайней мере пока.
    0x7192, // Я вхожу в класс следом за учителем и оглядываюсь, стараясь не встречаться с любопытными взглядами моих новых одноклассников.
    0x7278, // В классе довольно просторно: высокий потолок и широкие проходы между партами.
    0x7307, // Доска занимает всю стену, а из-за больших, старомодного вида окон, расположенных на уровне головы, она кажется ещё больше.
    0x73E5, // Простые деревянные парты с полочками для книг. Простые деревянные стулья с металлическим каркасом. Незамысловато и эффективно.
    0x74D0, // Я поворачиваюсь лицом к ученикам. На первый взгляд они выглядят так же, как и ученики любой другой школы. Но тогда почему они здесь?
    0x75BF, // Наверное, их недуги не видны на первый взгляд, как и у меня. Потом я замечаю, что у одной из девочек не хватает большого пальца на правой руке. Это немного обескураживает.
    0x76F3, // Вопреки нормальной практике слушать, когда кто-то говорит о тебе, примерно с середины речи мои мысли начинают заглушать слова учителя, представляющего меня классу.
    0x7820, // Я ловлю на себе робкий взгляд девочки, сидящей на последнем ряду. Моё внимание привлекает блеск её прямых длинных волос. Заметив, что я смотрю, она быстро закрывает лицо руками, будто это поможет ей стать невидимкой.
    0x79A9, // Дальше сидит какой-то парень с тростью, прислонённой к шкафчикам. Странно видеть кого-то столь молодого с тростью.
    0x7A7A, // Другая девочка совершает какие-то странные движения руками. Язык жестов? Она бросает на меня взгляд поверх очков и снова возвращается к своему занятию.
    0x7B90, // Она довольно мила, как и её соседка – весёлого вида девчонка с розовыми волосами. Её трудно не заметить – не знаю, как я не обратил на неё внимания, когда вошёл в класс…
    0x7CC3, // …пожалуйста, поприветствуйте нашего нового ученика.
    0x7D25, // Он начинает аплодировать, и все вторят ему, кроме однорукой девочки в первом ряду. Стараясь скрыть свою растерянность, я благодарю их поклоном за эти незаслуженные аплодисменты.
    0x7E6B, // Я слушаю, как учитель бубнит о том, что нам стоит подружиться, а сам смотрю по сторонам.
    0x7F09, // Кажется, все внимательно его слушают, и, когда он заканчивает, снова ему хлопают, что выглядит довольно странно.
    0x7FD5, // В этот раз хлопает даже девочка из первого ряда, ладошкой здоровой руки по запястью другой, которая оканчивается перебинтованной культёй.
    0x80D3, // Меня начинает слегка мутить.
    0x8108, // Сегодня мы будем работать в группах, так что у тебя будет шанс пообщаться с ребятами. Как ты на это смотришь?
    0x81CD, // Замечательно, ничего не имею против.
    0x8210, // Хорошо, ты будешь работать с Хакамити. Она – староста класса.
    0x8280, // Она расскажет всё, что тебе будет нужно узнать. Никто не справится с этим лучше неё, верно?
    0x8324, // Мне-то откуда знать?
    0x8349, // Учитель раздаёт задания и объявляет, что мы будем работать в группах по трое.
    0x83D6, // Внезапно я понимаю, что не знаю, кто из них Хакамити. Чёрт. Учитель, кажется, замечает мою растерянность.
    0x8493, // А, точно. Хакамити вон там. Сидзунэ Хакамити.
    0x84E4, // Как только он называет её имя, симпатичная девочка с ярко-розовыми волосами и золотистыми глазами энергично машет мне рукой. Я сажусь рядом с ней, у окна.
    0x85FC, // Привет, ты, наверное, Хакамити, да? Приятно познакомиться.
    0x8665, // Ха-ха-ха~!
    0x8676, // В чём дело? Её смех застаёт меня врасплох.
    0x86C2, // Я тоже рада познакомиться!{w=0.5} Но~!
    0x8701, // Я тоже рада познакомиться! Но~!{fast} Я не Хакамити, я Миша! Хакамити – вот. Ситтян~!
    0x8792, // Хихикая, Миша указывает на девочку, сидящую рядом с ней, – ту, что пользовалась языком жестов. Похоже, она наблюдала за мной всё это время. Она безразлично кивает мне, давая понять, что осведомлена о моём присутствии, но её это не слишком волнует.
    0x8950, // У неё короткие, аккуратно уложенные волосы и тёмно-синие глаза, смотрящие то изучающе, то равнодушно поверх овальных очков на изящном носике.
    0x8A53, // Рад познакомиться.
    0x8A76, // Она тут же обращает взгляд к Мише, которая улыбается и делает пару быстрых движений руками.
    0x8B1D, // Хакамити кивает и отвечает несколькими жестами.
    0x8B76, // Я задумываюсь, не пошутил ли учитель насчёт «пообщаться с ребятами» и «она всё тебе расскажет».
    0x8C25, // Я вижу, ты немного сбит с толку, да? Да? Но я понимаю, почему ты принял меня за Ситтян!
    0x8CBD, // Ситтян – глухонемая, а я передаю сообщения от неё и для неё.
    0x8D2A, // Я словно переводчик~! Она говорит, что ей тоже приятно с тобой познакомиться!
    0x8DB6, // Ты ведь новый ученик, да? Конечно же да, Ситтян! Если бы он им не был, то не было бы смысла в том его выступлении перед классом, правильно? Правильно~!
    0x8EC1, // Мы знали, что должен прийти новенький, но не думали, что это будет сегодня. Так скоро! Да, Хиттян?
    0x8F6F, // Хиттян?..
    0x8F7F, // Угу~! Тебе идёт, не правда ли?
    0x8FB3, // Я сказал это вслух? Это просто от неожиданности. Мне никогда не нравилась эта кличка.
    0x904E, // Не вижу, каким образом.
    0x9078, // Идёт~! Ты выглядишь точно так, как я себе представляла!
    0x90DB, // Ха-ха-ха~! Да-да, ты выглядишь в точности как Хиттян!
    0x9138, // Интересно, почему все так считают…
    0x9179, // Хакамити стучит пальцами по столу, привлекая внимание Миши. Затем они начинают жестикулировать так оживлённо, что движения становятся практически неразличимы.
    0x92A0, // Мише, кажется, немного трудно воспринять это всё зараз.
    0x9305, // А-ха-ха~! Ой, прости!
    0x9328, // Ситтян просит передать, что она староста класса и, если тебе нужно о чём-то узнать, можешь её спрашивать.
    0x93E6, // Как тебе школа? Мы можем показать тебе окрестности, если ты ещё не успел побродить и…{w=0.5}{nw}
    0x948D, // ознакомиться?{w=0.5}{nw}
    0x94B2, // со всем самостоятельно!
    0x94DE, // Миша на мгновение спотыкается на трудном слове, невольно выделив его на фоне в целом беглого перевода.
    0x959A, // Спасибо, это было бы здорово. Я, как приехал, сразу отправился в класс.
    0x9619, // Нехорошо! Нужно заранее как можно больше узнавать о местах, в которые собираешься отправиться. И это касается не только школы~!
    0x9701, // Всегда! Даже если это поход в магазин! Так ведь, Ситтян? Ха-ха-ха~!
    0x9776, // Узнавать о местах, в которые отправляешься? Я так никогда не поступал, точнее никогда не заботился о таких вещах.
    0x9844, // Я не желал этого перевода, просто кое-как мирился с ним.
    0x98A9, // Я ничего не произношу вслух, и Миша делает несколько жестов, под конец пожав плечами. Что это было? Видимо, что-то обо мне.
    0x9985, // Я чувствую себя так, будто сел мимо стула. Они улыбаются, но это её пожатие плечами неожиданно сильно меня задело.
    0x9A54, // Ты какой-то грустный, с тобой всё в порядке?
    0x9AA3, // Пожалуйста, не пойми меня неправильно~! Ненавижу, когда люди боятся задавать вопросы! Ведь только так и можно научиться чему-либо – спрашивая~!
    0x9BA8, // Просить помощи совершенно нормально, так же как и нуждаться в ней! Прекрати выглядеть так, словно ты только что провалился на экзамене!
    0x9C9F, // Ва-ха-ха-ха~!
    0x9CB5, // Хорошо.
    0x9CC3, // А, и ещё! Тебе не обязательно обращаться к Ситтян официально – «Хакамити» или «староста», – можешь звать её просто Ситтян!
    0x9DA3, // А-ха-ха~! Ладно, наверное это слишком нескромно. Может, «Сидзунэ» будет лучше?
    0x9E2F, // Угу, угу~! «Сидзунэ» подходит!
    0x9E65, // Хех, ладно. Мне так будет намного проще.
    0x9EAD, // Мне становится гораздо спокойнее. Они кажутся столь дружелюбными, что я чувствую себя глупо из-за недавнего страха. Особенно из-за Сидзунэ, которая, как я думал, будет слишком строгой.
    0x9FFC, // То есть она такая и есть. Просто не настолько, насколько я опасался.
    0xA077, // …!
    0xA07C, // А? Точно, мы же ещё даже не притронулись к заданию! Надо сейчас же начинать работать, иначе Ситтян рассердится.
    0xA145, // К тому же задание довольно большое, так что если мы не приступим сейчас, то не успеем до конца урока.
    0xA1FB, // Ва-ха-ха~! И это тоже!
    0xA220, // Сидзунэ нетерпеливо на нас смотрит. Не требуется знать язык жестов, чтобы понять этот взгляд.
    0xA2CB, // Ладно, ладно, я понял.
    0xA2F2, // После занятий мы сможем погулять вместе. Сегодня такой хороший день! Ладно~?
    0xA37D, // Над заданием действительно приходится поработать: оно весьма трудное и чересчур большое.
    0xA422, // И всё же, начав с опозданием, мы заканчиваем раньше всех в классе. Сидзунэ и Миша и правда весьма способные.
    0xA4E5, // Однако они абсолютно разные. Староста спокойная и деловая, каковой и выглядит, Миша же гораздо более весёлая и легкомысленная. И совсем не такая усидчивая.
    0xA601, // По правде говоря, большую часть работы выполнили они. Мне от этого даже как-то неловко.
    0xA69F, // На башне с часами бьёт колокол, возвещая конец урока. Время ланча.
    0xA717, // Мне ничего не остаётся, кроме как последовать за Мишей, которая ведёт меня в коридор и дальше, вниз по лестнице.
    0xA7E2, // Мы спускаемся на самый нижний этаж, ещё ниже того вестибюля, где я встретил Муто.
    0xA875, // Как и везде в этой школе, в столовой много свободного места, а её современное убранство контрастирует со старинной архитектурой самого здания.
    0xA97B, // Большие арочные окна смотрят во двор, в сторону главных ворот.
    0xA9ED, // Это – столовая~!
    0xAA0B, // Энергичное утверждение столь очевидного факта заставляет людей вокруг оглянуться на нас, но Мише, кажется, всё равно, и мы спокойно встаём в очередь.
    0xAB1C, // Меню поражает меня широтой ассортимента, но вскоре я понимаю, что большинство блюд предназначены для учеников с определённой диетой.
    0xAC11, // Как мило. Я будто снова попал в больницу, где порции отмерялись с математической точностью, чтобы выдать нужную пациенту дозировку.
    0xAD02, // Я выбираю себе что-то наугад и, последовав за Сидзунэ к столику, сажусь напротив неё.
    0xAD9C, // Пока я безразлично ковыряюсь в еде, которую предпочёл бы вовсе не есть, Миша толкает меня в бок и указывает на Сидзунэ.
    0xAE74, // Я не знаю языка жестов, так что всё равно ничего не понимаю.
    0xAEE0, // Но, может быть, так принято – смотреть не на переводчика, а на того, кто к тебе обращается?
    0xAF83, // Ты хочешь о чём-нибудь узнать?
    0xAFBA, // Например?
    0xAFCC, // О чём угодно! Ведь мы твои проводники, так что не стесняйся спрашивать, если есть о чём~!
    0xB06B, // Девочки начинают оживлённо жестикулировать, косясь на меня, но Миша воздерживается от перевода.
    0xB11C, // Может, обсуждают какие-то девчачьи секреты?
    0xB16C, // Я быстро понимаю, что беседы на языке жестов недостаточно, чтобы заполнить тишину.
    0xB203, // Мы рано возвращаемся в класс, но, оказывается, мы там уже не первые.
    0xB27D, // Темноволосая девочка, которую я заметил ранее, склонилась над своей партой в последнем ряду.
    0xB327, // Она слегка вздрагивает, когда Миша вламывается в класс с изяществом носорога.
    0xB3B6, // Она ещё глубже вжимается в стул. Я издалека чувствую исходящее от неё напряжение, будто из-за нашего присутствия она медленно превращается в камень.
    0xB4C6, // Не обратив на это никакого внимания, Сидзунэ и Миша проходят мимо неё на свои места, не переставая жестикулировать.
    0xB599, // Но я продолжаю думать о ней, пока класс медленно заполняется учениками и, наконец, не приходит учитель.
    0xB655, // Странно вновь вливаться в ритм школьной жизни: будто мой мозг помнит, что это такое, но тело позабыло, как это делается.
    0xB72E, // К концу занятий я начинаю зевать и считать оставшиеся минуты.
    0xB79F, // Нехорошо так уставать в первый же день.
    0xB7E7, // Наверное, всё дело в долгом пребывании в больнице. Я физически ощущаю вялость и бессилие.
    0xB88A, // Наконец-то звенит последний звонок.
    0xB8CC, // Занятия на сегодня окончены.
    0xB901, // Сидящие рядом Миша и Сидзунэ обмениваются несколькими жестами. После небольшой заминки Миша поворачивается ко мне.
    0xB9D6, // К сожалению, мы не сможем остаться и показать тебе окрестности, Хиттян. У нас много работы на сегодня, поэтому нам уже пора.
    0xBAB6, // Ты и сам найдёшь дорогу, я не сомневаюсь.
    0xBB00, // Эй, постойте! Учитель сказал, что мне надо зайти в медкабинет. Где он находится?
    0xBB90, // Вот как? Ну, думаю, это мы сможем тебе показать~!
    0xBBE6, // Пошли, у медиков отдельное здание, так что нам надо выйти на улицу.
    0xBC5F, // Мы присоединяемся к потоку учеников, спускающихся вниз по лестнице и далее, на улицу. По пути девочки показывают кабинеты других старших классов, находящиеся на нашем этаже.
    0xBD9D, // Выйдя на улицу, они направляются к небольшому строению рядом со школой.
    0xBE20, // Оно построено в том же стиле, что и главное здание, поэтому кажется его частью.
    0xBEAF, // Это административный корпус. Внутри – много важных служебных помещений, таких как офис интерната «Ямаку» и медкабинет. Тут даже бассейн есть!
    0xBFB4, // Это тоже служебное помещение?
    0xBFEB, // Не глупи, Хиттян! Он нужен для физиотерапии, конечно.
    0xC04B, // В общем, медицинские кабинеты тоже находятся тут. Кабинет, который тебе нужен, – на первом этаже.
    0xC0FC, // Дальше ты и сам найдёшь дорогу, да~? Тогда мы пойдём! До завтра!
    0xC16D, // Ага, спасибо. Пока.
    0xC18F, // Целое здание для персонала, никак не связанного с обучением?
    0xC1FE, // Наверное, для такого места это необходимо.
    0xC24C, // Я вхожу внутрь, надеясь, что это и правда будет лишь краткий визит, как говорил учитель.
    0xC2EB, // На белой двери с зелёным крестом прибита табличка с надписью «Главный фельдшер» и именем.
    0xC390, // Я стучу в дверь, и тут же из-за неё раздаётся неразборчивый возглас.
    0xC40B, // Приняв его за приглашение войти, я открываю дверь.
    0xC467, // Комната небольшая, и в ней странно пахнет. Когда я вхожу, ко мне разворачивается сидящий в офисном кресле приветливый мужчина.
    0xC54E, // На его столе порядок, но под ним стоит корзина, переполненная использованными медицинскими принадлежностями, на столе виднеется по меньшей мере дюжина следов от кружки с кофе.
    0xC691, // Добрый день! Чем могу помочь?
    0xC6C6, // Он выглядит молодо и немного сурово, однако ямочки на щеках стирают это впечатление, когда он улыбается.
    0xC785, // Кхм, это вы фельдшер?
    0xC7AB, // Он улыбается с видом человека, который не раз слышал подобный вопрос.
    0xC82A, // Ну да. Так написано на двери, разве нет?
    0xC871, // Можешь обращаться ко мне по имени или просто «фельдшер», как и все остальные.
    0xC8FE, // Конечно. Я прогоняю смущение, поняв, что мне следует пожать протянутую им руку.{w} Его рукопожатие оказывается крепким и дружеским.
    0xC9EC, // Да… эм-м, я новый ученик, и мой классный руководитель сказал зайти к вам. Меня зовут Хисао Накай.
    0xCA9B, // Он оживляется и щёлкает пальцами.
    0xCAD9, // А, тот самый Накай! Я читал твою медицинскую карту с утра.
    0xCB41, // Хроническая аритмия и врождённый порок сердца, не так ли?
    0xCBAA, // Он жестом указывает мне сесть в кресло напротив него.
    0xCC0C, // Ну да.
    0xCC17, // Отлично. Думаю, тебе уже вкратце рассказали о школе, так что я быстренько пройдусь по основным пунктам.
    0xCCD3, // У нас тут имеются все необходимые службы, в основном предназначенные для физиотерапии и тому подобного.
    0xCD92, // Поблизости всегда есть кто-нибудь из персонала, даже ночью, так что не стесняйся обращаться к нам, если возникнут проблемы.
    0xCE73, // Тот самый знаменитый медперсонал с круглосуточным дежурством.
    0xCEE7, // Ух ты, прямо как в больнице.
    0xCF19, // Ну, не совсем. К примеру, мы здесь не проводим операции на мозге.
    0xCF8D, // Его шутка столь неуместна, что я не понимаю, зачем он вообще это сказал.
    0xD00F, // Да уж… Просто мне непривычно такое количество медперсонала в школе.
    0xD08D, // Скоро привыкнешь.
    0xD0AE, // Я не так в этом уверен, однако не считаю нужным оповещать его об этом.
    0xD12C, // Давай-ка я снова найду твою медкарту…
    0xD172, // Пока он ищет что-то в компьютере и тасует пачки бумаг на столе, я осматриваюсь вокруг.
    0xD20E, // Обстановка представляет собой воплощённую заурядность.
    0xD276, // Бежевые стены и потолок, пол, покрытый тёмно-серым ламинатом, и оборудование, которое ожидаешь увидеть в кабинете у школьного медработника.
    0xD376, // А на стенах висят нелепые плакаты, призывающие меня правильно питаться – три раза в день и полным набором продуктов.
    0xD44C, // Фельдшер с довольной улыбкой извлекает из кипы бумаг толстенную папку и открывает её.
    0xD4EA, // Так, ты уже принимаешь лекарства от аритмии, просто не забывай делать это утром и вечером, иначе от них будет мало пользы.
    0xD5C7, // Помимо этого… ты занимаешься спортом? Активным? Например, не знаю… боксом?
    0xD651, // Он улыбается собственной шутке, но я её игнорирую.
    0xD6AD, // Ну, я, бывало, играл в футбол с одноклассниками.
    0xD703, // Ясно. Боюсь, мне придётся порекомендовать тебе воздержаться от этого, по крайней мере на время обучения здесь.
    0xD7CD, // Угу.
    0xD7D5, // Он приподнимает брови в ответ на мою вялую реакцию, но сейчас меня и в самом деле не особенно заботит запрет пинать мяч.
    0xD8AF, // Думаю, я делал это не из-за горячей любви к спорту, а просто чтобы убить время.
    0xD93C, // Любой удар в область сердца для тебя очень опасен, и рисковать схлопотать очередной приступ было бы не очень хорошей идеей.
    0xDA1E, // Предыдущий приступ тоже был вызван ударом? В бумагах об этом не упоминается.
    0xDAAA, // Ну… не совсем.
    0xDAC5, // Я уклоняюсь от ответа, и он серьёзно смотрит на меня поверх бумаг.
    0xDB3D, // Но всё равно тебе нужно поддерживать форму и кое-какие упражнения пойдут на пользу.
    0xDBD6, // Как я уже сказал, у нас есть кабинет физиотерапии, но я не думаю, что в твоём случае она столь необходима.
    0xDC94, // Просто регулярно выполняй простые упражнения.
    0xDCEA, // Небольшие прогулки или даже бег трусцой, скакалка и тому подобное. Например, плавание. У нас тут есть бассейн.
    0xDDB2, // Мне уже сказали.
    0xDDD0, // Да? Очень хорошо.
    0xDDEF, // В любом случае, хоть я и уверен, что тебе это уже говорили, будь осторожен и не переутомляйся.
    0xDE98, // Он грозит пальцем, чтобы подчеркнуть важность своих слов. Впрочем, я действительно слышал это уже тысячу раз.
    0xDF60, // Никакого ненужного риска. Береги себя.
    0xDFA7, // Он ещё раз пробегает глазами по моим бумагам и откладывает их на край стола, по-видимому удовлетворённый.
    0xE068, // Хорошо. Тогда всё. Приходи, если ещё что-нибудь понадобится.
    0xE0D5, // Меня выпроваживают так быстро, что я даже не успеваю опомниться. И правда, краткий визит.
    0xE177, // Передо мной открывается вид на главное и административное здания. Впрочем, на мой взгляд, они практически одинаковые.
    0xE24F, // Зато я впервые могу спокойно рассмотреть других учеников, поэтому просто стою и наблюдаю, как они выходят из школы и расходятся по своим делам – в общежитие или к воротам, за территорию.
    0xE3A3, // Кажется, они все знают, куда им нужно.
    0xE3E7, // И я всё ещё думаю, что большинство из них не выглядят настолько «особенными», чтобы ходить в специальную школу. Да и я тоже.
    0xE4C7, // Это делает меня одним из них?{w} Одним из нас?
    0xE517, // Я тоже должен идти, пока меня не потеряли.
    0xE563, // Пора ужинать, но я чувствую себя скорее уставшим, чем голодным.
    0xE5D6, // Пока я плетусь к общежитию, удаляясь от главного здания, усталость во мне только нарастает.
    0xE67D, // Между школой и общежитием раскинулся небольшой сквер. Кусты, цветы и наполняющий воздух сильный запах свежескошенной травы.
    0xE762, // Сквозь усталость мне приходит в голову мысль, что запах кажется таким непривычным просто потому, что я давно не был на свежем воздухе.
    0xE857, // Общежитие оказывается большим старомодным строением из красного кирпича, таким же помпезным, как и всё в этой школе. Я толкаю дверь и вхожу внутрь.
    0xE964, // С трудом выудив ключ из кармана, я отправляюсь искать свою комнату.
    0xE9DF, // Комната один-один-девять…
    0xEA10, // Несмотря на весь внешний антураж, внутри здание общежития выглядит современным, функциональным и скучным.
    0xEAD4, // Как и в главном здании, просторные коридоры, широкие двери и лифты в коридорах приспособлены для инвалидных колясок.
    0xEBAA, // Я заглядываю в первую попавшуюся комнату.
    0xEBF7, // Внутри несколько учеников смотрят телевизор.
    0xEC4B, // Один из них кивает мне и бросает «привет», прежде чем вновь отвернуться к экрану.
    0xECDF, // Видимо, общительны здесь только девушки. Что ж, меня это вполне устраивает.
    0xED68, // Я поднимаюсь на второй этаж.
    0xED9C, // Здесь коридор разветвляется на небольшие блоки.
    0xEDF5, // В каждом из этих блоков расположены четыре комнаты и общие туалет и душевая.
    0xEE81, // Примерно в середине коридора одного из них я и нахожу комнату 119.
    0xEEF7, // Именные таблички на дверях напротив пусты. Видимо, нас тут только двое.
    0xEF79, // Из-под двери комнаты 117 виден свет, и я тихонько стучусь туда.
    0xEFE8, // Эй, есть кто дома?
    0xF008, // Внутри слышится возня, затем щёлкает гораздо больше замков, чем можно было ожидать. Через мгновение дверь со скрипом открывается.
    0xF0F6, // На пороге стоит парень в очках; он пристально смотрит на меня сквозь невероятно толстые линзы.
    0xF1A3, // Кто там?
    0xF1B2, // Слепой? Нет, видимо не совсем, иначе зачем ему очки…
    0xF211, // Он подходит ко мне так близко, что наши носы чуть не соприкасаются. От него воняет чесноком.
    0xF2B8, // Хисао Накай. Я буду жить в соседней комнате. Я подумал, что мне следует предста—
    0xF34A, // Его лицо неожиданно проясняется, и он, отступив назад, с улыбкой протягивает руку куда-то в область моей диафрагмы.
    0xF41C, // О, привет, чувак. Я Кендзи.
    0xF44B, // Привет.
    0xF459, // Я пожимаю его потную ладонь, слегка опешив от резкой перемены его настроения и столь пылкого приветствия.
    0xF51B, // В твоей комнате недавно были какие-то подозрительные люди.
    0xF587, // Вероятно, это были мои родители.
    0xF5C2, // Родители? Ты уверен? Ведь это могли быть и какие-то другие люди. Никогда не стоит судить о книге по обложке.
    0xF684, // Это неуместное сравнение повисает между нами, пока я пытаюсь придумать, что бы ответить.
    0xF726, // Вероятность этого достаточно высока.
    0xF76B, // Он вздрагивает и делает неопределённый жест руками.
    0xF7CB, // Да ты храбрец, Хисао.
    0xF7F1, // А вот я бы не стал доверять вероятности.
    0xF83A, // Единственный, кому я доверяю, – это я сам.
    0xF886, // Значит, у тебя нет оснований доверять и моим словам.
    0xF8E5, // Он ненадолго задумывается.
    0xF917, // Верно подмечено.
    0xF936, // Чёрт, а ты умнее, чем кажешься.
    0xF96D, // Возможно.
    0xF97F, // Как ты выглядишь? Надеюсь, не как какой-нибудь умник?
    0xF9DF, // Он щурится и снова наклоняется ко мне, однако я отступаю назад.
    0xFA52, // Ладно, неважно.
    0xFA6E, // Он разворачивается, замешкавшись на мгновение, чтобы нашарить дверную ручку,{w=0.3}{nw}
    0xFB07, // и захлопывает за собой дверь.
    0xFB3D, // Я вставляю ключ в замочную скважину комнаты номер 119.
    0xFB9E, // Унылые бежевые стены, белое постельное бельё, стол из какого-то светлого дерева. Уродливые занавески.
    0xFC58, // Ничья комната. Лишённая всякой индивидуальности, как больничная палата.
    0xFCDD, // Рядом с кроватью валяются мои сумки, уже гораздо более пустые, чем были с утра.
    0xFD6C, // Открытый шкаф забит моей одеждой.
    0xFDAA, // Я замечаю несколько комплектов школьной формы.
    0xFE01, // К рукаву одной из рубашек приколота записка.
    0xFE53, // Ну, по крайней мере, мне не нужно беспокоиться о распаковке вещей.
    0xFECB, // Хотя я надеялся, что можно будет ненадолго занять себя этим.
    0xFF39, // Ещё довольно рано.
    0xFF5B, // Совершенно измотанный, я кладу записку на стол и ложусь.
    0xFFC2, // Стоит мне только растянуться на кровати, как меня охватывает жажда чтения, но книг я с собой не взял.
    0x10079, // Очевидно, это сказывается больничная привычка читать, когда больше нечем заняться.
    0x10112, // Во мне нарастает странное беспокойство, в конце концов заставляющее меня встать.
    0x101A7, // Может, это из-за стресса?
    0x101D4, // Я нервничал перед тем, как попасть сюда, и затем весь сегодняшний день. Наверное, продолжаю нервничать и сейчас.
    0x102A0, // Чёрт, мне надо как-то отвлечься, чтобы не быть постоянно таким скованным.
    0x10325, // Завтра пойду и возьму пару книг в библиотеке.
    0x10378, // Точно, так и сделаю.
    0x1039C, // А пока…
    0x103AB, // Моё внимание привлекают аккуратно расставленные на прикроватном столике пузырьки с лекарствами.
    0x1045F, // Я беру один и трясу, просто чтобы услышать, как загремит содержимое, а затем читаю приклеенную этикетку.
    0x1051D, // На самом деле надпись немного другая, но смысл примерно такой.
    0x1058F, // Это ненормально, когда твоя жизнь зависит от лекарств. Меня это раздражает, но разве у меня есть выбор?
    0x1064A, // Со вздохом я приступаю к своему новому ежедневному ритуалу приёма нужного количества таблеток, внимательно следя за дозировкой.
    0x10737, // Я снова ложусь, а затем долго смотрю на незнакомый и ничем не примечательный потолок, чувствуя внутри пустоту и неуверенность.
    0x1081F, // Потолок продолжает казаться чужим и когда комната погружается во тьму, а по стенам, словно пальцы, протягиваются тени.
    0x108F8, // Но постель становится чуть уютнее по сравнению с тем холодом, который считается тут комнатной температурой: смявшиеся простыни образовали подобие тёплого гнезда.
    0x10A24, // Скоро потолок превращается в смутную тень и начинает выглядеть как любой другой потолок ночью, оставшись единственной вещью, которую я ещё могу различить.
    0x10B41, // Ночь зовёт меня в сон, и я снова чувствую, как по моей спине ползёт холод от страха и неизвестности.
    0x10BF5, // Я уплываю всё дальше от знакомого мне мира.
    0x10C44, // Зачем? Это обязательно?
    0x10C6F, // Конечно нет. Поэтому я и спрашиваю.
    0x10CAF, // Ладно.
    0x10CBB, // Ну, тогда пойдём.
    0x10CDA, // Да, конечно. В смысле, мне кажется, что так принято.
    0x10D36, // Разумеется. Просто не все любят быть в центре внимания.
    0x10D9B, // Наверное, я как раз из таких людей, но лучше бы мне произвести первое впечатление самостоятельно.
    0x10E4D, // Бывает, но для меня это не проблема.
    0x10E8E, // Ах да. В этой школе есть библиотека? В последнее время я увлёкся чтением, так что хотел бы туда сходить.
    0x10F49, // Миша одаряет меня хмурым взглядом, дающим понять, что она не считает чтение здоровой привычкой, но затем улыбка снова возвращается к ней.
    0x11044, // Есть~! На втором этаже, мы потом тебе покажем!
    0x11096, // Спасибо.
    0x110A6, // Я возвращаюсь к еде, а девочки тем временем общаются между собой.
    0x1111D, // Сидзунэ меня интересует, и мне хочется спросить что-нибудь о ней.
    0x11194, // Но ведь я не могу спрашивать о чём-то столь личном, правильно?
    0x11204, // Хм…
    0x1120C, // Я не могу придумать другого вопроса, поэтому просто возвращаюсь к еде, а девочки тем временем общаются между собой.
    0x112DF, // Честно говоря, на ум ничего не приходит.
    0x11328, // О! Значит, мы были хорошими проводниками, правда, правда~?
    0x11390, // Э… Как скажешь…
    0x113AF, // Миша радостно улыбается и быстро переводит мои слова, после чего улыбка появляется и на лице Сидзунэ.
    0x11469, // На их избыточный энтузиазм я качаю головой и сосредотачиваюсь на еде.
    0x114E9, // Ты хочешь сам представиться классу?
    0x1152B, // Зачем?
    0x11537, // Да, конечно.
    0x1154D, // Хм, интересно…
    0x11569, // Спросить о библиотеке.
    0x11593, // Спросить о глухоте Сидзунэ.
    0x115C6, // Думаю, я уже знаю всё, что мне нужно.
    0x11607, // После этого в классе повисает пауза, намекающая мне, что следует наконец что-то сказать.
    0x116A8, // Ну… Я – Хисао Накай.
    0x116CE, // И что ещё?
    0x116E0, // Я увлекаюсь чтением и футболом. Надеюсь, что мы поладим, хоть я здесь и новенький.
    0x11774, // А ещё что?
    0x11786, // Я ужасно скучен. Самопредставление до невозможности банальное. Надо придумать что-нибудь ещё. Что-нибудь поинтереснее.
    0x11861, // …В итоге я так ничего и не говорю и учитель продолжает за меня.
    0x118D4, // Впрочем, кажется, все вполне удовлетворены и той малостью, что я рассказал. Несколько девочек перешёптываются, бросая на меня взгляды. Могло быть и хуже.
    0x119EB, // После этого в классе повисает пауза, которую никто не торопится прервать.
    0x11A72, // Учитель понимает, что пора сказать что-нибудь ещё. Он неразборчиво произносит моё имя и умолкает, потеряв настрой.
    0x11B43, // После этого он пытается рассказать обо мне классу, но никто не проявляет особого интереса.
    0x11BE9, // Может быть, мне стоило представиться самому?
    0x11C3B, // Вероятно, поняв, что толком ничего обо мне не знает, он заканчивает тем, что снова перевирает моё имя и просит написать его на доске.
    0x11D2B, // Я делаю это и поворачиваюсь к классу, чувствуя себя идиотом.
    0x11D99, // Похоже, он очень интересный человек, правда~?
    0x11DEB, // Миша окидывает меня странным взглядом, а затем продолжает.
    0x11E57, // Мы о нём почти ничего не знаем, но, наверное, узнаем позже.
    0x11EC0, // Всё же мне следовало рассказать о себе самостоятельно. Что угодно – это позволило бы сложить первое впечатление о себе куда лучше, чем невнятное бормотание учителя и путаница с именем.
};

#endif // KS_SCRIPT_A1_MONDAY_RU_TL_INDEX