#ifndef KS_SCRIPT_A1_SATURDAY_RU_TL_INDEX
#define KS_SCRIPT_A1_SATURDAY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int script_a1_saturday_ru_intl[] = {
    0x0000, // На утренний субботний урок одноклассники являются с красными от недосыпания глазами, будто работали всю ночь напролёт.
    0x00DC, // Когда на подготовку остаётся всего один день, это неудивительно. Хорошо, что страдать нам на уроке только до большой перемены, а потом мы станем хозяевами своего времени.
    0x0213, // Муто, покачиваясь, усталой походкой входит в класс. Полагаю, ученики – не единственные здесь, кто любит весело проводить вечер пятницы.
    0x030B, // Не говоря ни слова, он корябает на доске номера страниц и вопросов и плюхается за свой стол.
    0x03B2, // Это совсем на него не похоже, но, кажется, никто из класса не возражает.
    0x0433, // Все молча листают учебники и принимаются за работу. Не желая выделяться, я поступаю так же.
    0x04D9, // Усталость делает всех в классе замкнутыми; помимо шуршания бумаги, сейчас не слышно ни писка.
    0x0584, // Отчасти вносит свой вклад и то, что два места рядом со мной сейчас пустые. По какой-то причине Миша и Сидзунэ отсутствуют – возможно, они выполняют связанную с фестивалем работу в Совете.
    0x06D9, // Без Миши в классе очень спокойно.
    0x0716, // Интересно, она от рождения такая шумная или пытается «возместить» отсутствие голоса у Сидзунэ?
    0x07C5, // Накай, можно тебя на минутку?
    0x07FA, // Я так поглощён мыслями о Мише, что не замечаю, как Муто подходит к моей парте.
    0x0886, // Конечно… слушаю.
    0x08A6, // Наверное, лучше будет поговорить вне класса…
    0x08FA, // Что-то мне это не очень нравится, но я встаю и выхожу вслед за ним.
    0x0971, // Уже стоя в коридоре, Муто чешет затылок, собираясь с мыслями. Не понимая, что происходит, я просто стою и жду.
    0x0A36, // Тогда перейдём ко второму вопросу: как тебе учёба? Я понимаю, что ты довольно долго не занимался. Мы не слишком далеко ушли?
    0x0B16, // Нет, не думаю. Я старался не отставать, пока лежал в больнице, поэтому догнать было не так сложно.
    0x0BC6, // Муто задумчиво постукивает себя по подбородку и приподнимает бровь, переваривая информацию.
    0x0C71, // Вот оно как… Всё же остались ещё ученики, осознающие важность образования…
    0x0CFD, // Это, конечно, громко сказано. Я просто пытался чем-то занять себя, сидя в крохотной жизнеподдерживающей тюрьме.
    0x0DC8, // Ну да. В таких вещах отставать нельзя, так ведь?
    0x0E1E, // Именно так. Один неверный шаг в этом мире – и ты останешься далеко позади, верно?
    0x0EB1, // Э-э, да. Не хотел бы я, чтобы такое случилось.
    0x0F01, // Конечно, не хотел бы. Научные открытия совершают каждую неделю. Большинство из них ничего не дают простому обывателю, но любое из них может стать ключевым на пути к Следующему Великому Открытию.
    0x1064, // Я это запомню…
    0x1080, // На этом, очевидно, Серьёзный Разговор Муто заканчивается, и он возвращается к своему обычному, слегка рассеянному подходу к жизни.
    0x116F, // Вспоминая предыдущие разговоры с ним, я думаю, таким он мне нравится больше. Он чуть более предсказуем благодаря своей непредсказуемости.
    0x126C, // Ну, думаю, сказано было достаточно. Давай вернёмся в класс.
    0x12D7, // От этого предложения я испытываю ни с чем не соизмеримое облегчение.
    0x1355, // Конечно. Вы ведь главный, верно?
    0x138F, // Муто на секунду останавливается.
    0x13CC, // Кажется, никто из учеников мне ещё такого не говорил.
    0x142D, // Я на мгновение задумываюсь, стоит ли на это ответить, но что-то глубоко внутри подсказывает мне, что лучше бы заткнуться и вернуться в класс.
    0x152D, // Несколько ребят вздрагивает от звука открывающейся двери, тут же пытаясь притвориться работающими над заданием.
    0x15FD, // Некоторые же так и продолжают дремать, положив головы на парты. К счастью, Муто их даже не замечает.
    0x16B2, // Вернувшись за свой стол, он достаёт из выдвижного ящика научный журнал. Наверное, это из-за нашего с ним разговора.
    0x1783, // В классе воцаряется та же почти полная тишина, в которой мы с Муто его оставляли, уходя на разговор.
    0x1838, // В комнате витают смешанные чувства усталости и ожидания. Каждый ожидает либо шанса отдохнуть, либо возможности приступить к последней фазе приготовлений.
    0x1955, // Настенные часы лениво отсчитывают время до конца урока, пока наконец не звонит колокол, освобождающий от мучений.
    0x1A26, // Пока вы не ушли, напоминаю, что в понедельник я жду от вас ответы к задачам.
    0x1AAE, // Все как один вздыхают, тут же жалея о потраченном зря времени на уроке, но всё ещё остро ощущая давление более насущных задач.
    0x1B93, // Кабинет в мгновение ока пустеет, поскольку все спешат приступить к последним приготовлениям перед праздником.
    0x1C5F, // Я остаюсь и пытаюсь быстро дорешать задачи, чтобы не беспокоиться о них остаток выходных, потому что завтра фестиваль и всё такое.
    0x1D4D, // Кроме меня в классе задерживается только Ханако, вероятно ожидающая Лилли.
    0x1DD7, // Странно, что Лилли идёт аж до нашего класса, чтобы забрать Ханако. Ей приходится делать крюк, и мне кажется, что передвигаться по школе для неё всё же несколько труднее, чем для Ханако.
    0x1F25, // Но это не моё дело, поэтому я, естественно, не спрашиваю Ханако об этом.
    0x1FA6, // Несмотря на относительную близость наших мест, никто из нас не пытается завязать беседу на какую-нибудь тему, и в классе воцаряется гнетущая тишина.
    0x20B6, // Время проходит в молчании. Те пятнадцать минут, что мы вот так сидим, по ощущениям тянутся гораздо дольше. Я листаю свою тетрадь. Ханако листает свою книгу.
    0x21D1, // Грифель моего механического карандаша рассыпается о бумагу, как раз когда я собираюсь дописать абзац.
    0x228D, // Звук моего раздражённого вздоха и следующая за ним возня, кажется, рушат атмосферу.
    0x2326, // Ханако решительно избегает смотреть в мою сторону.
    0x2384, // Вскоре в дверях появляется высокая фигура Лилли.
    0x23DE, // Ханако?
    0x23EC, // Ханако оказывается достаточно того, что её позвали по имени, чтобы вскочить и подбежать к Лилли.
    0x249C, // Они недолго спокойно разговаривают, затем Лилли уходит, а Ханако возвращается в класс и снова садится за парту.
    0x2568, // Из чистого любопытства я краем глаза слежу за ней: почему же они разделились?
    0x25F5, // Пару минут она просто сидит, подперев рукой подбородок и уныло уставившись в парту.
    0x268E, // Однако скука её одолевает, и она вынимает из портфеля тонкую книжку.
    0x270B, // Кстати, это не та, которую, как я видел, она читала в библиотеке. Должно быть, она быстро читает, раз меняет их так часто.
    0x27E3, // Минут через десять постоянного ёрзания за партой и попыток начать читать, Ханако закрывает книгу и тоже уходит.
    0x28B0, // Пора уйти и мне, поскольку задание я почти закончил, а больше в классе делать нечего.
    0x294A, // Однако каких-либо дел в других местах у меня тоже нет.
    0x29AC, // Школа напоминает пчелиный улей, но никто не обращает на меня внимания.
    0x2A2D, // Я прогуливаюсь мимо кабинетов, наполненных учениками, яростно вовлечёнными в какие-либо дела, суетящихся, словно рабочие пчёлы.
    0x2B18, // И не скажешь, что учебный день закончился.
    0x2B65, // Снаружи вроде немного тише, но только самую малость.
    0x2BC5, // Народ вокруг суетится, изо всех сил стараясь успеть к сроку. Все кажутся занятыми и полными энергии.
    0x2C7C, // Я же испытываю противоположные чувства. Полуденное солнце словно бы вытягивает из меня весь дух, заставляя еле волочить ноги.
    0x2D63, // Тёплый мягкий, как подушка, воздух задувает под рубашку.
    0x2DCA, // Лениво зевая, я раздумываю о том, чем же заняться.
    0x2E24, // Сначала скину книжки в общежитии, а потом… я ещё не решил.
    0x2E8E, // Может быть, Кендзи у себя.
    0x2EBD, // По дороге в общежитие я встречаю Эми. Она бежит, несмотря на то что сегодня не надела свои странные беговые протезы. Я машу ей, и она, притормозив, останавливается.
    0x2FE5, // Хай, Хисао!
    0x2FF9, // Её нос и подбородок украшают брызги белой и зелёной краски, но она, как всегда, широко улыбается.
    0x30A9, // Она всем телом подаётся ко мне, усиливая чувство, что изучает меня.
    0x3123, // Чё делаешь?
    0x3138, // Да ничего, собственно. Я ничего не готовлю к фестивалю, а все, кажется, заняты чем-то архиважным.
    0x31E6, // Прекрасно! Значит, ты сможешь помочь нам с Рин!
    0x323B, // С подготовкой к фестивалю? Э-э, ну не знаю, будет ли от меня польза.
    0x32B3, // Ничего страшного! От меня тоже пользы немного!
    0x3308, // Эми хватает меня за запястье и с силой тащит обратно в школу.
    0x3377, // Даже скорость её шага больше напоминает бег, из-за чего я спотыкаюсь, стараясь не отставать.
    0x341F, // Лестница немного замедляет темп Эми. Может быть, ей трудно подниматься по ступенькам или она просто запыхалась.
    0x34EC, // Мы поднимаемся на третий этаж, и я оказываюсь там же, откуда ушёл всего пять минут назад. Если б я знал, то мог бы просто остаться тут и подождать Эми.
    0x35FA, // Так вы… Рин всё ещё работает над фреской?
    0x3646, // Именно! Ей нужны разные краски, кисти и прочее, так что я пошла взять их из кабинета рисования.
    0x36F1, // И тебе нужно, чтоб я тебе помог.
    0x372A, // Ну… Рин сказала, что ты ей уже помогал, и я подумала, что ты не будешь против.
    0x37B5, // Понятно.
    0x37C5, // Так, благодаря чудной логике Эми, я снова оказываюсь в кабинете рисования, собирая предметы для других людей.
    0x388D, // Кроме нас и пылинок, витающих в воздухе, в кабинете никого нет. Эми тут же направляется в конец класса, вытаскивая из кармана маленький скомканный клочок бумаги.
    0x39B3, // Пока она пытается разобрать каракули, я внимательнее присматриваюсь к лежащему вокруг инвентарю.
    0x3A67, // На полках расставлено множество банок и тюбиков с краской, в большинстве своём беспорядочно.
    0x3B12, // Некоторые выглядят так, будто стоят тут десятилетиями, – реликвии прошлых поколений кружка рисования.
    0x3BCF, // Рядом с массивными, аккуратно нагромождёнными стопками бумаги для рисования стоят коробки, полные кистей всевозможных размеров и не отсортированных цветных карандашей.
    0x3D08, // В тяжёлом воздухе витают запахи краски, скипидара и свежей бумаги, перемешиваясь и создавая аромат, который ни с чем нельзя спутать, – аромат искусства.
    0x3E1F, // Эми изучает свои записи, сверяясь с этикетками на банках, и передаёт их мне, находя нужные.
    0x3EC4, // Она вытягивает шею, чтобы заглянуть на верхнюю полку, но этого явно недостаточно.
    0x3F59, // Как она ни пытается, уровень её глаз остаётся ниже полки. Эми сдаётся и просто смотрит на полку, словно ребёнок в магазине игрушек, пыхтя от недовольства.
    0x4071, // После мгновения нарастающей ярости, она начинает подпрыгивать, пытаясь успеть прочесть надписи за те доли секунды, на которые они оказываются в поле её зрения.
    0x4196, // Неудивительно, что у неё ничего не получается и она едва не обрушивает весь стеллаж.
    0x4230, // Теперь я вижу, чем могу оказаться полезен.
    0x427D, // Эй, давай я. Тебе не прыгнуть достаточно высоко, а я не хочу, чтобы ты пострадала, пытаясь это сделать.
    0x4335, // К тому же я тебя раза в два выше.
    0x436F, // Вот и нет!
    0x4381, // Она поворачивается ко мне, пыша негодованием и покраснев.
    0x43EB, // Да шучу я, просто шучу. И всё равно давай я посмотрю, ладно?
    0x4455, // Она снова сердито на меня смотрит, но, не найдя что ответить, с недовольным «хм!» поворачивается ко мне спиной.
    0x451E, // Я принимаюсь рыскать по верхней полке в поисках нужной краски, в то время как Эми начинает копаться в ящиках, которые может достать.
    0x460F, // Убедившись дважды, что она не видит, я снисходительно качаю головой.
    0x468C, // То, что у Эми комплекс насчёт её роста, стало для меня неожиданностью. Я бы не подшучивал, если б знал.
    0x4744, // Характер у неё лёгкий, но, видимо, у всех свои слабости.
    0x47A8, // Только когда мы раскладываем все собранные предметы на парте, словно трофеи охотника за сокровищами, я понимаю, что она не обязательно обиделась именно на подколку о росте.
    0x48E4, // Может быть, ей просто не нравится, когда другие говорят, что она чего-то не может. Например, прыгать.
    0x4999, // Но Эми, кажется, сама уже обо всём этом забыла. Быстро обижается, быстро прощает… такой она человек?
    0x4A4F, // По крайней мере, на обратном пути к Рин она уже вовсю беспечно болтает. Видимо, она не принимает такие пустяки близко к сердцу.
    0x4B35, // Я по-рыцарски несу кипу вещей, пока мы идём к фреске.
    0x4B94, // Рин очень волнуется, успеет ли закончить картину. Но сама виновата, надо было начинать раньше.
    0x4C40, // А она успеет?
    0x4C58, // Даже не знаю. По мне, так уже выглядит хорошо, но с Рин никогда не угадаешь.
    0x4CDF, // Я нашла её сегодня утром в позе зародыша на крыльце общаги. Она не спала всю ночь. Поверить не могу, что дежурные медсёстры на неё не наткнулись.
    0x4DE5, // А теперь она снова рисует как сумасшедшая.
    0x4E33, // Да, я… заметил, что она бывает… одержимой. Так сказать.
    0x4E98, // Эта фраза и нотки смущения в моём голосе вызывают у Эми искренний смех.
    0x4F1A, // Я не считаю это чем-то плохим. Просто иногда она бывает немного странной.
    0x4F9F, // Насчёт этого могу с ней согласиться. В отличие от меня, Эми в ладах с… в общем, с тем, что так настораживает в Рин.
    0x506C, // Но всё же они, похоже, не так близки, как Миша с Сидзунэ. Те порой действуют как единая сущность, и трудно бывает сказать, где кончается одна и начинается другая.
    0x518F, // Несмотря на то что они такие разные, как и Эми с Рин.
    0x51ED, // А Рин отличается как от них, так и вообще ото всех, кого я когда-либо встречал.
    0x527A, // Да, полагаю она очень… своеобразная личность.
    0x52CF, // Я снова возвращаюсь к этому слову, будто оно заключает в себе характеристику Рин, хотя на самом деле является просто заменой длинному перечню её странностей.
    0x53F0, // Эми задорно смеётся, пока я ищу более подходящее описание.
    0x545B, // Она просто странная.
    0x5481, // Представляешь, недавно она просто просидела на коробке полчаса.
    0x54F7, // Сверля взглядом свои пальцы.
    0x552C, // Она снова хихикает, словно не знает, что именно тут смешного, – просто смешно, и всё тут.
    0x55CC, // Все полчаса.
    0x55E3, // На рабочей площадке царит полный беспорядок, но фреска стала занимать ещё большую часть стены с тех пор, как я её видел в последний раз.
    0x56DA, // Искажённые фигуры людей раскрашены в основном в красные, розовые и оранжевые тона; причудливые, фантастические… штуковины заполонили промежутки между ними.
    0x57FC, // Выглядит… неплохо. Я не могу придумать другого слова, которое описало бы работу лаконично и притом всеобъемлюще, поэтому склоняюсь к неопределённому «неплохо».
    0x5924, // Но, если честно, по мере продвижения фрески пространство вокруг стены превращается во всё больший бардак.
    0x59E6, // Земля усеяна десятками банок с краской, разными принадлежностями и пустыми бутылками из-под газировки.
    0x5AA4, // Сама Рин очень по-домашнему стоит среди всего этого хаоса и идеально вписывается в обстановку.
    0x5B52, // Штанины закатаны до колен, выставляя напоказ тонкие ноги, щеголяющие боевой раскраской, подобной той, что у Эми на лице.
    0x5C2D, // Эми забегает вперёд и ликующе прыгает перед Рин.
    0x5C86, // Я вернулась!
    0x5C9D, // Быстро. Опять бегала по коридорам?
    0x5CDC, // Хисао мне помог.
    0x5CFA, // Эми победоносно указывает на меня.
    0x5D3A, // Следуя глазами за пальцем Эми, Рин поворачивается и в упор смотрит на меня.
    0x5DC3, // Она рассеяно кивает. Вид у неё и в самом деле такой, будто она не спала со вчерашнего вечера: взгляд пустой, тусклый, она смотрит куда-то мимо меня, а движения вялы, словно в замедленной съёмке.
    0x5F1F, // Привет, Хисао. Спасибо за помощь.
    0x5F5B, // Да не благодари.
    0x5F79, // Только что это сделала.
    0x5FA4, // Проехали.
    0x5FB6, // Похоже, ты продвинулась. Выглядит здорово, насколько я могу судить.
    0x6031, // Но теперь на тебя обрушится ещё больше невезения.
    0x608C, // Знаю, я готов пойти на такой риск.
    0x60C9, // Это очень мило. Для меня, разумеется. Не для тебя.
    0x6122, // Поэтому художникам вечно не везёт. Им постоянно приходится смотреть на свои незаконченные картины.
    0x61D9, // Поэтому им не видать любовных приключений, их любимые сериалы снимают с показа или они умирают молодыми от какой-нибудь непонятной болезни. Это – глубокий и таинственный закон Вселенной.
    0x6331, // Если только они не слепые.
    0x6361, // Она обдумывает это какое-то время, выглядя так, будто сейчас уснёт.
    0x63DB, // Есть один мальчик.
    0x63FD, // В кружке рисования. Слепой мальчик. Так вот, он не видит.
    0x6463, // Ему нужно стать художником. Никакого невезения, гарантировано.
    0x64D7, // Вам это не кажется хорошей мыслью?
    0x6516, // Что только слепым следует становиться художниками? Нет, не особо.
    0x658E, // …
    0x6592, // Возможно, ты прав.
    0x65B3, // Бросив думать на эту тему, она снова переключается на мысли о работе и начинает напевать какую-то мелодию, которую я даже узнаю, только не могу вспомнить название.
    0x66DC, // Эми расставляет принесённые вещи и передвигает несколько банок с краской, пытаясь навести какой-никакой порядок.
    0x67AD, // Эми, мне нужна прусская лазурь.
    0x67E6, // Какая же из них – прусская лазурь?..
    0x6827, // Она беспомощно смотрит на семь или восемь банок с разными оттенками синего.
    0x68B2, // Та, в которой прусская лазурь.
    0x68E9, // Господи, Рин! Это совсем не помогло!
    0x692A, // Я тоже начинаю смотреть по сторонам, хоть и не знаю, как выглядит эта прусская лазурь. Интересно, какое отношение она имеет к Пруссии.
    0x6A1D, // …И что такое вообще эта Пруссия. Звучит знакомо, но никак не могу вспомнить.
    0x6AA8, // Хоть по виду своему ни одна банка не выделяется среди остальных своей пруссистостью, по ярлычкам вполне ясно, что содержание у них тоже не прусское.
    0x6BB7, // Нет здесь прусской лазури.
    0x6BE8, // Эми тяжело вздыхает.
    0x6C0E, // Значит, надо вернуться и взять.
    0x6C47, // Но я обещала помочь своему классу с проектом, поэтому вернусь попозже. Потерпишь без неё несколько часов?
    0x6D08, // Рин кивает, и Эми уходит.
    0x6D35, // Я остаюсь, потому что мне нравится смотреть, как рисует Рин, и потому что всё равно других дел у меня нет.
    0x6DF3, // Я сажусь на коробку и достаю из портфеля книгу. Она повествует о трёх парнях, которые полмесяца только то и делали, что пили пиво и ничего не делали.
    0x6F00, // Рин оставляет недокрашенным синий участок и переходит на другое место.
    0x6F83, // Её нога твёрдо водит кистью по оштукатуренной стене. Слой за слоем, фреска медленно обретает форму.
    0x7039, // Я не спеша переворачиваю страницы. В этой главе они пьют пиво у друга главного героя. В предыдущей – дома у самого главного героя.
    0x7126, // Это не захватывающий рассказ, а просто отрывок чьей-то выдуманной жизни, рождающий вопрос, зачем вообще было такое писать.
    0x7206, // И действительно, зачем? Причины занятия чем-то творческим… абсолютно непостижимы.
    0x729E, // Как, например, почему Рин рисует. Похоже, она, как и Эми, идёт против судьбы, действуя ей вопреки.
    0x734C, // Рин даже говорила что-то подобное. «Делать вещи, которые не можешь делать, просто потому, что можешь».
    0x7405, // Это она и имела в виду? Это её причина? Хотя это скорее причина Эми - она создаёт впечатление настойчивого человека.
    0x74D7, // А Рин такой атмосферы не создаёт. Если подумать, то она вообще никакой не создаёт. Или создаёт разную каждый раз, когда я с ней говорю.
    0x75CA, // Почему она сказала то, что сказала? Почему она, и вообще кто-либо, рисует, чертит, лепит скульптуры или пишет?
    0x768F, // У меня никогда не было творческих порывов, поэтому не думаю, что я способен это понять.
    0x772D, // Чувствую себя из-за этого пустым внутри.
    0x7777, // Какая мрачная мысль. Но я даже не могу определить, верна ли она.
    0x77EA, // Устраивает ли меня быть таким? Не могу отрицать, что немного завидую Рин, но и серьёзным недостатком это не считаю.
    0x78BB, // Я – это я, а она – это она.
    0x78EA, // И всё же мне нужно что-то найти. Что-нибудь, что бы помогло… немного разобраться в себе, вместо того чтобы топить себя в этих книгах, как я делал в больнице.
    0x7A04, // Я не могу отделаться от чувства растерянности; новая школа, стиль жизни, люди – всё вносит свой вклад в это ощущение.
    0x7AD9, // Я стараюсь вписаться в существующие социальные группы, и большинство из тех, кого я встретил, были очень милы.
    0x7BA2, // Но всё равно создаётся впечатление, что я чужак, будто мне здесь не место.
    0x7C28, // Я отгоняю это чувство, осознав, что слишком задумался. И книгу не читаю, и Рин не помогаю.
    0x7CC9, // Не попросив меня, она пытается налить ногами краску из большой банки. Хотя, может быть, она и просила, а я просто не слышал.
    0x7DA7, // Так или иначе, выглядит это опасно.
    0x7DE7, // Я тут же подскакиваю к ней, чтобы помочь, иначе она рискует залить краской весь тротуар.
    0x7E87, // Взяв из её ног банку, я наливаю немного в чашу.
    0x7EDB, // Мы помалкиваем. Она лишь раз бросает на меня взгляд из-под растрёпанной чёлки.
    0x7F6A, // По выражению её лица ничего понять невозможно. Оно бесстрастное, со слабой примесью лёгкого удивления.
    0x8027, // Интересно, о чём она думает? Возможно, спрашивает себя, о чём думаю я. А может быть, ни о чём.
    0x80CC, // Монетку бы дал за твои мысли.
    0x8101, // У тебя с собой есть монеты?
    0x8132, // Не думаю.
    0x8143, // Тогда я не думаю, что скажу. Но тебе повезло: я всё равно ни о чём не думаю. Кроме разговора.
    0x81E7, // Она с очень недовольным видом хмурится.
    0x8230, // Трудно ни о чём не думать. Но это важно.
    0x8277, // Я собираюсь спросить, почему это важно, но тут к нам подходит пожилой мужчина, у которого, похоже, дело к Рин.
    0x833C, // Добрый день. Как успехи?
    0x8368, // Справлюсь.
    0x837C, // Рин не отрывает глаз от стены и отвечает вполне естественно, поэтому я предполагаю, что они знакомы.
    0x8433, // Я ещё не встречал этого мужчину, и, естественно, мне интересно, кто это. Может быть, учитель?
    0x84D9, // Его волосы серебристо-серые, настолько яркие, что кажется, будто они окрашены. Я надеюсь, что это не так.
    0x8596, // На его переносице сидят маленькие круглые очки, но он постоянно смотрит поверх, а не сквозь них.
    0x8645, // Он пристально изучает фреску поверх упомянутых очков.
    0x86A9, // Хорошо, хорошо.
    0x86C5, // Какая у тебя тут сильная композиция!
    0x8708, // Он подходит, чтобы поближе рассмотреть фреску, размышляя о ней вслух довольно громко и не оставляя сомнений в том, что хочет, чтобы мы тоже слышали.
    0x8815, // Очень хорошо. Правда, очень хорошо…
    0x8857, // Я не знаю, как на это реагировать, но Рин, кажется, безразлично. Она оглядывает своё рабочее место, разбросанные повсюду чаши с красками различных оттенков.
    0x8973, // Хисао.
    0x897F, // М-м?
    0x8986, // Немного больше вот этого.
    0x89B5, // Секунду.
    0x89C5, // Я смешиваю пополам краски из двух банок, чтобы получить бледно-розовый оттенок, похожий на тот, что Рин использовала для человеческого лица.
    0x8AC6, // Рин наблюдает за моими действиями, из-за чего мне становится немного не по себе. На её лице написано такое бесстрастное выражение, что кажется, будто она только и ждёт, что я в чём-нибудь напортачу.
    0x8C2C, // Мужчина поворачивается, чтобы рассмотреть и меня, удивлённый, как будто только что заметил моё присутствие.
    0x8CF2, // …Может, так и есть.
    0x8D15, // О, привет. Кто это у нас тут?
    0x8D47, // А, я переведённый ученик из класса 3-3. Хисао Накай. Приятно познакомиться.
    0x8DCD, // Класс Муто, значит? Ну, ты в этом не виноват!
    0x8E1C, // Воздух сотрясают раскаты его хохота. Невероятно громкого. С соседнего дерева даже вспархивает несколько птичек.
    0x8EEB, // Я Синити Номия, учитель рисования.
    0x8F2A, // Так, значит, учитель рисования. Следовало бы догадаться. Он даже выглядит похоже.
    0x8FBE, // Как же оказалось, что ты стал помогать моей протеже?
    0x901D, // Значит, пойдём и принесём ещё.
    0x9054, // Я открываю рот, чтобы сказать, что для такой простой задачи, как поиск ещё одной банки прусской лазури, не требуются двое, но Эми хватает меня за руку и тащит за собой.
    0x9182, // Я машу Рин, которая, кажется, вообще не замечает, что мы уходим.
    0x91F4, // Ну, она заметит, когда ей понадобится прусская лазурь и она её не найдёт.
    0x9278, // Наверное.
    0x928A, // А может, и нет.
    0x92A4, // Пока я размышляю о том, какая Рин странная, Эми тащит меня в кабинет рисования.
    0x9333, // Я чувствую, что начинаю задыхаться.
    0x9374, // Что за спешка?
    0x938E, // А?
    0x9392, // Эми бросает на меня оценивающий взгляд, будто пытаясь в чём-то разобраться.
    0x941C, // Просто кажется, что ты спешишь.
    0x9455, // Не уверен, что угонюсь за тобой.
    0x948F, // Её лицо озаряет понимание.
    0x94C0, // Ты ведь не выдохся, а?
    0x94E7, // В её тоне слышится игривость с нотками осуждения.
    0x9542, // Сначала меня так и подмывает возразить, но тут я понимаю, что тяжело дышу с того самого момента, как мы остановились.
    0x9616, // Полагаю, всё довольно очевидно.
    0x9650, // Немного. Не могут же все быть в хорошей форме.
    0x96A3, // Люди разные бывают, понимаешь?
    0x96DB, // Эми хмурится. Это не предвещает ничего хорошего.
    0x9734, // Э… в общем…
    0x974B, // Мне надо… прийти в форму?
    0x977A, // Я, честно говоря, уже давно решил попробовать.
    0x97CE, // После того приступа на стадионе я понял, что и правда стоит завести привычку бегать.
    0x9868, // Всё-таки я неплохо себя чувствовал до той ложной тревоги.
    0x98D1, // Ну, по правде говоря, нет. Но это было… весело?
    0x9925, // Тем временем моя реплика подталкивает Эми к какому-то выводу.
    0x9996, // Тогда решено.
    0x99AF, // Она глядит на меня со всей серьёзностью.
    0x99F9, // Ты присоединишься ко мне.
    0x9A28, // Прости?
    0x9A36, // По утрам.
    0x9A47, // Мы с тобой теперь напарники по бегу.
    0x9A89, // Я уже составила подробную программу. На самом деле…
    0x9AE9, // Она достаёт скомканный листок бумаги.
    0x9B2F, // Она у меня как раз с собой.
    0x9B5F, // Я беру листок и пробегаюсь по нему глазами.
    0x9BAE, // Время, даты, круги – всё расписано.
    0x9BEE, // Медленный рост от нескольких кругов в день до…
    0x9C45, // Господи, она собирается заставить меня бегать марафоны?
    0x9CAC, // И где она только нашла время всё распланировать?
    0x9D05, // И вообще, в какой момент она этим занялась?
    0x9D53, // Твоя идея?
    0x9D66, // В некоторой степени.
    0x9D8C, // Но на самом деле это идея фельдшера!
    0x9DCE, // Он попросил меня присматривать за тобой, чтобы убедиться, что ты выполняешь упражнения, как он тебе и велел!
    0x9E93, // Глобальный заговор?
    0x9EB8, // Может, Кендзи в чём-то и прав…
    0x9EEF, // Выглядит слишком обстоятельно для «присматривания за мной».
    0x9F5F, // Ну, если честно, я давно уже искала партнёра для утренних пробежек.
    0x9FD9, // О господи, Кендзи! Если б ты только знал, какой тут развернулся хитрый план!
    0xA062, // А зачем тебе вообще напарник?
    0xA098, // Легче заставить себя заниматься, когда ты не один это делаешь.
    0xA10A, // Разве не очевидно?
    0xA12C, // Ты с меньшей вероятностью бросишь, если кто-то ещё будет рассчитывать на то, что ты придёшь, верно?
    0xA1DF, // Понятно. И это не только заставит тебя продолжать, но и послужит гарантией того, что я тоже буду бегать.
    0xA29B, // Значит, я буду исполнять волю фельдшера…
    0xA2E7, // …а я буду за тобой присматривать, как он и просил!
    0xA342, // Ты быстро схватываешь, Хисао.
    0xA378, // А если я откажусь?
    0xA399, // Я, конечно, не собираюсь отказываться.
    0xA3DF, // Но я должен хотя бы продемонстрировать признаки сопротивления так мастерски осуществлённому плану.
    0xA498, // Ну, если откажешься, то я буду дуться.
    0xA4DC, // И тебе придётся жить, зная, что это ты заставил Эми Ибарадзаки дуться.
    0xA55B, // Ты ведь не хочешь, чтобы подобное тяготило твою совесть, да?
    0xA5C8, // Эми для наглядности начинает дуться.
    0xA60C, // Это самое очаровательное и душераздирающее зрелище, что мне когда-либо приходилось видеть.
    0xA6B4, // Хорошо! Я согласен!
    0xA6D7, // Только… не делай так больше!
    0xA70C, // Я чувствую себя так, будто ударил щеночка!
    0xA759, // Значит, решено, да?
    0xA77B, // Ты будешь моим напарником по бегу?
    0xA7BA, // Соблюдать программу?
    0xA7E1, // И режим питания?
    0xA7FF, // Режим питания?
    0xA81A, // Да, режим питания!
    0xA83B, // Надо ведь переходить на здоровую пищу, если хочешь прийти в форму!
    0xA8B4, // Я внимательнее всматриваюсь в план.
    0xA8F6, // Я не вижу тут режима питания.
    0xA92B, // А, точно! Забыла тебе его дать!
    0xA962, // На свет появляется ещё один смятый листок.
    0xA9B0, // Уже не такой подробный.
    0xA9DB, // Его мне помог составить фельдшер.
    0xAA19, // Фельдшер чуть ли не всего себя посвящает цели сохранить меня в добром здравии.
    0xAAA9, // Не много я знаю сотрудников школы, которые бы подсылали своих учеников шпионить за мной, а уж тем более помогали бы составить для меня режим питания.
    0xABB9, // Но, с другой стороны, я ведь не в обычной школе.
    0xAC0E, // И, наверное, это не так уж плохо.
    0xAC48, // Но всё же этот режим, похоже, собирается лишить меня всего, что будут предлагать завтра на фестивале.
    0xAD00, // Хм.
    0xAD06, // И когда начинаются пробежки?
    0xAD3B, // После фестиваля.
    0xAD5A, // Сразу после? А если я там что-нибудь съем? Живот ведь заболит.
    0xADC9, // Я имела в виду, что на следующий день после фестиваля.
    0xAE2B, // Так и знал.
    0xAE3F, // Разве мы не должны были что-то сделать?
    0xAE86, // А! Надо ведь найти ту краску для Рин, да?
    0xAECE, // О нет! Из головы выскочило!
    0xAEFF, // Нам удаётся раздобыть краску, но по возвращении к фреске выясняется, что Рин уже ушла.
    0xAF9C, // Ну и ладно.
    0xAFB0, // Мы с Эми расходимся, оставив краску на земле.
    0xB002, // Рин её найдёт, когда вернётся.
    0xB039, // Фестиваль уже завтра. Честно говоря, я жду его с лёгким нетерпением.
    0xB0B5, // Но в то же время эта неделя меня порядком вымотала, так что я недолго читаю и ложусь спать.
    0xB159, // Но почему Лилли оставила её одну? Судя по реакции Ханако, это довольно необычно.
    0xB1EB, // …А, точно. Перед тем как мы столкнулись с Рин, Лилли вроде что-то говорила насчёт прогулки в город.
    0xB29E, // Подумав об этой прогулке, я выглядываю в окно.
    0xB2F2, // Я гляжу на яркое солнце и людей, прогуливающихся и наслаждающихся погодой, и мне хочется выбраться из школы или хотя бы просто не сидеть здесь, а заняться чем-то другим.
    0xB425, // Поддавшись одному из своих самых злостных пороков – лени, я решаю, что историю лучше учить в воскресенье. Или в понедельник. Или в любой другой день, кроме сегодняшнего.
    0xB559, // С тяжёлым вздохом я поднимаюсь с места, размышляя, не пойти ли потусоваться с Кендзи.
    0xB5F4, // Однако он не производит впечатления человека, который любит наслаждаться прекрасной погодой на улице с друзьями. Потом как-нибудь свидимся.
    0xB6F6, // Изменив ход мысли, я обдумываю идею поговорить с Ханако, но когда поворачиваюсь, то замечаю, что её место уже пусто. Наверное, ушла в библиотеку.
    0xB7FC, // В пять минут девятого меня резко будит невероятно громкий стук в дверь.
    0xB87F, // Я быстро открываю её и вижу стоящих передо мной Сидзунэ и Мишу. Обе выглядят немного устало, особенно это заметно по Мише.
    0xB95D, // Кто из вас стучал?
    0xB97E, // Задаю я вопрос, который наверняка интересует всё общежитие.
    0xB9EC, // А-ха-ха-ха, это неважно, Хиттян!
    0xBA24, // Она и глазом не моргнув отмахивается от вопроса.
    0xBA7D, // Что? Ты до сих пор в пижаме, Хиттян? Значит, ты не в восемь встаёшь?
    0xBAF4, // Я замечаю, что у неё мокрые волосы, а кудри еле держат форму.
    0xBB61, // Нет, я думал, что посплю немного подольше, потому что сегодня суббота и целую неделю я недосыпал.
    0xBC11, // Уловила ли она мой ядовитый тон?
    0xBC4C, // Тогда хорошо, что мы пришли тебя разбудить!
    0xBC9B, // В общем, Хиттян, думаю, тебе хочется узнать, почему мы здесь, да?
    0xBD0E, // Догадаться несложно, но я надеюсь, что она не произнесёт то, что собирается.
    0xBD98, // Хочешь прогулять уроки и пойти с нами в какое-нибудь уютное местечко?
    0xBE17, // Чего-чего?
    0xBE2A, // Хочешь прогулять уроки и заняться чем-нибудь весёлым?
    0xBE8D, // Я нисколько не сомневаюсь, что они снова заставят меня помогать им с какой-нибудь адской работой.
    0xBF3F, // Серьёзно?
    0xBF51, // Миша ухмыляется и с энтузиазмом кивает.
    0xBF9A, // Мне нравится этот их новый подход, но я удивлён, что они предложили пропустить уроки, даже когда у нас сокращённый день.
    0xC074, // А вас не беспокоит, что вы так часто прогуливаете?
    0xC0CF, // Ну, это не проблема! Хиттян, каждый раз, когда наступает такое время, как сейчас, школа в застое.
    0xC17C, // Да и к тому же сегодня суббо~та. Неужели не хочешь повеселиться?
    0xC1F0, // Меня изумляет их беззаботность.
    0xC22B, // Не то чтобы мы настаивали на твоей компании, но мы подумали, что ты будешь рад куда-нибудь сходить!
    0xC2DE, // Так… ты хочешь с нами пойти? Давай, это будет намного веселее, чем сидеть здесь понурив голову~!
    0xC38C, // Наверное, я ничего важного не пропущу, да и скучать по мне не будут.
    0xC406, // Ну ладно, не думаю, что я многое пропущу. Какие у вас предложения?
    0xC47C, // Внезапно в голову приходит одна мысль, из-за которой я подозрительно щурюсь.
    0xC508, // Постойте… это ведь не очередная уловка, чтобы снова заставить меня работать на Школьный совет, правда?
    0xC5C5, // Нет, конечно нет!
    0xC5E4, // И даже думать такое – очень низко, Хиттян.
    0xC631, // …И, кроме того, ты теперь в Совете, не забыл?
    0xC681, // Если б мы захотели, чтобы ты что-то для нас сделал, нам бы не понадобились никакие уловки~!
    0xC724, // Ха-ха-ха!
    0xC734, // Это новая форма принуждения. Только две симпатичные девушки могут такое провернуть.
    0xC7CF, // Я позволяю себе немного расслабиться. Наверное, я параноик. Похоже, они действительно просто хотят погулять.
    0xC896, // И тем не менее…
    0xC8B3, // Никаких уловок?
    0xC8D0, // Никаких! Хватит параноить!
    0xC901, // Ну, как скажешь.
    0xC91E, // Я вдруг осознаю, что всё ещё стою в пижаме.
    0xC96B, // А вы дадите мне сперва одеться?
    0xC9A4, // А? Зачем, Хиттян? Ты отлично выглядишь!
    0xC9EA, // И всё же я предпочту надеть что-нибудь другое.
    0xCA3E, // Я закрываю дверь прежде, чем она успевает ответить, и быстро натягиваю форму.
    0xCACB, // Снова выйдя в коридор, я становлюсь свидетелем оживлённой беседы Сидзунэ и Миши.
    0xCB5F, // Интересно, бывает ли такое, что беседующие на языке жестов случайно попадают друг другу пальцем в глаз?
    0xCC1C, // От моих размышлений меня отрывает Сидзунэ, нетерпеливо похлопав меня по плечу.
    0xCCAD, // В общем, мы собираемся улизнуть в город! Помнишь тот чайный дом, в котором мы были в среду?
    0xCD50, // Чайный дом?
    0xCD65, // Ты не помнишь?
    0xCD7F, // А, вы про то кафе.
    0xCD9E, // Чайный дом! Он называется «Шанхай». Ну, потому что Китай – родина чая. Пойдём, Хиттян! Я тебя даже угощу!
    0xCE5A, // А… не я, не я, в смысле Ситтян! А-ха-ха~!
    0xCE9F, // Не знаю…
    0xCEB0, // Там хорошо, очень расслабляюще! Он как… полукафе, полуресторан, полутрадиционный ресторан, полу… библиотека…
    0xCF7C, // Что?
    0xCF84, // Как-то многовато половин.
    0xCFB3, // Но Миша этого, кажется, не замечает.
    0xCFF4, // Так что~! Пойдём, не так уж часто у нас бывает так много свободного времени!
    0xD07C, // Но если ты занят, то не обязан идти! Твоё присутствие не является абсолютно, абсолютно необходимым!
    0xD131, // Ха-ха-ха-ха!
    0xD146, // В жизни не видел настолько плохо скрываемой реверсивной психологии. Я сегодня какой-то уставший, и мои учителя, возможно, будут интересоваться, где я. Возможно.
    0xD26A, // С другой стороны, я так толком и не был в городе с момента приезда, а это хороший повод туда отправиться.
    0xD327, // К тому же не мешало бы поесть. Если Сидзунэ угощает – так даже лучше. Я на мели.
    0xD3B6, // Хорошо, пойдём. Показывайте дорогу.
    0xD3F7, // Здорово~!
    0xD408, // Через полчаса мы добираемся до чайного дома. Похоже, мы единственные посетители.
    0xD49C, // Тут всегда так тихо по утрам?
    0xD4D1, // Спрашиваю я, подразумевая «тут всегда так пусто?».
    0xD52D, // Нет, это как-то странно. Но это ведь замечательно, правда?
    0xD595, // Правда.
    0xD5A3, // Мы садимся за большой квадратный деревянный стол, и я вдруг понимаю, что не знаю, что здесь подают. В прошлый раз я просто взял то, что порекомендовала Юко.
    0xD6BC, // Эй, а тут есть меню или что-то вроде того?
    0xD706, // Не-а!
    0xD70F, // В этих словах слышна изрядная доля азарта.
    0xD75D, // Ну что, Хиттян, ты уже решил, что будешь заказывать?
    0xD7BA, // Я гляжу по сторонам и не вижу ничего, напоминающего меню.
    0xD822, // Не понимаю, что не так с этим местом? Почему?
    0xD872, // Это какое-то секретное заведение? Доступ сюда возможен только по какому-то особому рукопожатию? Какому-то подмигиванию или кивку?
    0xD960, // Надо, чтобы кто-нибудь за тебя поручился? Поклясться на крови? Чёрт возьми, в прошлый раз всё было совсем иначе.
    0xDA2A, // Не знаю, в прошлый раз я заказал только кофе. Что здесь подают?
    0xDA9B, // Чай!
    0xDAA3, // А, точно, это же…
    0xDAC2, // Но ведь не просто чай? Не только же чай? Что-то другое ведь тоже есть?
    0xDB3E, // Ясное дело~!
    0xDB54, // Ясное? Это как? Тут нет меню. Где меню?
    0xDB98, // Они опять надо мной издеваются. Делать нечего, всё, что я могу, – приготовиться сгореть со стыда.
    0xDC48, // Мне хочется уйти, но я уже сижу за столом.
    0xDC93, // Было бы неправильно сейчас уйти: неписаные правила вежливого поведения в обществе преграждают мне путь к выходу, словно стена огня.
    0xDD85, // Я решаю выбрать безопасный вариант. Закажу то же, что и они, если это будет приемлемо для мужчины.
    0xDE36, // Почему бы вам не сделать заказ раньше меня? Дамы вперёд.
    0xDE9C, // Хорошо придумал, Хиттян, но~ мы уже заказали!
    0xDEED, // Как это возможно? Когда? Как? У кого?
    0xDF2E, // Мы – постоянные посетители и так часто сюда ходим, что уже нет нужды специально что-либо заказывать!
    0xDFE6, // Ну ладно, хватит с тебя. Мы сидим на меню~!
    0xE031, // Я оглядываюсь на остальные столики. Ни на одном из них меню нет. Значит, они их держат большой стопкой у входа. И надо же на такое усесться, да и с какой скоростью они их схватили!
    0xE173, // А, ну ладно. В таком случае можно мне одно?
    0xE1BF, // Ты можешь взять, если хочешь, но ты ведь не из тех, кто способен на нечто столь раз-врат-ное, так ведь?
    0xE275, // Я говорю им, что возьму только кофе, и опускаю голову на прохладную поверхность стола.
    0xE312, // Кофе? Тут такое первоклассное заведение, а ты хочешь заказать кофе?
    0xE38D, // Вот опять они пудрят мне мозги.
    0xE3C6, // В таком случае я буду то же самое, что и вы.
    0xE413, // Хиттян, Ситтян закажет особый чай, который выращивают только на далёких плантациях в Индии.
    0xE4BB, // Чай до сих пор изготавливается племенными мастерами, в семьях которых рецепт передаётся из поколения в поколение.
    0xE58D, // Им приходится переходить вброд кишащие аллигаторами воды, чтобы раз в год раздобыть листья чая. В каждом таком путешествии кто-нибудь погибает.
    0xE695, // Я не стану такое пить, иначе меня чувство вины замучает.
    0xE6FB, // Тогда я буду то, что будешь ты.
    0xE732, // Я не знаю, что я возьму.
    0xE75C, // Как это?
    0xE76B, // Отлично, буду чай, за который погибли люди.
    0xE7B9, // Нет, забейте. Буду кофе.
    0xE7E4, // Если это первоклассное заведение, у них должен быть первоклассный кофе, верно? … За который никому не пришлось погибнуть, да?
    0xE8C9, // Отличный ответ, им нечего ему противопоставить. Сидзунэ пожимает плечами, как бы говоря: «Прекрасно сыграно».
    0xE992, // Но всё же они не отвечают на мой второй вопрос.
    0xE9E7, // Миша зовёт Юко, и та приносит нам напитки и по одному невероятно тоненькому кусочку жёлтого торта с воткнутой в него чёрной пластиковой вилочкой.
    0xEAF2, // Я съедаю свой кусочек в один присест. Удивительно, но это, возможно, самое несытное из всего, что я когда-либо ел.
    0xEBBE, // Хиттян, у тебя есть на завтра какие-нибудь планы?
    0xEC17, // Миша делает глоток своего чая, название которого звучит подозрительно высококлассно, хоть он и похож на обычный.
    0xECE6, // Она пьёт с поразительной неосторожностью, учитывая то, какой он горячий. Полная противоположность Сидзунэ или Лилли.
    0xEDBD, // Планы? Звучит зловеще.
    0xEDE6, // Планы? Да.
    0xEDF8, // Да, я завтра ужасно занят. На самом деле у меня будет столько дел, что совсем не останется свободного времени.
    0xEEBF, // Точно… вообще ни капельки. И всё, что мне придётся делать, чрезвычайно важно. Очень, очень важно.
    0xEF6F, // Миша хихикает, явно не купившись на это, а потом передаёт всё Сидзунэ, которая степенно кивает с очень недовольным видом.
    0xF04C, // Внезапно она подаётся вперёд, изучающе глядя мне в лицо, будто ходячий детектор лжи, ожидая малейшего признака, который меня выдаст.
    0xF13E, // Эта сцена длится минуту, а затем она возвращается на своё место и делает глоток чая.
    0xF1D7, // Ну, раз ты так занят, Хиттян, ничего не попишешь. Нам завтра делать нечего, поэтому мы думали, что ты, может, захочешь пойти с нами на фестиваль!
    0xF2D9, // Ты ведь всё равно здесь новенький, правда? Правда? Так что~ мы думали, что покажем тебе окрестности и повеселимся вместе, но, если ты так занят, мы понимаем!
    0xF3F2, // Не судьба, не судьба!
    0xF418, // Обе одновременно пожимают плечами, будто этот жест был заранее отрепетирован.
    0xF4A8, // А-ха-ха-ха-ха-ха~!
    0xF4C6, // Хиттян, ты такой параноик.
    0xF4F6, // …И тебе всё равно меня никогда не переиграть, так что зачем так стараться?
    0xF57E, // Ха-ха! Ого, Ситтян~!
    0xF5A0, // Переиграть тебя? О чём ты?
    0xF5CF, // Она говорит о принуждении? Никогда не думал, что для неё это всего лишь игра. Я думал, что я единственный, кто видит в этом соревнование.
    0xF6C5, // Ты знаешь~! …Э? Знаешь, Хиттян? Потому что я – нет.
    0xF71F, // Тебе меня не перехитрить! —А, ну, Хиттян, не меня…
    0xF77A, // Что? О чём ты говоришь, Ситтян?..
    0xF7B3, // Сидзунэ хитро улыбается, вызывая меня на битву воли и разума.
    0xF823, // Для отброшенного на край отчаяния нет иного выбора, кроме как утонуть или ухватиться за мимолётный остаток надежды, бороться изо всех сил против неотвратимости судьбы и противостоять невозможному.
    0xF98F, // Ибо, даже павши, падёт он со знанием, что сражался благородно…
    0xFA01, // …или что-то типа того.
    0xFA2A, // Ну, это мы ещё посмотрим. Не недооценивай меня.
    0xFA7F, // Разве тебе не придётся пройти через множество испытаний, чтобы доказать это, Хиттян?
    0xFB1A, // Ну, мне может повезти. Не отбрасывай эту возможность.
    0xFB7B, // Не повезёт~.
    0xFB91, // Повезёт! Постой…
    0xFBB1, // Тогда давай поспорим!
    0xFBD9, // Мне плевать на состязание.
    0xFC0A, // Вопиющая ложь.
    0xFC25, // Постой, что именно ты имеешь в виду?
    0xFC66, // Ничего страшного, что ты не понимаешь, потому что я тоже не понимаю! Ва-ха-ха-ха!
    0xFCF6, // Значит, решено! Отлично, отлично!
    0xFD32, // Что? Ты не слышала, что я только что сказал?
    0xFD80, // Теперь всё, что осталось, – ставки! Что выиграет победитель или, что ещё интереснее, чего лишится проигравший!
    0xFE49, // Эй!
    0xFE4F, // Меня втянули в рискованную игру. Сидзунэ – очень опасная девушка, поскольку мыслит только в категориях выигрыша и проигрыша.
    0xFF35, // Если она на любой наш с ней диалог смотрит как на столкновение характеров, не думаю, что я выдержу.
    0xFFE8, // Такие вещи сводят людей с ума. Она пренебрегает всяческими моральными нормами – прежде-то я думал, что она просто стоик.
    0x100C4, // Тем не менее мне интересно. Я понимаю, что вызвал её на нечто, по существу являющееся дуэлью без каких-либо правил, которая не закончится, пока один из нас не… что?
    0x101EC, // Думаю, в этом и дело. Слишком всё неопределённо. Какие условия необходимы для победы или поражения? Первый, кто почувствует себя глупо, проиграет?
    0x102F6, // Не знаю, мне раньше никогда не приходилось думать о подобном.
    0x10366, // Никогда?
    0x10376, // Никогда.
    0x10386, // Так ты никогда не играл в азартные игры, Хиттян?
    0x103DD, // Я удивлён, что вы играли.
    0x1040A, // Ой, да ладно… Это же просто ради веселья! Среди друзей~!
    0x1046F, // Суть в унижении, причинении страданий и доведении до полного отчаяния! Не в этом разве смысл?
    0x10519, // Сидзунэ в раздумьях прикладывает палец к виску.
    0x10571, // …!
    0x10576, // Хм… Тогда как насчёт этого, Хиттян: если ты проиграешь, тебе придётся однажды прийти в школу без штанов.
    0x10634, // Ты с ума сошла?
    0x1064F, // Хотя по сравнению с тем, что я ожидал от неё услышать, это весьма милосердно.
    0x106DA, // Нельзя поставить просто деньги, как нормальные люди?
    0x1073B, // Если б мы поставили деньги, у тебя бы их не хватило~! Теперь твоя очередь! …Но никаких извращений! Ясно?
    0x107F6, // Думаю, мне нужно время.
    0x10820, // Из-за этого я теперь неделями буду на взводе.
    0x10872, // Окей~! Давайте оба торопитесь, а то всё остынет!
    0x108C8, // Я начинаю поспешно допивать кофе, а Сидзунэ принимается за чай, сверля меня пылким взглядом, полным соперничества.
    0x1099A, // Какая растрата – пить на скорость чай, ради которого кому-то пришлось отдать жизнь.
    0x10A33, // Хиттян, ты уверен, что не хочешь с нами завтра пойти? Многие с нетерпением ждали этого дня, ты не должен упускать такой возможности.
    0x10B22, // Я невнятно мычу ей в ответ.
    0x10B53, // Я не совсем поняла…
    0x10B78, // Время думать. У Сидзунэ осталось меньше напитка, но свой я могу допить быстрее.
    0x10C08, // Если первой закончит она, то, возможно, не станет платить и предоставит это мне, несмотря на то, что говорила, будто всё за её счёт.
    0x10CF4, // Так как денег у меня с собой нет, я буду унижен, и это засчитается как поражение.
    0x10D85, // Если первым закончу я, то с точки зрения джентльменства буду выглядеть как козёл, будто мне не терпится сбежать из этого чайного дома, заставив её за всё платить. Это тоже засчитается как поражение. Она этим воспользуется.
    0x10F1A, // В случае ничьей она может попробовать выбежать за дверь и я, возможно, сделаю то же самое. Это может привести к столкновению в дверях, что есть тоже унижение, хоть и не такое сильное. …И Мише придётся оплатить счёт.
    0x1109F, // Это как-то по-детски. Я немного разочарован как в Сидзунэ, так и в себе самом.
    0x1112A, // Ну, Хиттян, было бы мило, если бы мы вместе отпраздновали наш организаторский успех, любуясь нашими творениями…
    0x111F7, // Миша, кажется, вовсе не замечает, что перед ней бушует эпическая битва характеров. Я медленно киваю и допиваю остатки кофе.
    0x112D7, // Ну, я закончил. Думаю, мне пора идти. И я ухожу. Тихо-мирно.
    0x1133F, // Ты тоже, Ситтян?
    0x1135C, // Почему вы ведёте себя так странно?
    0x1139B, // Я быстро выхожу за дверь, а Сидзунэ – следом. Мише придётся разбираться со счётом.
    0x11431, // Прости, Миша.
    0x11449, // Поравнявшись со мной, Сидзунэ быстро поправляет очки и суёт мне в руку записку.
    0x114DA, // Так ты думаешь, что сможешь выиграть прямо сегодня? Это как-то самоуверенно, Сидзунэ.
    0x11575, // Я вспоминаю, что она меня не слышит, и киваю.
    0x115C5, // Сейчас она выглядит куда симпатичнее, чем обычно, мягко улыбаясь с оттенком самоуверенности.
    0x11670, // Сидзунэ выглядит энергично и беззаботно, хотя, возможно, это из-за кофеина.
    0x116F9, // Она подмигивает и протягивает руку для рукопожатия. Я задумываюсь, а нет ли у неё в руке электрошокера, но решаю, что на такое она не пойдёт, так что пожимаю ей руку.
    0x11823, // С пожатием она передаёт мне другую записку. На секунду мне кажется, что это электрошокер, и в голове мелькает вопрос, не умру ли я от удара.
    0x1191F, // Сидзунэ ухмыляется и убегает прочь.
    0x11961, // Я театрально сжимаю записку в кулаке, но никто, к моему сожалению, этого не видит.
    0x119F5, // Наверное, уже поздно возвращаться в чайный дом и спрашивать дорогу у Миши.
    0x11A7D, // Но, с другой стороны, я усложнил ей задачу тем, что не знал пути сюда, так что не могу позволить ей одержать верх из-за того, что я не знаю дорогу обратно.
    0x11B90, // И, если я спрошу её, Сидзунэ воспримет это как победу. Нет, в этом нет необходимости.
    0x11C28, // Школа находится на вершине проклятого холма, насколько труден может быть её поиск?
    0x11CC0, // Может, у меня и топографический кретинизм, но даже я с этим справлюсь.
    0x11D3F, // Полтора часа спустя я оказываюсь на длинной мощёной дорожке, ведущей к главному зданию.
    0x11DE0, // Ха-ха! Именно тот, кого мы ждали. Так ты наконец добрался, Хиттян! Молодец! Теперь время работать, работать, работать~!
    0x11EB4, // Миша и Сидзунэ устроили мне засаду в вестибюле первого этажа, и я угодил прямо в неё. Надо было просто обойти школу вокруг, как я вначале и планировал, но потом подумал, что это уже чересчур и вообще дурачество.
    0x12031, // Миша подманивает меня, помахивая в мою сторону толстой стопкой распечаток.
    0x120BB, // Нам как бы нужна твоя помощь~!
    0x120F1, // Как бы?
    0x120FE, // Нам нужна твоя помощь~!
    0x12128, // Ты нам поможешь!
    0x12146, // Миша произносит это в своей обычной игривой, беззаботной манере, но я всё равно слышу за ней убийственную суровость Сидзунэ.
    0x1222A, // Звучит как приказ.
    0x1224C, // Правда~? Неужели?
    0x1226B, // А? Да?
    0x12275, // А, прости, Хиттян, думаю, что это он и есть! Ха-ха-ха-ха!
    0x122D6, // Не похоже, чтобы она раскаивалась.
    0x12315, // Я думала, что мы уже всё сделали, но оказалось, что все эти знаки надо прицепить к стендам.
    0x123B8, // Чем больше рук, тем легче труд!
    0x123F0, // И все в выигрыше! Ха-ха-ха-ха-ха!
    0x12429, // В конце концов, это твоя обязанность как члена Школьного совета. Частью которого ты являешься.
    0x124D6, // Как члена.
    0x124E9, // Школьного совета.
    0x1250A, // А-ха-ха-ха~!
    0x1251E, // Задача простая, так что справиться с ней прямо сейчас было бы здорово. Работы не так много. Совсем мелочь, правда!
    0x125EC, // И мы были бы очень рады твоей помощи!
    0x1262F, // Очень, очень рады!
    0x12650, // Кроме того, пора отплатить за то, что мы были так добры к тебе!
    0x126C0, // Так всё-таки чайный дом был ловушкой! Вот же ж плутовки!
    0x12725, // Не говори так, нет тут никакой связи. Мы хотели отпраздновать твоё вступление в Совет!
    0x127C2, // Тогда зачем было об этом упоминать?
    0x12803, // Но—{w=0.3}{nw}
    0x12816, // Никаких «но»! Ты идёшь с нами!
    0x1284C, // Они даже не дают мне закончить предложение, тут же хватая меня за руки и пытаясь притащить к кабинету Совета.
    0x12913, // Миша легкомысленно смеётся, когда они с Сидзунэ обмениваются у меня за спиной лукавыми взглядами.
    0x129C7, // Не думаю, что у тебя есть выбор, Хиттян! Ха-ха-ха-ха!
    0x12A23, // Нас двое, так что даже не пытайся увильнуть! Воспринимай нас всерьёз!
    0x12AA1, // Хиттян, помогать нам – в любом случае твоя обязанность! Как члена Школьного совета!
    0x12B3A, // Ладно, ладно! Как я мог забыть?
    0x12B71, // Но, серьёзно, разве больше нет никого, кто бы вам помог?
    0x12BD5, // Кого например, Хиттян?
    0x12BFE, // Вчера ты был не против нам помогать…
    0x12C42, // Вчера – это не сегодня!
    0x12C6D, // И «другой» – кто-нибудь помимо меня!
    0x12CB0, // Почему у вас в Совете больше никого нет?
    0x12CF9, // Нам бы тоже хотелось это узнать! …А-ха… А-ха-ха-ха-ха-ха!
    0x12D5F, // Смех Миши сотрясает воздух в коридоре. Она совсем не замечает гримасы недовольства у меня на лице. Верно, их там всего двое, не так ли?
    0x12E52, // Ох, ладно. Хорошо, я вам помогу.
    0x12E8A, // Миша проводит языком по зубам, явно довольная.
    0x12EDF, // Вот это я понимаю, Хиттян! Я знала, что мы можем на тебя положиться~!
    0x12F59, // Как предсказуемо~.
    0x12F7B, // Когда мы добираемся до кабинета, у меня отвисает челюсть. Количество знаков, стендов и столбов просто безумное.
    0x13047, // Они штабелями лежат по всей комнате, словно стройматериалы на площадке, о чём я сразу же сообщаю Мише и Сидзунэ.
    0x13113, // Здесь столько столбов, что из них можно построить вторую стену вокруг школы!
    0x1319F, // Ха-ха-ха~! Правда? Ну, тут их много, так что, наверное…
    0x131FF, // А? Нет?
    0x1320B, // Откуда ты знаешь, Ситтян?
    0x13239, // Правда~?
    0x13248, // Только не говори мне, что она считала?!
    0x1328E, // Сидзунэ мешкает, а затем поправляет очки, а Миша издаёт натянутый смешок.
    0x13314, // Значит, она считала.
    0x13339, // А-ха-ха! Это… несущественно, Хиттян! Можешь, пожалуйста, уже приняться за знаки?
    0x133CA, // Кажется, меня обманули. Вы вроде сказали, что будет немного работы?
    0x13444, // А, ну, Ситтян имела в виду, что для нас – не так уж и много.
    0x134AC, // Кто-то должен за тобой присматривать, понимаешь, чтобы ты не напортачил. И этими людьми будем мы.
    0x1355C, // Так что вы собираетесь делать?
    0x13594, // Наблюдать за тобой! Ха-ха-ха-ха!
    0x135CD, // Нет, это была шутка, Хиттян. Конечно, мы тоже поможем. В Школьном совете на самом деле должно быть куда больше людей.
    0x1369F, // Просто год не удался. Меньше людей, чем обычно, хотя в прошлом году было и того меньше.
    0x1373B, // А сейчас ещё и работы гораздо больше, чем раньше.
    0x13794, // Кроме того, Ситтян нравится с тобой работать. И мне!
    0x137F2, // Мы достигли куда большего, чем обычно.
    0x13838, // Это правда. В последнее время они казались всё более уставшими с каждым разом, как я их встречал.
    0x138E8, // Работа в Школьном совете, видимо, занятие на двадцать четыре часа в сутки, и, судя по тому, что я слышал и видел, их только двое. Ну, полагаю, со мной – трое.
    0x139FF, // Они наверняка работают почти без перерывов. Интересно, сколько времени они проводят за работой в этой комнате, пока я их не вижу?
    0x13AEA, // И я даже мельком видел, как Миша дремлет, когда Сидзунэ нет поблизости. А сама Сидзунэ вынуждена работать по шестьдесят часов в неделю, выполняя обязанности Совета, в дополнение к школьным урокам.
    0x13C50, // Два часа спустя, потянувшись за очередной кнопкой, я обнаруживаю, что коробка пуста. Не успеваю я ничего сказать, как Сидзунэ хватает её.
    0x13D49, // Она улыбается, ловко бросая её в урну к остальным коробкам из-под кнопок.
    0x13DCE, // У тебя тоже кончились, Хиттян? Не волнуйся, Ситтян говорит, что принесёт ещё.
    0x13E59, // Мы тоже потратили коробку, но решили с Ситтян подождать, пока тебе тоже понадобится, чтобы взять новую.
    0x13F15, // Что-то в этом мне кажется странным.
    0x13F55, // Стоп, у нас с вами кнопки кончились одновременно? Какое-то странное совпадение, не находите?
    0x13FFD, // Ну, вообще-то, Хиттян, у нас кончились ещё двадцать минут назад, а запасная коробка была только одна – та, которую мы дали тебе.
    0x140E3, // И у тебя они так и мелькали, поэтому~! мы подумали, что надо подождать, пока в обеих коробках кнопок не останется, прежде чем брать новые!
    0x141DA, // Тогда Ситтян смогла бы взять новенькие коробки для всех одновременно. Для эффективности, понимаешь~!
    0x14293, // Сидзунэ кивает, готовясь выйти за дверь.
    0x142DD, // Постой-ка, а что вы делали последние двадцать минут?
    0x1433C, // А-ха-ха~! Ничего, конечно же! Что нам было делать? У нас не было кнопок, Хиттян!
    0x143C7, // Сидзунэ с Мишей обмениваются понимающими взглядами, прежде чем идеально синхронно и невероятно преувеличенно одновременно пожать плечами.
    0x144C9, // Понятно. Решили устроить себе перерыв. Умно.
    0x1451A, // О да, мы знаем, что умно.
    0x14545, // Чья это была идея?
    0x14566, // Мы обе до неё додумались, конечно!
    0x145A4, // А-ха-ха-ха~! Ну, Хиттян, это всё была идея Сидзунэ.
    0x145FC, // Я тут же оборачиваюсь к Сидзунэ, которая кратко машет мне и с удивительно бодрой улыбкой скрывается за дверью.
    0x146C6, // Так почему бы вам было просто не сказать, что хотите сделать перерыв?!
    0x14745, // Я привык считать их полными противоположностями. Миша, похоже, всегда энергична и игрива, как любая другая девочка. Сидзунэ, с другой стороны, всегда кажется сдержанной. Агрессивный манипулятор, отчасти страшная, но сдержанная.
    0x148E5, // Временами я думал, что у неё нет чувства юмора: будучи очень миловидной, она почти никогда не улыбалась, не говоря уже об остальном.
    0x149D4, // Изучающий взгляд, вечно упрямое выражение лица и даже почерк – столь механически точный, что всё написанное ею выглядит как напечатанное.
    0x14AD2, // Но на самом деле Миша и Сидзунэ не настолько разные, как я думал.
    0x14B47, // Я немного удивлён.
    0x14B69, // Чем?
    0x14B71, // Сидзунэ. Не знал, что она любит вот так подшучивать.
    0x14BCF, // Я имею в виду, что не знал, что она может вести себя так по-девчачьи. Это было в самом деле очень мило.
    0x14C85, // Тебе ещё многое неизвестно, Хиттян.
    0x14CC6, // Ну, когда я впервые вас увидел, даже не представлял, что вы столь близки.
    0x14D49, // Мне всегда было интересно, как они познакомились.
    0x14DA4, // Вы давно знакомы?
    0x14DC4, // Друзья детства?
    0x14DE1, // Соседи?
    0x14DEF, // Ха-ха… Извини, Хиттян, но ничего подобного, как бы того ни хотелось.
    0x14E6A, // Когда я пришла в эту школу, меня просто посадили рядом с Ситтян, а она выглядела человеком очень серьёзным.
    0x14F2D, // И я подумала: «Возможно, мне придётся провести остаток года рядом с ней!»
    0x14FB2, // «Поэтому было бы неплохо с ней подружиться! Но~, интересно, понравлюсь ли я ей?»
    0x15042, // И я узнала, что она глухая. Знаешь, Хиттян, в первый раз я подумала, что она меня просто игнорирует~!
    0x150F5, // К счастью, я немного знала язык жестов, и мы подружились.
    0x1515C, // Я хочу спросить, где Миша выучила язык жестов, но решаю оставить это для другого раза.
    0x151F8, // Теперь мы всегда вместе. Это хорошо, ведь я всегда хотела, чтобы меня было кому слушать, и, думаю, Ситтян нравится с кем-то разговаривать! Так что все в выигрыше.
    0x1531A, // Хе-хе. Это здорово.
    0x1533C, // И всё? Ты выглядишь разочарованным, Хиттян. А чего ты ожидал?
    0x153AA, // А-ха-ха-ха-ха-ха!
    0x153C7, // Знаешь, Хиттян, мне кажется, что мы с Ситтян не отблагодарили тебя как следует.
    0x15456, // За что?
    0x15463, // За вступление в Школьный совет. Ты нам сильно помог, Хиттян! Думаю, теперь я смогу намного дольше спать~!
    0x15520, // Я рад, что смог помочь, если это позволит девушке высыпаться.
    0x1558F, // Интересную вещь ты сказал, Хиттян.
    0x155CE, // Ситтян тоже очень ценит твою помощь.
    0x15611, // В этот момент в комнату возвращается Сидзунэ, немного раздражённая, небрежно попивая сок из пакета.
    0x156C8, // Криво улыбаясь, она бросает на пол две коробки с кнопками.
    0x15732, // А, Ситтян.
    0x15744, // Миша открывает рот, чтобы заговорить, но тут же его закрывает, когда Сидзунэ с треском, напоминающим звук ломающихся костей, внезапно сминает пакет из-под сока.
    0x15868, // Я предполагаю, что каждый жёсткий и дрожащий жест, скорее всего, является ругательством.
    0x1590A, // Что она говорит?
    0x15928, // Просто было очень сложно достать эти…
    0x1596F, // Думаю, это преуменьшение, Ситтян…
    0x159AE, // Сидзунэ немного успокаивается, поправляя очки и пальцем убирая чёлку с лица.
    0x15A3B, // На самом деле это не было такой уж проблемой? Это всё твоя предусмотрительность!
    0x15ACE, // Ну тогда ладно. Думаю, пора возвращаться к работе, Хиттян!
    0x15B37, // Конечно, почему бы и нет.
    0x15B64, // К моменту, как мы расправляемся со знаками, снаружи уже начинает темнеть.
    0x15BEA, // Я не ожидал, что нечто подобное займёт так много времени. Однако, если б это было так просто, сомневаюсь, что Сидзунэ и Миша попросили бы у меня помощи.
    0x15CFB, // Сидзунэ плюхается на ближайший стул, начинает хрустеть пальцами и беззвучно зевает.
    0x15D96, // Думаю, на сегодня всё! Это хорошо, Ситтян, я тоже устала.
    0x15DFB, // Это заняло больше времени, чем я ожидал.
    0x15E44, // Ты согласна? Ха-ха-ха, мы тоже не ожидали, что будет так долго! Не по плану!
    0x15EC9, // Ой, я такая голодная. Только что поняла, что весь день не ела.
    0x15F37, // Поразмыслив, я понимаю, что тоже ничего не ел с тех пор, как встал утром с кровати. Но сейчас я слишком устал, чтобы думать о еде.
    0x1601E, // Думаю, подавать обед уже закончили.
    0x1605F, // Не может быть! Хиттян, ты знаешь хоть один способ, как бы мы могли… достать еды?
    0x160EF, // Достать еды?
    0x16106, // Мне не нравится, с какой интонацией она это произносит.
    0x1616B, // Почему бы не заказать с доставкой? А, точно, думаю, я это смогу.
    0x161DC, // Заказать? Откуда?
    0x161FC, // Из города, конечно!
    0x1621F, // Я не знал, что они привозят и к школе. А что ты будешь заказывать?
    0x16294, // Может, китайскую еду?
    0x162BB, // Раз ты собираешься, можно и мне присоединиться? Я тоже проголодался.
    0x16338, // А-ха-ха-ха~! Хиттян, надо было так сразу и сказать!
    0x16391, // Что? Ты угощаешь? Это здорово! Просто здорово!
    0x163E4, // Ва-ха-ха, это правда – если бы не ты, мы бы тут не сидели допоздна, Ситтян!
    0x16468, // Миша выхватывает меню из выдвижного ящика за спиной и начинает медленно и осторожно набирать номер, будто обычно она ошибается в наборе.
    0x16563, // Что ты будешь, Хиттян?
    0x1658B, // Пельмени, наверное.
    0x165AF, // Я поднимаю руку в знаке признательности Сидзунэ, которая отвечает очень вялой, продлившейся лишь долю секунды, улыбкой.
    0x1668B, // А-ха-ха-ха-ха-ха~! Хиттян, Ситтян за всё сегодня платит, так что можешь немного пошиковать!
    0x1672D, // Тогда ещё варёного риса с креветками.
    0x16772, // Отлично, отлично! А ты, Ситтян?
    0x167A9, // Китайский омлет? Ну ладно.
    0x167D9, // Эй, Миша, это действительно означает «омлет»? Можешь ещё раз показать?
    0x16859, // Конечно! Ха-ха! Вот так, вот так…
    0x16894, // А вот так произносится то, что заказал ты: пель-ме-ни!
    0x168F4, // Рис с креветками!
    0x16914, // А я буду суп и овощи в масле, и это показывается вот такими жестами…
    0x16990, // И вот так показывается то, сколько всё это стоит: 3685 иен!
    0x169F6, // Ва-ха-ха-ха-ха~!
    0x16A11, // Не знаю даже, в какой ситуации мне может понадобиться запоминать такую точную цифру…
    0x16AAE, // А-ха-ха-ха-ха! Ладно~! Тогда я сейчас закажу, если никто больше ничего не хочет. Нет возражений? Хорошо, тогда отлично!
    0x16B81, // Пока мы ждём заказ, Сидзунэ нетерпеливо покручивает в руках палочки для еды.
    0x16C0D, // Эй, где ты их взяла?
    0x16C30, // Нам не впервой заказывать сюда еду, Хиттян, и они почему-то постоянно нам дают кучу палочек, хоть мы и говорим, что нас только двое.
    0x16D1D, // И у вас накопилась их целая гора, пока вы ужинали заказываемой сюда едой долгими вечерами в кабинете?
    0x16DD6, // Именно так! Ха-ха-ха-ха-ха-ха!
    0x16E0A, // Я преувеличиваю?
    0x16E29, // Ха-ха! Вот именно, Ситтян! Эй, Хиттян, ты знал, что когда мы соберём сотню пар палочек от заказанных обедов, то сможем захватить Вселенную?
    0x16F22, // Я тоже так думал, когда был маленький.
    0x16F67, // Хиттян, ты хорошо умеешь их разламывать? У меня не получалось правильно, поэтому я нашла груду палочек, которые сохранила Ситтян, и попрактиковалась на как минимум двадцати из них.
    0x170B0, // Она не на шутку разозлилась!
    0x170E4, // Я покатываюсь со смеху, а Сидзунэ краснеет от негодования. Не знал, что у неё есть такая детская черта.
    0x1719E, // Когда привозят еду, я с воодушевлением принимаюсь за неё, прихлёбывая из маленькой банки с газировкой, которую Сидзунэ принесла из торгового автомата в коридоре.
    0x172C7, // Поблагодарив их, я направляюсь к общежитиям, собираясь сразу лечь спать.
    0x1734C, // В общежитии стоит жутковатая тишина, не считая звуков портативных телевизоров и радио, невнятно бормочущих из-за тонких стен.
    0x17433, // Здесь по ночам спокойно и очень мирно. Слышно, как за окном стрекочут сверчки. А взглянув на небо, я вижу, что там ярко светят звёзды.
    0x17523, // Уставший, я пытаюсь заснуть как можно быстрее, лишь слабо негодуя из-за того, что меня лишили субботы.
    0x175DC, // Библиотека – место ничуть не хуже, чем остальные. Ханако, казалось, застиг врасплох уход Лилли, поэтому ей, возможно, хочется с кем-нибудь поговорить.
    0x176ED, // Закинув портфель за плечо, я выхожу из класса.
    0x17741, // Я иду к библиотеке по коридору, проходя мимо множества закрытых дверей.
    0x177C4, // Из-за каждой доносится шум самоотверженных репетиций. За одной из них слышно ревущую почти как на концерте рок-музыку.
    0x1789D, // Думаю, в этом преимущество частной школы: здесь полно комнат, куда можно пойти в подобное время.
    0x1794C, // И, кстати говоря, дворы и здания школы поддерживают в отличном состоянии. Наверняка это недёшево.
    0x179FE, // Я слышал, что у этого места серьёзные спонсоры.
    0x17A54, // Стены библиотеки лишь частично изолируют её от шума подготовки к фестивалю, доносящегося снаружи, но никаких других звуков больше не слышно.
    0x17B57, // В ней не видно ни души. Все, видимо, либо наслаждаются погодой во дворе, либо работают над фестивальными проектами.
    0x17C28, // Юко нигде нет. Наверное, она не работает по субботам.
    0x17C88, // Я спокойно прохожу по библиотеке, уже знакомый с её планировкой, и направляюсь в заднюю её часть, к маленькому уголку Ханако.
    0x17D6C, // По пути я провожу рукой по корешкам книг, ощущая неповторимую фактуру каждой, и пробегаю взглядом по названиям.
    0x17E38, // В больничной библиотеке я делал так постоянно. Некоторые вещи, видимо, не меняются.
    0x17ED0, // Как и запах библиотеки. Неважно, как вы заботитесь о ней, книжная бумага со временем портится.
    0x17F7B, // Наверное, в какую библиотеку вы бы ни пошли, где угодно в мире, там будет такой же запах.
    0x1801A, // Я нахожу какое-то лёгкое чтиво, в которое можно углубиться, особо не включая мозг, и направляюсь в читальную зону искать Ханако.
    0x18103, // И снова она сидит на пуфе, прислонившись спиной к книжной полке. Она медленно листает страницы той же книги, которую читала в классе.
    0x181F5, // В отличие от прошлого раза, когда мы здесь виделись, я тихо присаживаюсь на пуф. Шум привлекает её внимание, но не пугает.
    0x182D1, // Этот деликатный обряд, через который нужно проходить каждый раз, когда я пытаюсь с ней заговорить, напоминает выслеживание зайца.
    0x183BF, // Та же книга?
    0x183D5, // Д-да… Я почти дочитала…
    0x18402, // Круто.
    0x1840E, // Интересно, стоит ли мне…
    0x1843C, // Можно мне её одолжить, когда закончишь?
    0x18484, // Похоже, язык у меня опережает мысли.
    0x184C6, // К-конечно… тебе м-может не понравиться, но…
    0x18517, // Уверен, она не так плоха. В конце концов, тебя ведь она затянула?
    0x1858B, // Н-наверное.
    0x185A0, // Я устраиваюсь поудобнее на своём пуфе и принимаюсь за книгу, лежавшую на дне моего портфеля.
    0x18649, // Это ранобэ про пиратов. Если честно, я едва пробегаю взглядом по словам, да и выбрал я эту книгу лишь потому, что обычно не читаю этот жанр.
    0x18744, // Чувствуя, что не смогу её осилить, и принимая во внимание то, что я уже отвлёк Ханако, я решаю попытаться начать разговор.
    0x18820, // Так, я смотрю, Лилли ушла без тебя?
    0x1885E, // Она кивает прежде, чем отрывает взгляд от книги. Должно быть, она действительно ей сильно увлеклась.
    0x18915, // Лилли сказала, что ей надо пойти и… встретиться кое с кем…
    0x18981, // Да?
    0x18987, // С А-Акирой. Её сестрой…
    0x189B2, // Сестрой? Она не рассказывала про свою семью…
    0x18A05, // Она… она раньше жила вместе с Акирой.
    0x18A4A, // Я думал, все ученики живут в общежитиях.
    0x18A93, // О-они… То есть мы… не обязаны.
    0x18ACB, // Но так ведь легче, верно? То есть тут кормят и школа близко… Я в жизни так часто не приходил на уроки вовремя.
    0x18B91, // Она, на радость мне, украдкой улыбается.
    0x18BDA, // Где-то в глубине меня сверлят мысли о домашней работе, но в библиотеке очень уютно. И никто меня не найдёт и не заставит работать ни над каким проектом.
    0x18CED, // Мысль о фестивале наталкивает меня ещё на один вопрос…
    0x18D53, // Эй, Ханако, а что ты планируешь делать на фестивале?
    0x18DB1, // На долю секунды мне кажется, что она от неожиданности вот-вот подбросит книжку в воздух.
    0x18E52, // П-прости?..
    0x18E65, // Я спросил, что ты делаешь завтра на фестивале. Запланировала что-нибудь?
    0x18EE9, // Я… я не знаю.
    0x18F01, // Ответ Ханако намекает на то, что она не желает, чтобы её расспрашивали. Думаю, толпы народа и громкая музыка – действительно не по ней.
    0x18FF6, // А, ладно.
    0x19006, // Смени тему, смени тему…
    0x19032, // А какая из себя сестра Лилли?
    0x19067, // Она… она славная. Она симпатичная, как Лилли, но одевается… по-деловому…
    0x190EE, // По-деловому?
    0x19105, // Она… она постоянно ходит в костюме…
    0x19149, // А, понятно. И от этого она выглядит менее симпатичной?
    0x191AB, // Ханако смущённо трясёт головой.
    0x191E6, // Н-нет… просто… по-другому.
    0x19218, // Признаю, я заинтригован. Во-первых, тем, что Ханако говорит о ком-то, кроме Лилли, а во-вторых, тем, что отзывается о ней лестно…
    0x192FE, // Но, пытаясь вообразить внешний вид этой таинственной сестры, я представляю только Лилли в костюме. И такая картина кажется довольно симпатичной. Весьма.
    0x19416, // Ну, как-нибудь меня с ней познакомишь.
    0x1945B, // Х-хорошо.
    0x1946C, // Наша краткая беседа обрывается так же внезапно, как началась, и мы оба возвращаемся к своим книжкам.
    0x19523, // Ход времени отражает только движение солнечного зайчика, отбрасываемого оконным стеклом.
    0x195C9, // Постепенно шумы от всевозможных репетиций в здании затихают, а затем и вовсе смолкают по мере того, как ученики устают и отправляются есть.
    0x196C8, // Уже сама мысль об этом заставляет мой желудок завязаться в узел. Видимо, пора возвращаться.
    0x1976F, // Как ты думаешь, Лилли уже вернулась? Вернусь-ка я в общежитие. Утомился за эту неделю.
    0x1980A, // И это правда. Переход в новую школу, которая готовится к главному событию года, оказался, мягко говоря, тягостным.
    0x198D9, // Я чувствую, как начинаю клевать носом за чтением.
    0x19933, // Х-хорошо. Я… я, наверное, ещё посижу тут.
    0x1997C, // Взглянув на книгу Ханако, я замечаю, что ей до конца осталось всего несколько страниц.
    0x19A19, // Поначалу решив подождать её, я меняю решение, когда желудок снова принимается урчать.
    0x19AB6, // Конечно. Ну, я пойду, пока не стемнело. Ещё увидимся, ладно?
    0x19B20, // Д-да. Увидимся, Хисао.
    0x19B47, // Пока.
    0x19B51, // Х-Хисао?
    0x19B60, // С-спасибо. Ч-что побыл со мной.
    0x19B97, // Я вижу, как трудно ей произнести это простое предложение. На секунду я замираю.
    0x19C27, // Вот как. Выходит, в этой школе есть кто-то ещё более одинокий, чем я. Может быть, «одинокий» и неподходящее слово, ведь я не страдал отсутствием общества на протяжении всей недели, но всё равно чувствовал себя здесь чужим.
    0x19DB8, // Может, «одинокая» и для Ханако слово неподходящее: у неё, в конце концов, есть Лилли, ведь так?
    0x19E62, // Я понимаю, что уже слишком долго стою без ответа, и расплываюсь в широкой, искренней улыбке.
    0x19F09, // Всегда пожалуйста.
    0x19F2C, // Спокойной ночи, Ханако.
    0x19F57, // С-спокойной ночи.
    0x19F77, // Я ухожу, оставляя её дочитывать книгу, и направляюсь в общежитие в надежде наконец-то поесть…
    0x1A023, // Я и сам себя об этом спрашиваю. Наверное, потому что больше нечем заняться.
    0x1A0AB, // Он весело смеётся, а затем бросает взгляд на часы.
    0x1A106, // Мне уже пора бежать. Тедзука, я доволен, что этот небольшой проект так хорошо продвигается.
    0x1A1AC, // Я только заскочил напомнить, чтобы ты завтра никуда не убегала. Я пригласил на фестиваль кое-каких людей и уверен, что они будут рады с тобой встретиться.
    0x1A2C4, // И ещё, в понедельник занятие в кружке отменяется, поскольку я уеду из города. Думаю, что вы, ребятишки, сами найдёте чем заняться.
    0x1A3AE, // Он уходит, напыщенно повернувшись и зашагав прочь настолько театрально, насколько возможно.
    0x1A458, // Какой странный учитель.
    0x1A484, // Я тоже пойду. Увидимся, Рин.
    0x1A4B6, // Подняв в знак прощания руку, я направляюсь вверх по лестнице к общежитиям.
    0x1A53E, // Может, если мне удастся дочитать сегодня эти книги, завтра весь день будет свободен для фестиваля.
    0x1A5F2, // Думаю, мне интересен кружок рисования.
    0x1A639, // Ненароком произношу я.
    0x1A663, // Что ты имеешь в виду?
    0x1A689, // Ничего… конкретного.
    0x1A6B1, // Могу ли я как-нибудь к вам прийти? Хотя бы просто чтобы посмотреть.
    0x1A72A, // Я думал о вступлении в какой-нибудь кружок, и вот…
    0x1A786, // Я, конечно, ещё не обдумал всё как следует, но всю последнюю неделю во мне действительно росло смутное ощущение решительности.
    0x1A86D, // Я хочу что-нибудь делать. Хочу быть частью чего-нибудь.
    0x1A8D1, // Это вполне может быть и кружок рисования, несмотря на отсутствие у меня особого таланта.
    0x1A973, // Учитель кажется довольным.
    0x1A9A5, // Да? Хочешь вступить? Ну, мы, конечно, всегда рады новым лицам.
    0x1AA13, // Занятия в кружке вполне обычны. Мы изучаем различные аспекты изобразительного искусства и пробуем что-нибудь создать собственными руками.
    0x1AB13, // Или ногами.
    0x1AB28, // Он смущённо покашливает, но Рин не обращает на это ни малейшего внимания. Немного легче оттого, что не у одного меня проблемы с подбором слов в этой школе.
    0x1AC41, // Номия оправляется от своего промаха, бросая театральный взгляд на карманные часы и ещё более театрально хлопая себя по лбу.
    0x1AD24, // Мне уже пора бежать, но, если у тебя есть вопросы, уверен, Тедзука всё разъяснит.
    0x1ADB5, // Упоминание Рин в одном предложении со словом «разъяснять» кажется не очень уместным. Однако я не говорю этого учителю, который, кажется, сильно спешит.
    0x1AECA, // Тедзука, я доволен, что этот небольшой проект так хорошо продвигается.
    0x1AF4B, // Я только заскочил напомнить, чтобы ты завтра никуда не убегала. Я пригласил для тебя на фестиваль кое-каких людей, и уверен, что они будут рады с тобой встретиться.
    0x1B074, // Увидимся в понедельник, Накай.
    0x1B0AC, // Учитель уходит, и мы снова остаёмся одни. Рин продолжает рисовать, будто не случилось ничего примечательного. Поскольку так и есть, я продолжаю размышлять, что же со мной не так.
    0x1B1EF, // Мы с искусством не были слишком близки в прошлом, по крайней мере судя по оценкам, которые я получал в средней школе.
    0x1B2C3, // Может, занятия в кружке будут отличаться от обычных уроков? Кто знает…
    0x1B345, // Я пытаюсь придумать для Рин какой-нибудь осмысленный вопрос, но тщетно.
    0x1B3C8, // Просто схожу на занятие кружка и посмотрю, что там да как.
    0x1B431, // Значит, он пригласил назавтра людей, только чтобы они посмотрели на твою картину?
    0x1B4C6, // У него среди друзей много людей искусства. Они любят говорить об искусстве.
    0x1B550, // Думаю, он хочет, чтобы я поговорила с ними об искусстве.
    0x1B5B5, // У меня почему-то складывается чувство, что ты не слишком этому рада.
    0x1B631, // Рин неопределённо пожимает плечами, но всё равно создаётся впечатление, что ей неприятна идея обсуждения её или чьей-либо ещё картины с кем бы то ни было.
    0x1B74A, // Я на самом деле не люблю говорить об искусстве. Оно само по себе – способ общения, не требующий слов, так зачем ещё о нём говорить?
    0x1B836, // Понимаю.
    0x1B846, // Это всё равно что скучать и из скуки говорить о том, что тебе скучно.
    0x1B8C2, // А теперь не понимаю.
    0x1B8E7, // Ты когда-нибудь говорил о том, что тебе скучно? Это бессмысленно и не слишком захватывающе. Всё, что ты действительно можешь об этом сказать, – это: «Мне так скучно». Я однажды целую неделю пыталась сочинить какую-нибудь осмысленную речь на тему скуки.
    0x1BAB1, // Это была самая скучная неделя в моей жизни.
    0x1BB00, // Но это вполне закономерно, ты не находишь?
    0x1BB4D, // Рин одаряет меня кратким взглядом, таким, который, кажется, ничего не выражает, но на самом деле кое-что значит.
    0x1BC17, // В общем… Не знаю, я думаю, что редко могу подобрать какие-то слова об искусстве.
    0x1BCA8, // То есть, например, вот то, что ты сейчас делаешь. Я понятия не имею, что об этом думать, кроме того, что «выглядит здорово». О чём эта картина?
    0x1BDA5, // Ни о чём.
    0x1BDB5, // Так бы мне хотелось сказать. Вот я так и сказала.
    0x1BE0D, // Но я немного приврала. И сказала это, потому что хотела бы, чтобы это было правдой.
    0x1BEA2, // Учитель хотел, чтобы я её нарисовала, но у меня не было идей. Я попыталась родить какую-нибудь идею, но ничего не вышло.
    0x1BF79, // И теперь это картина без идей.
    0x1BFB0, // Но… что тогда ты рисуешь?
    0x1BFDF, // Без понятия.
    0x1BFF6, // Кстати, я могу её назвать «Без понятия».
    0x1C03F, // О, вот опять я начала думать. Это плохо.
    0x1C086, // Она энергично трясёт головой, чтобы вытряхнуть из неё «думание». При этом её светло-каштановые волосы развеваются в разные стороны.
    0x1C178, // Поэтому я и попросила Эми помочь мне. С ней легко ни о чём не думать.
    0x1C1F3, // Знаешь, она просто говорит, говорит, говорит ни о чём часами. У неё голова будто набита мыльными пузырями.
    0x1C2B3, // Ты тоже на неё похож, но не очень. Если ты останешься, то очень поможешь.
    0x1C335, // Я не уверен, комплимент это или нет. Возможно, ни то ни другое, учитывая, насколько Рин ко всему безразлична.
    0x1C3F9, // Ты хочешь, чтобы я делал что-то конкретное, чтобы помочь тебе не думать?
    0x1C47B, // Просто будь.
    0x1C492, // Так, не зная, что делать, я просто сажусь на пустую коробку и, лениво полистывая страницы книги о распитии пива, продолжаю смотреть на то, как она рисует.
    0x1C5A7, // У Рин безмятежное выражение лица, а за тёмными глазами таятся какие-то мысли. Нет, стоп, она ведь ни о чём не думает, верно?
    0x1C684, // Она спокойно напевает мелодию, то и дело прерываясь на вежливую просьбу намешать ещё краски или подать другую кисть.
    0x1C75A, // Она поразительно сосредоточена, несмотря на недосып и требования поскорее закончить работу.
    0x1C805, // Картина сантиметр за сантиметром приобретает форму, деталей становится всё больше, цвета сплетаются друг с другом, заполняя пробелы, наползая один поверх другого.
    0x1C931, // Я снова задумываюсь о том, что вдохновляет и мотивирует людей творить.
    0x1C9B2, // Откуда берутся идеи? Они не приходят из ниоткуда, и не думаю, что есть какие-то музы, чудесным образом впрыскивающие вдохновение прямо в голову.
    0x1CAB8, // У идей есть источник и назначение.
    0x1CAF7, // Чем больше я об этом думаю, тем больше убеждаюсь в том, что Рин соврала насчёт фрески или по меньшей мере исказила правду. Возможно, сама того не осознавая.
    0x1CC11, // Невозможно сотворить что-то, не имея представления о конечном результате. Это пойдёт вразрез с самим понятием творчества.
    0x1CCF1, // Каждому штриху предшествует решение. Даже если они наносятся в случайном порядке, это тоже сознательное решение.
    0x1CDC1, // Так что её картина, даже эта, наверняка имеет под собой какую-то основу или идею о том, что она хочет изобразить.
    0x1CE8C, // Если идея Рин в том, чтобы, как она говорит, не иметь идеи, то разве это нельзя считать идеей?
    0x1CF33, // Логический парадокс? Видимо, через такие парадоксы Рин и проявляет себя в повседневных делах и в общении, поэтому неудивительно, что она сама этого не заметила.
    0x1D058, // Я раздумываю, не озвучить ли всё это, но потом решаю, что не хочу ввязываться в спор о логике с этой девушкой.
    0x1D11D, // В мозгу кого-нибудь из нас наверняка вскоре начнёт коротить, поэтому я отвергаю эту мысль.
    0x1D1C2, // Рин принимается вертеться и ёрзать.
    0x1D204, // Даже её, по обыкновению, пустой взгляд вдруг приобретает довольно обеспокоенное выражение, которое у людей просто так не возникает.
    0x1D2F6, // Всё в порядке?
    0x1D310, // Да. Нет.
    0x1D31E, // Спина опять начала болеть.
    0x1D34F, // Картина всё же слишком большая, и в таком положении трудно рисовать.
    0x1D3CC, // Может, сделаешь перерыв?
    0x1D3F9, // Когда закончу эту часть.
    0x1D426, // Перерыв она, конечно же, так и не делает, и я о нём ей больше не напоминаю, потому что это совершенно бессмысленно.
    0x1D4F4, // Рин продолжает работать, и я остаюсь с ней: мне нравится смотреть, как она рисует. А теперь я собираюсь стать членом того же кружка, в котором состоит она.
    0x1D60B, // Когда она объявляет о завершении фрески, стоит уже такая темень, что мне непонятно, как она может быть в этом уверена.
    0x1D6E1, // Не следует никаких торжественных речей, не возникает никакого чувства удовлетворения от хорошо проделанной работы, только усталое краткое «я всё», и мы расходимся.
    0x1D80F, // Думаю, просто застрял тут с ней.
    0x1D849, // Мне интересен кружок рисования.
    0x1D884, // Пойду на прогулку в город.
    0x1D8B4, // Пойду в библиотеку.
    0x1D8D8, // Ю… Юко?
    0x1D8E6, // Привет, я и не знал, что ты здесь работаешь.
    0x1D934, // А, да, м-м…
    0x1D947, // Добро пожаловать в «Шанхай»! Могу я принять ваш заказ?
    0x1D9AA, // Не знаю… кофе, пожалуйста?
    0x1D9DB, // Да, конечно. Я прямо сейчас займусь им и принесу вам, когда он будет готов.
    0x1DA61, // Э, спасибо.
    0x1DA75, // Привет, Лилли.
    0x1DA8F, // …Хисао?
    0x1DA9E, // Да. Рад снова тебя видеть.
    0x1DACD, // Вы знакомы?
    0x1DAE2, // Я… полагаю, да.
    0x1DAFE, // Хм… может, присядешь?
    0x1DB26, // Полагаю, вас следует представить.
    0x1DB64, // Хисао, это Акира Сато, моя старшая сестра. Акира, это Хисао Накай, он тоже учится в «Ямаку».
    0x1DC08, // Ну, как дела в школе?
    0x1DC2D, // Ты, похоже, сильно занята.
    0x1DC5C, // Мне теперь хотя бы не приходится готовить тебе обед каждый день после уроков.
    0x1DCEA, // Ох, как резко. Разве ты не для себя готовила? А я только получала остатки.
    0x1DD6E, // Я не к тому… тебе хотя бы удаётся себя прокормить?
    0x1DDCA, // Я, знаешь ли, умею готовить, не взрывая кухню.
    0x1DE1C, // В большинстве случаев.
    0x1DE46, // Это…
    0x1DE50, // Ха-ха-ха! Всё в порядке, в порядке. Мне всё равно пришлось бы когда-нибудь научиться.
    0x1DEE8, // О, Лилли?
    0x1DEF8, // Ну, мне, наверное, пора. Была рада с тобой поговорить, Лилли.
    0x1DF64, // Акира, тебе уже…
    0x1DF83, // Извини, мне нужно вернуться на работу. Они снова начнут ко мне цепляться, если я быстро не вернусь.
    0x1E036, // Пока, Акира…
    0x1E04E, // Ну давай, не грусти. Скоро ещё встретимся. Пока.
    0x1E0A4, // Она довольно приятный человек.
    0x1E0DD, // Мы раньше жили вместе, но теперь, когда я живу в интернате, мы даже видимся очень редко.
    0x1E17B, // Вы жили вместе? Где-то здесь, недалеко?
    0x1E1C1, // Мы жили довольно далеко к югу, так что путешествие в «Ямаку» было весьма длинным.
    0x1E255, // Затем она стала работать дольше, а «Ямаку» находился слишком далеко, так что у меня не осталось выбора, кроме как переехать в общежитие.
    0x1E34D, // Я так понимаю, ты уже отдохнул?
    0x1E385, // Твоё дыхание успокоилось по сравнению с тем, каким оно было, когда ты только вошёл.
    0x1E41C, // Да. Хотел немного пройтись, а вместо этого стал гулять по всему городу.
    0x1E49D, // Ты уходишь?
    0x1E4B2, // Да. А ты не собираешься тоже пойти? Уже довольно поздно.
    0x1E517, // Юко, можно нам ещё один кофе, пожалуйста?
    0x1E561, // Хорошо, сейчас принесу!
    0x1E58C, // Это было… прямолинейно.
    0x1E5B9, // Значит, жаждешь общества?
    0x1E5E8, // Хм… Я бы сказала, что просто задалась вопросом…
    0x1E641, // Нет ли у тебя братьев или сестёр?
    0x1E67D, // Нет, я единственный ребёнок. Если честно, я немного завидую тем, у кого есть кто-то настолько близкий.
    0x1E735, // Занятно…
    0x1E747, // Просто я уже такое слышала от других.
    0x1E78B, // Над этим вопросом сложно думать объективно, учитывая, что у меня такой человек всегда был.
    0x1E830, // Фельдшер сказал, что у тебя недавно случился инцидент.
    0x1E894, // А, так вот в чём дело.
    0x1E8BA, // Ну, вроде того, но здесь не о чем волноваться.
    0x1E90C, // Вообще-то есть о чём. Следует волноваться обо всём, что подвергает опасности твоё здоровье.
    0x1E9B3, // Мы здесь изо всех сил стараемся подготовить тебя к самостоятельной жизни. А к подготовке относится знание пределов твоих возможностей и того, как с ними обходиться.
    0x1EAE1, // С моей стороны было бы беспечно не поговорить с тобой об этом.
    0x1EB52, // Хорошо, я понял. Мне жаль.
    0x1EB80, // Муто с недовольным видом закрывает глаза, и мне в голову приходит мысль, что это, возможно, был не лучший ответ.
    0x1EC4A, // Что-то мне подсказывает, что ты не сожалеешь. Притворяйся сколько хочешь, но это – не обычная школа.
    0x1ED00, // Многие люди потратили много времени, усилий и денег, чтобы ты, как и любой другой ученик здесь, получил такой же уровень образования, как и твои ровесники.
    0x1EE19, // Сводить на нет все эти усилия, пренебрегая советом, – а тем более медицинским советом, – просто эгоистично.
    0x1EEDE, // Я не уверен, действительно ли он так считает или же просто разыгрывает неоднократно отрепетированную сцену наставления ученика на путь истинный. Но в любом случае это работает.
    0x1F023, // Хорошо, я понял. Я ещё не освоился здесь, поэтому прошу прощения. Теперь я знаю пределы своих возможностей и постараюсь впредь их придерживаться.
    0x1F12C, // Муто одобрительно улыбается, удовлетворённый тем, что смог до меня достучаться.
    0x1F1BF, // Ну, рассказывай, как дела?
    0x1F1EE, // Дела?
    0x1F1F8, // Я знаю, что Муто умеет говорить загадками, но это переходит все границы.
    0x1F27B, // Ну да. Просто уже прошла неделя, как ты осваиваешься здесь, поэтому я и спрашиваю.
    0x1F30F, // Э… Думаю, всё нормально.
    0x1F33C, // Ясно. А как твоё… состояние?
    0x1F370, // Пауза перед «состоянием» кажется немного лишней.
    0x1F3CB, // Пока никаких проблем не было.
    0x1F401, // По лицу Муто проскальзывает тень облегчения.
    0x1F454, // Хорошо. Это хорошо. Школьный фельдшер волновался, что ты, возможно, будешь слишком перенапрягаться.
    0x1F50A, // Он попросил меня присматривать за тобой, когда сам не может.
    0x1F578, // Понятно…
    0x1F58A, // Я бы попросил, чтобы ты не отмахивался от нас. Несмотря на то что мы пытаемся дать тебе уровень образования, который ты мог бы получить в обычной школе, тебе нужно осознавать, что у твоих возможностей есть границы.
    0x1F70E, // Наша цель – удостовериться в том, что ты осознаёшь, где твой предел и как раскрыть свой потенциал, не выходя за него. Понимаешь, к чему я веду?
    0x1F80F, // Наверное. В смысле, я не собираюсь делать глупостей.
    0x1F86E, // Ну, думаю, для начала уже хорошо.
    0x1F8A9, // Не испытывая особого желания чем-либо заниматься, я просто направляюсь прямо к себе в комнату и провожу остаток дня за чтением.
    0x1F992, // Ты мне уже рассказывала.
    0x1F9BF, // Мы переглядываемся с Эми – я понимаю, что она тоже уже слышала эту историю.
    0x1FA48, // Ни один из нас ничего не говорит Рин, и та продолжает бубнить, словно плохой комик.
};

#endif // KS_SCRIPT_A1_SATURDAY_RU_TL_INDEX