#ifndef KS_SCRIPT_A1_WEDNESDAY_RU_TL_INDEX
#define KS_SCRIPT_A1_WEDNESDAY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int script_a1_wednesday_ru_intl[] = {
    0x0000, // Сразу за углом коридора удар в грудь с силой несущегося на полной скорости поезда чуть не сбивает меня с ног.
    0x00C7, // Чья-то рука ложится мне на плечо; в тот же момент глаза девочки округляются от ужаса, а её реплика прерывается испуганным—{w=.9}{nw}
    0x01B1, // И-и!
    0x01B8, // Не успеваю я обернуться, как Сидзунэ отталкивает меня в сторону и нависает над девочкой, яростно жестикулируя.
    0x0283, // Мисс Ибарадзаки, я всё видела. Бегать по коридорам строго запрещено.
    0x0300, // Миша переводит стоя позади Сидзунэ, но её голос по-девчачьи игрив и совсем не выражает священного гнева, читающегося в жестах Сидзунэ.
    0x03F6, // Э… извините, мне просто надо было забрать кое-что и я немного торопилась…
    0x047E, // …
    0x0482, // Вам уже говорили об этом тысячу раз. Ваше неосмотрительное поведение подвергает опасности других учеников и, что ещё хуже, прямо противоречит школьным правилам.
    0x05AA, // Девочка краснеет от стыда и начинает мяться на месте, как ребёнок, которого отчитывают за плохое поведение.
    0x066F, // Это выглядит так мило, что я не могу сдержать улыбку.
    0x06CF, // Я знаю! Я-я… эм… я просто…
    0x0700, // Вы уж постарайтесь, чтобы подобное не повторилось… Хотя я уверена, что вы презираете правила и делать вам замечания – совершенно бессмысленная трата моих нервов.
    0x082B, // Поняла, Эми?
    0x0841, // В ответ маленькая девочка показывает язык.
    0x0890, // А-а-а!
    0x089A, // Мне надо спешить!
    0x08BA, // Учитель мне голову оторвёт! Я обещала помочь с распечатками, а вместо этого пошла бегать! Извините, но мне надо переодеться и всё такое!
    0x09B1, // Прежде чем Миша, Сидзунэ или я успеваем что-либо сказать, она срывается с места и в одно мгновение оказывается на полпути к лестнице.
    0x0AA3, // Сидзунэ выглядит так, будто готова взорваться от злости; я улыбаюсь в тщетной попытке успокоить её.
    0x0B59, // Ты в порядке, Хиттян? От этой Ибарадзаки вечно одни неприятности.
    0x0BD0, // Знаешь, я твёрдо уверен, что Сидзунэ не назвала бы меня «Хиттян».
    0x0C46, // Да ладно тебе!
    0x0C60, // Ну, в общем, я в порядке. Меня просто слегка ушибли.
    0x0CBC, // Это здорово, Хиттян!
    0x0CE1, // Я бы не сказал, что это «здорово», но на этот раз воздерживаюсь от комментариев.
    0x0D72, // Наблюдая за её походкой, я отмечаю, что она делает очень быстрые, тяжёлые и уверенные шаги.
    0x0E17, // Возможно, такая походка была бы уместна, если бы мы пробирались сквозь снежную бурю, но на улице стоит ясный безветренный день. В любом случае я чувствую себя абсолютно выдохшимся лишь глядя на неё.
    0x0F80, // Вероятно, именно благодаря такому безумному темпу мы добираемся до чайного дома за время, которое Миша называет «рекордным». Мне слегка досадно оттого, что перед моим взглядом не предстаёт здание феодальной эпохи с татами на полу и женщинами в кимоно, разливающими чай.
    0x116E, // Чайный дом оказывается самым обычным кафе. Впрочем, это не так уж и плохо – выглядит довольно уютно.
    0x1225, // Как только мы оказываемся внутри, к нам немедленно подбегает девушка, будто поджидавшая нас всё это время.
    0x12E8, // Добро пожаловать! Спасибо, что выбрали наше заведение!
    0x134C, // Она кланяется резким движением, будто рубит топором дрова.
    0x13B8, // Я с удивлением узнаю в ней Юко, нашего библиотекаря.
    0x1417, // Привет. Я не знал, что ты работаешь и здесь.
    0x1465, // А… Да, работаю. Официанткой… Уже год, шесть месяцев и две недели… Спасибо, что выбрали именно наше заведение. Я могу вам чем-нибудь помочь?
    0x1563, // Привет, Ю-тян~!
    0x157D, // Приветствую.
    0x1595, // Миша, вы обе тоже с ней знакомы?
    0x15CE, // Конечно, Хиттян~! Ю-тян у нас в библиотеке работает, в конце концов~! Я редко хожу туда, но Ситтян её знает! И~! Мы часто приходим сюда, поэтому получается, что постоянно с ней видимся!
    0x1715, // Эм… Да… Я принесу вам всё, что вы обычно заказываете. И… если ещё что-нибудь понадобится, пожалуйста, просто позовите меня.
    0x17F7, // Тебе не обязательно говорить с нами в таком формальном тоне. Мы ведь все знакомы.
    0x188B, // К тому же народу в кафе совсем мало, она могла бы чувствовать себя и посвободнее.
    0x191E, // Я надеялся, что мои слова помогут ей расслабиться, но они оказывают обратный эффект.
    0x19B8, // Нет… Я же официантка, это моя работа, поэтому я должна… выполнять её как подобает.
    0x1A4F, // Ладно, ладно~! Ситтян не возражает! Ю-тян, принеси, пожалуйста, Ситтян то же, что и всегда, а мне – зелёный чай с молоком и мёдом.
    0x1B34, // Не переживай так.
    0x1B54, // Эм, да… но… это же моя работа, и… всегда есть из-за чего переживать. Извините, я не должна спорить с клиентом… Извините! Извините!
    0x1C41, // Юко снова начинает стремительно кланяться. Я сдаюсь и присоединяюсь к Сидзунэ и Мише за их столиком.
    0x1CF9, // Когда я располагаюсь в кресле, ко мне подходит Юко, выглядящая ещё более расстроенной, чем во время предыдущего разговора.
    0x1DD9, // Извините! Мне правда очень, очень жаль! Я забыла принять ваш заказ… Я… невнимательна к посетителям, так нельзя… Простите меня… Если я могу как-то загладить свою вину, пожалуйста, только скажите…
    0x1F40, // Всё в порядке, Ю-тян, просто Хиттян ещё ничего не заказал. Ты ни в чём не провинилась, незачем так расстраиваться.
    0x200D, // Действительно, пора бы и мне сделать заказ. Но я не знаю, что здесь подают, и меню нигде не видно.
    0x20BB, // Миша права. Мне, пожалуйста, кофе и… сэндвич, если у вас есть. Самый вкусный, на твой выбор, раз уж Сидзунэ за меня платит.
    0x2196, // Сидзунэ одаряет меня взглядом, в котором смешиваются удивление, негодование и шок. Она явно не может решить, на чём ей остановиться.
    0x2287, // Хиттян, вот у тебя в бумажнике сколько денег? Ведь что-то точно есть, да? Нам надо разделить сумму заказа на троих, чтобы было честно~! Да, и на другое я не согласна~!
    0x23AE, // Миша поворачивается к Юко.
    0x23DF, // Ю-тян, Ситтян говорит, что хочет три порции самого дорогого блюда из меню~
    0x2465, // Нет!
    0x246D, // Ха-ха-ха~! Мы шутим, Хиттян…
    0x249F, // Эм… хорошо… Думаю, сэндвич с индейкой здесь самый вкусный… К тому же к нему подаётся бесплатный суп… Хотя хороший работник должен был бы порекомендовать блюдо, которого у нас в избытке, ну… или самое дорогое блюдо…
    0x262D, // У меня плохо получается?
    0x265A, // Вовсе нет! Звучит отлично, я беру. И кофе, пожалуйста.
    0x26BA, // Хорошо.
    0x26C8, // Через несколько минут она приносит напитки и сэндвич. Сидзунэ обходится одним только чаем, а Миша заказала ещё и парфе. Не представляю, почему именно его: сложно придумать более неподходящий десерт к чаю.
    0x283D, // Ну да ладно. Я кусаю сэндвич. Он на удивление сочный и вкусный.
    0x28AE, // Хиттян, ты уже подумал о вступлении в Школьный совет?
    0x290F, // Хм?
    0x2915, // Хиттян, не говори с набитым ртом…
    0x2953, // Я запиваю еду глотком кофе, который тоже весьма неплох. Но сейчас не время хвалить это заведение.
    0x2A04, // Вы же сами признали, что мне ещё рано принимать такое серьёзное решение! И было это всего три часа назад!
    0x2AC2, // Мужчина должен быть решительным, Хиттян!
    0x2B0D, // Тебе правда стоит вступить, Хиттян. Давай же, будет весело!
    0x2B78, // «Будет весело», как правило, говорят о том, что на самом деле ни капли не весело.
    0x2C09, // Ты что, мне не веришь, Хиттян?
    0x2C3E, // Кто из них это сказал? Такое серьёзное давление в словах Миши – и такая невинная улыбка на лице. Похоже на раздвоение личности.
    0x2D26, // Эм-м…
    0x2D31, // Это обидно, Хиттян. Мы ведь просто хотим проводить с тобой время…
    0x2DA9, // Вот именно, Ситтян! И это тоже!
    0x2DE0, // Все оказываются в плюсе, решаются все наши проблемы~
    0x2E40, // Я тоже думала, что Хиттян это хоть немножко оценит… Обидно!
    0x2EAD, // Моего мнения опять никто не спрашивает.
    0x2EF6, // Эй, прекратите разговаривать так, будто меня тут нет.
    0x2F57, // Сидзунэ поправляет очки и смеётся про себя.
    0x2FA7, // У-у, но ведь правда же, Хиттян~! Ты бы нас очень выручил, в этом году у нас совсем мало людей.
    0x304B, // Насколько мало?
    0x3068, // О, а это секрет, Хиттян.
    0x3092, // Нет, я хочу знать. Насколько мало ваше «мало»?
    0x30E5, // А-ха-ха…
    0x30F5, // Пятеро?
    0x3103, // Меньше?
    0x3111, // Ну-у…
    0x311C, // Ноль?
    0x3126, // Ва-ха-ха~! Хиттян, неважно сколько. Важно, что мало, и поэтому мы были бы рады твоей помощи. Особенно когда фестиваль на носу, да и вообще год нас ждёт очень занятой.
    0x324D, // То есть ты не хочешь отвечать?
    0x3284, // Нет~
    0x328C, // Я вздыхаю и выпрямляю спину, пытаясь придать себе деловой вид. Это кажется серьёзным решением, и мне не хочется вот так запросто сдаваться. Хотя чувствую я себя глупо, словно надутая рыба-ёж.
    0x33E7, // Ладно, тогда скажите хотя бы, сколько человек в Школьном совете? Всего?
    0x3468, // Эм, ну, Хиттян, нас достаточно, чтобы выполнять необходимую работу, но явно меньше, чем хотелось бы. Да-да-да~!
    0x352D, // Только не говори мне, что вас там всего двое.
    0x357E, // Ха-ха-ха~! Забавно, Хиттян~!
    0x35AE, // Но~! В нём точно не только мы одни.
    0x35EB, // Вы уверены? Абсолютно уверены?
    0x3623, // Угу~!
    0x362C, // Я всматриваюсь в их лица, рассчитывая на то, что они чем-нибудь выдадут себя, подтверждая мои худшие опасения.
    0x36F4, // Миша хмурится. Ей явно не по себе, но это, скорее всего, связано с тем, что я столь пристально на неё уставился.
    0x37BB, // Сидзунэ, напротив, отвечает мне одним из своих фирменных взглядов. Может быть, она бросает мне вызов, вот так уставившись на меня поверх очков. Её взгляд так и дразнит меня; он на удивление детский, словно она маленькая девочка, которая пытается втянуть кого-то в свою игру.
    0x39AB, // Хиттян, две прелестные представительницы Школьного совета оказывают тебе радушный приём и даже угощают ланчем. Тебе следовало бы выразить свою признательность, вступив в Совет, чтобы помочь им.
    0x3B10, // Да, было бы здорово, если бы ты помог нам заполнить кое-какие бумаги, и… скоро фестиваль, так что надо построить несколько киосков для аттракционов и продажи еды, так что, если бы ты вступил, нам было бы куда проще…
    0x3C95, // Ну, пожалуйста, Хиттян?
    0x3CBF, // Забавно, как хорошо у них получается разыгрывать роли плохого и хорошего полицейского.
    0x3D5F, // В принципе, я могу попробовать.
    0x3D98, // Почему бы и нет? Просто чтобы присмотреться.
    0x3DE9, // Ладно, я согласен попробовать. Но это не значит, что я уже определился со вступлением. Я помогу немного, а потом посмотрим. И таким образом, кстати, я расквитаюсь за этот обед. Я соглашаюсь не потому, что хочу.
    0x3F61, // Я доедаю сэндвич, и это заставляет Мишу вспомнить, что перед ней стоит парфе. Она берётся за него, чем сильно огорчает Сидзунэ: ей явно ещё многое хочется высказать.
    0x408C, // Всякий раз, как я гляжу на Сидзунэ, она отвечает мне весьма сосредоточенным горящим взором. И сейчас тоже. Несколько секунд выражение лица Сидзунэ остаётся непроницаемым: наверное, она о чём-то размышляет. Через некоторое время на её губах появляется улыбка.
    0x4264, // Она что-то жестикулирует мне, и я, само собой, не понимаю, что она хочет сказать. Причём она это знает. Она повторяет ещё раз, энергично и по-детски игриво.
    0x437A, // Миша, что она сказала?
    0x43A2, // …?
    0x43A7, // Миша отвлекается от парфе явственно разрываясь между желанием помочь и желанием вернуться к сладкому.
    0x4464, // Что это значит?
    0x4480, // Я изо всех сил пытаюсь повторить жесты Сидзунэ – это оказывается очень нелегко. Страшно подумать, каково было бы использовать их постоянно, изо дня в день за неимением других средств общения.
    0x45DF, // Хм~… Прости, Хиттян, не скажу.
    0x4615, // Почему? Это что-то обидное?
    0x4646, // Нет, Хиттян, потому что~! Это что-то хорошее.
    0x4695, // Что-то хорошее, значит? Они возвращаются к своим напиткам и еде, так что, я полагаю, разговор пока окончен.
    0x4755, // Я не совсем понимаю. Но от этого во мне разгорается желание понимать. Может, попытаться выучить язык жестов? В этой школе должны быть курсы.
    0x4853, // Пойду ли я на такой шаг? Я допиваю кофе, размышляя об этом. Не знаю, с чего я вдруг вообще задумался о подобном.
    0x491A, // Я так хорошо провожу здесь время, что упускаю из виду одну важную деталь: десять минут назад наша прогулка превратилась в прогул.
    0x4A06, // Если мы выйдем прямо сейчас, то будем в школе… минут через тридцать? Наверное. В моём состоянии не стоит бегать, поэтому вряд ли сможем добраться быстрее.
    0x4B1F, // Хотя мы всё равно уже опоздали на десять минут, так что даже телепортация не спасла бы.
    0x4BBD, // Что-то не так, Хиттян?
    0x4BE4, // Перерыв кончился десять минут назад. Я тут всего третий день и уже прогуливаю.
    0x4C73, // Угу~! Ты прогулял.
    0x4C93, // Эй, это не смешно! Вы тоже! Кстати, разве вы не члены Школьного совета? Вы подаёте дурной пример.
    0x4D40, // Хиттян у нас такой моралист…
    0x4D76, // Но~! Хиттян прав, он опоздал и~ не торопится идти на урок.
    0x4DDC, // Как представители Школьного совета мы позаботимся, чтобы тебя наказали за это~!
    0x4E6E, // Но ведь это вы меня сюда притащили, поэтому вина лежит на вас! Будьте поответственней!
    0x4F0B, // Хиттян, мы вербовали потенциального члена Совета. Уважительная причина~! Но… ты не член Совета, поэтому у тебя нет оправдания!
    0x4FF2, // Есть. Этот «потенциальный член Совета» – я.
    0x5042, // Да~! Ты вступаешь в Школьный совет, Хиттян?
    0x508F, // Сидзунэ торжествующе поднимает чашку, оттопырив мизинчик и помахивая им.
    0x5116, // Эх, Хиттян, если бы только ты был членом Школьного совета… Но~! У тебя ещё есть шанс согласиться! Присоединишься сейчас – избежишь проблем и сможешь совершать такие маленькие прогулки с нами ещё много-много раз! Будет весело~!
    0x52B2, // Я начинаю подозревать, что угодил в заранее расставленную хитроумную западню. Вероятно, Сидзунэ заманила меня сюда, рассчитывая на то, что я забуду о времени и окажусь в подобной ситуации. Коварно…
    0x541C, // Что ж, учитывая всё то, что мне о ней известно, мне стоило оставаться настороже. Но если я признаю то, что сам виноват в сложившейся ситуации, то никогда не смогу простить себя.
    0x555A, // Я пытаюсь прочесть намерения Сидзунэ по её глазам, но она просто смотрит на меня ничего не выражающим невинным взглядом. Она делает глоток чая, будто насмехаясь надо мной.
    0x5693, // Кстати, Хиттян, я не планировала ничего подобного, это вышло само собой~!
    0x5717, // Я уже собирался списать эту теорию на паранойю, но эта фраза порождает новый виток подозрений. Я чуть не падаю со стула от ужаса, когда осознание накрывает меня с головой. Итак, всё и вправду было умело подстроено. С самого начала. Всё ради того, чтобы в тот миг, когда я начну сгорать со стыда, заставить меня присоединиться к Школьному совету.
    0x5986, // А-ха-ха-ха-ха~! Ты что, нервничаешь, Хиттян~? Ты ведь не думаешь, что мы всё это время играли с тобой?
    0x5A37, // Разве нет?
    0x5A4A, // Хиттян, ты действительно так думал?..
    0x5A8D, // Миша понуро опускает голову, и Сидзунэ тут же вторит ей. Как синхронно. Прекрасная пара. Точно близнецы.
    0x5B4A, // Хиттян, Ситтян говорит, что она польщена, но такой поступок был бы неприемлемым злоупотреблением властью и посягательством на твою свободу воли~! И~! Это было бы шантажом! Ситтян никогда бы так не поступила, никогда!
    0x5CD2, // Меня так и подмывает спросить Мишу, уверена ли она в этом, но я сдерживаюсь.
    0x5D5B, // И Ситтян сказала правду о том, что, раз ты с нами и мы выполняем работу для Совета, нет ничего страшного в пропуске пары уроков.
    0x5E41, // Не то чтобы это было таким уж хорошим оправданием…
    0x5E9F, // …И не то чтобы так можно было поступать чаще трёх раз в месяц…
    0x5F12, // И не то чтобы этим можно и нужно было бы злоупотреблять…
    0x5F7A, // Поэтому~! Нам обязательно, обязательно нужно вернуться в класс! Когда-нибудь~!
    0x6008, // Ва-ха-ха!~
    0x6019, // Сидзунэ машет Юко и указывает на пустую чашку, прося повторить заказ. Миша второпях доедает парфе, явно не собираясь на нём останавливаться. Может быть, и мне стоит взять ещё что-нибудь?
    0x616B, // Сэндвич был чрезвычайно мал, и я не наелся, а раз Сидзунэ за всё платит, то можно попросить принести ещё один.
    0x6231, // …Мы покидаем чайный дом, просидев в нём не один, а целых два урока.
    0x62AA, // Сидзунэ и Миша, кажется, не возражают против того, чтобы прогулять их все. Они придумывают новый повод потянуть время, предлагая экскурсию по городку, которая выливается в прогулку по двум ближайшим кварталам.
    0x6429, // Через какое-то время мы всё же возвращаемся в школу, и остаток учебного дня проходит как обычно. После уроков Сидзунэ и Миша собираются и покидают класс раньше меня. Если подумать, это первый раз, когда они оставили меня одного.
    0x65C7, // Странно, мне даже как будто бы не хватает их компании. Класс быстро пустеет, и я покидаю кабинет последним.
    0x6689, // Однако в вестибюле передо мной резко опускается, словно шлагбаум, знакомая рука.
    0x671D, // О, привет, Сидзунэ.
    0x673F, // И знакомые ладошки закрывают мои глаза под взрыв озорного смеха.
    0x67B6, // Эй, Хиттян~! Угадай кто?
    0x67E0, // Миша задаёт этот вопрос без малейшего намёка на сарказм, что означает её искреннюю веру в то, что я не способен узнать её по ряду совершенно очевидных признаков.
    0x6906, // Кто бы это мог быть? Ну уж точно не Миша…
    0x6950, // Ха-ха-ха~! Именно она!
    0x6976, // Она подскакивает к Сидзунэ и встаёт рядом.
    0x69C4, // Хиттян, ты сейчас занят?
    0x69F0, // Занят, направляюсь в свою комнату. Увидимся завтра!
    0x6A4E, // Я пытаюсь их обойти, но Сидзунэ проворно меня останавливает. Похоже, годы игры в футбол прошли даром. Наше поведение привлекает слишком много лишних взглядов. Лучше бы сдаться, пока я совсем не опозорился.
    0x6BC4, // Хиттян, не мог бы ты подняться наверх и принести кое-что из кабинета кружка рисования?
    0x6C61, // Почему я?
    0x6C72, // Ха-ха-ха~! Ситтян считает, что если мы встретим учителя рисования, то он начнёт с нами здороваться, а он ей не нравится!
    0x6D48, // Пусть не обращает на него внимания.
    0x6D89, // Она пыталась, но, несмотря на то что Ситтян глухая, он всё равно говорит: «Привет~!»
    0x6E1F, // А убежать?
    0x6E32, // Я никогда не бегу с поля боя!
    0x6E66, // Резкость этих слов заметна даже через Мишин перевод. Спорить об этом дальше с Сидзунэ бесполезно.
    0x6F19, // Миша, а почему ты не сходишь?
    0x6F4D, // У меня от лестниц голова кружится, Хиттян!
    0x6F9A, // Сидзунэ кивает в подтверждение её слов.
    0x6FE3, // Ну, пожалуйста, Хиттян! Нам нужны эти материалы, чтобы построить киоски для фестиваля! Ты же обещал немного помочь, ведь так? Так?
    0x70CD, // Не стоило бы этого делать, но разок можно и помочь.
    0x7129, // Ладно.
    0x7135, // Отлично, Хиттян! Спасибо~!
    0x7164, // Вот что нам нужно!
    0x7185, // Она передаёт мне бумажку.
    0x71B4, // Список явно составляла Сидзунэ. Он написан от руки, но каждый символ вычерчен с безупречной точностью, как будто набран на компьютере, а сам список предельно подробен, с пунктами, подпунктами и даже клеточками для галочек.
    0x734A, // Им нужны краски, кисти, листы ватмана и мольберты разных типов и в разных количествах. Интересно, как я протащу всё это вниз по лестнице, не сломав шею?
    0x745C, // Вопреки моему первому впечатлению, Муто оказался неплохим учителем: ему удаётся интересно подать материал.
    0x7522, // Однако методика преподавания у него всё же странная. Он как будто считает, что все мы гении от рождения.
    0x75DF, // С последним звонком я понимаю, что до конца дня мне абсолютно нечем заняться.
    0x766C, // Странно: в больнице у меня целые дни были свободными, но в этой школе задача по заполнению значительно меньшего количества времени кажется более трудной.
    0x7786, // Все остальные ученики покидают класс, оставляя меня наедине с учителем.
    0x780A, // Муто проверяет листки с заданиями, над которыми мы сегодня работали, и делает в них пометки красной ручкой.
    0x78CE, // На секунду оторвав взгляд от бумаг, он замечает меня и морщит лоб.
    0x7946, // Ты что-то хотел, Накай?
    0x796F, // Я вздрагиваю от неожиданного обращения ко мне. Но, наверное, это естественно, что у нас завязалась беседа, ведь больше в классе никого нет.
    0x7A6B, // Эм-м… ничего. Я думал, чем бы заняться после школы.
    0x7AC7, // Учитель закрывает ручку колпачком и ровняет стопку бумаг, дважды стуча ей по столу.
    0x7B60, // В этот момент своей педантичностью он напоминает мне Сидзунэ. Впрочем, его неторопливость и расслабленность сразу же стирают это впечатление.
    0x7C66, // И что надумал?
    0x7C80, // Я хочу вступить в кружок, но пока не решил в какой.
    0x7CDB, // Походи на собрания разных кружков – может, что и понравится.
    0x7D4A, // Пожалуй…
    0x7D5C, // Но я…
    0x7D67, // Я не знаю, стоит ли спрашивать об этом.
    0x7DAD, // А от пристального взгляда Муто желание говорить и вовсе пропадает.
    0x7E28, // Но рано или поздно мне всё равно придётся коснуться этой темы.
    0x7E9A, // Я не знаю, как вести себя с людьми… то есть с остальными учениками в этой школе.
    0x7F2B, // Я с ними общаюсь и всё такое, так что не подумайте, что я от них закрываюсь.
    0x7FB2, // Просто не могу взять в толк, как мне относиться к их инвалидности? Совсем не обращать на это внимания было бы невежливо, а игнорировать – как-то странно.
    0x80C8, // В обоих случаях получится, что я веду себя неправильно.
    0x812D, // Учитель рассеянно чешет щёку.
    0x8164, // Не стоит делать из этого проблему, вот и всё. Она существует лишь у тебя в голове.
    0x81F7, // Ведь ты можешь нормально говорить с человеком независимо от того, слеп он или нет.
    0x828D, // Прекрати постоянно думать об инвалидности собеседника. Все здешние ученики – обычные дети, что бы тебе ни казалось на первый взгляд.
    0x8381, // Вчера Юко говорила мне то же самое.
    0x83C1, // Конечно, они правы, но не думать об этом слишком тяжело. Как можно игнорировать, например, глухоту Сидзунэ, если общаться с ней возможно только через Мишу?
    0x84DA, // Или Ханако… как посмотреть ей в лицо, не обратив внимания на шрамы?
    0x8555, // Но…
    0x855D, // Меня прерывает грохот распахнувшейся двери.
    0x85AF, // Учитель~!
    0x85C0, // Миша вламывается в кабинет, вскинув руку в бойком приветствии; её оглушительный возглас мог бы поднять мёртвых из могил.
    0x869D, // Она марширует к учительскому столу, размахивая руками в такт шагам.
    0x8719, // Муто, оторопевший от громозвучного Мишиного вторжения, откидывается на спинку стула.
    0x87B6, // Микадо.
    0x87C4, // Миша замирает, оглядываясь по сторонам: она явно не понимает, чем вызван его сердитый тон.
    0x8868, // Да~?
    0x886F, // Я уже неоднократно просил тебя убавить громкость.
    0x88CB, // Да~!
    0x88D2, // Ответ её не менее громогласный, нежели приветствие; Муто сдаётся и устало потирает глаза.
    0x8976, // Ну, так что ты хотела?
    0x899D, // Мне… нам нужна помощь! У нас кончились материалы для фестивальных стендов!
    0x8A27, // Это беда!
    0x8A38, // Она размахивает розовой полоской бумаги.
    0x8A84, // Ну так… принесите ещё из кабинета рисования. В чём проблема?
    0x8AF3, // Фанера! Вся проблема в фанере! В прошлый раз, когда нам понадобилось больше, её запасы там уже подходили к концу и мы просто взяли всю оставшуюся. Нам вроде бы хватило.
    0x8C22, // А теперь её там совсем не осталось. Вы случайно не знаете, где есть ещё?
    0x8CA3, // Нет. Случайно не знаю.
    0x8CCB, // Ситтян… то есть президент, сказала, что учитель сможет помочь. Она ошиблась?
    0x8D57, // Миша не замечает, что у Муто крайне страдальческий вид: будто он морщится всем своим существом.
    0x8E05, // На Муто больно смотреть. Словно ему сверлят череп, при этом включив на полную громкость поп-музыку.
    0x8EBA, // Увы, я не в курсе, есть ли в школе фанера вообще. И я понятия не имею, где она может лежать.
    0x8F5B, // Ох-ох-о-о… что же мне делать?
    0x8F8F, // Попробуй разыскать господина Номию: он должен знать.
    0x8FF0, // Он, правда, скорее умрёт, чем расстанется с ней… но это уже отдельный вопрос.
    0x907C, // А-а-а! Но я спешу! Мы слишком заняты!
    0x90BC, // Она хватается за голову и в отчаянии мечется взглядом из стороны в сторону, даже не замечая, что мнёт записку у себя в руках.
    0x919E, // У меня даже нет времени искать всё это! Мы выбиваемся из графика, у нас и так полно работы!
    0x9241, // Муто пристально смотрит на неё и вдруг улыбается. Лучше бы он этого не делал: улыбка ему совершенно не к лицу.
    0x9308, // Может, вам найти временного помощника?
    0x934F, // Он переводит на меня сосредоточенный взгляд, как бы говоря: «Ну же, ступай, заведи друзей».
    0x93F4, // Э… Думаю, я мог бы вам помочь.
    0x942A, // Правда? Спасибо, Хиттян, ты такой милый!
    0x9472, // Она вдруг озадаченно замирает, глядя так, будто только что заметила моё присутствие, и даже удивлённо вскрикивает, указывая на меня пальцем.
    0x9573, // А что Хиттян делает здесь в такое время? Ведь уроки кончились, пора гулять и веселиться~!
    0x9614, // У нас был небольшой разговор.
    0x964A, // Только не это! Тебя оставили после уроков? У тебя неприятности, Хиттян?
    0x96CB, // Нет, у меня всё в порядке.
    0x96F9, // Учитель, у Хиттяна неприятности?
    0x9735, // Ничего подобного.
    0x9756, // Муто тяжело вздыхает, и я понимаю, что сейчас самое время избавить его от назойливой Миши.
    0x97FA, // Итак, что вам нужно?
    0x981E, // Вот список. Если в кабинете рисования нет фанеры, я попробую поискать где-нибудь ещё.
    0x98B9, // Я неуверенно беру протянутую записку.
    0x98FF, // Я помогу вам, но это не значит, что я готов вступить в Совет, ясно?
    0x9975, // Ясно…
    0x9981, // Всё равно спасибо, Хиттян. Только побыстрей: мы строим киоски прямо сейчас – надо спешить-спешить-спешить!
    0x9A44, // Она вылетает за дверь, а мы с учителем смотрим друг на друга в молчаливом согласии.
    0x9ADB, // Радуйся, Накай, теперь тебе есть чем заняться.
    0x9B2F, // Пожалуйста, не так самодовольно.
    0x9B6B, // Мелким, аккуратным почерком, принадлежащим, без сомнения, Сидзунэ, на смятом листке написан перечень необходимых для фестиваля материалов, от краски до фанеры. Я тяжело вздыхаю.
    0x9CB0, // Тогда я пойду.
    0x9CCA, // Я машу списком учителю и выхожу в коридор.
    0x9D17, // Лилли и Ханако немедля принимаются за подготовку к ланчу.
    0x9D81, // Не успеваю я развязать свой узелок с едой, как Лилли достаёт термос и чайные пакетики, а Ханако раскладывает ланч.
    0x9E51, // Так вот зачем вы приходите сюда почти каждый день.
    0x9EAD, // Да, мы с Ханако обычно едим здесь. Для нас обеих это место – лучшее, что можно найти.
    0x9F45, // Учитывая то, как Ханако реагировала на мои попытки пообщаться последние пару дней, я понимаю, что она права. К тому же так Лилли удаётся урвать несколько минут тишины вдали от своего класса.
    0xA09F, // Я сажусь за стол последним, когда мой чай уже налит.
    0xA0FD, // Чем больше времени провожу я с ними, тем больше вижу в них полную противоположность Мише и Сидзунэ.
    0xA1B2, // Резкая и прямолинейная манера общения Сидзунэ заметна даже без голоса, а Миша может найти общий язык с кем угодно. В то время как Лилли являет собой воплощение мягкости и учтивости, а Ханако – самая застенчивая девочка из всех, кого я знаю.
    0xA367, // Как тебе живётся в «Ямаку», Хисао? Кажется, тебя что-то беспокоило.
    0xA3E0, // Я время от времени теряюсь, и на меня налетают в коридорах. В остальном всё не так уж и плохо…
    0xA48A, // Ты… ты очень плохо выглядел после столкновения. Ты точно… в порядке?
    0xA509, // На какой-то момент меня охватывает желание рассказать им о своей болезни, но я сдерживаюсь.
    0xA5B0, // Почему-то мне неловко говорить об этом малознакомым людям, пусть они и настолько дружелюбны.
    0xA65A, // Ерунда, просто опешил от неожиданности.
    0xA6A3, // Судя по выражению их лиц, они не верят мне. Но всё равно не настаивают. Должно быть, из уважения к моей частной жизни.
    0xA776, // Полагаю, это одно из местных негласных правил: «не спрашивай». Даже если проблема очевидна, как, например, у Ханако, всё равно есть рамки и история её возникновения находится за ними.
    0xA8C2, // У каждого есть что-то, о чём ему неудобно говорить, и, думаю, все здесь это понимают.
    0xA959, // Так, эм… вы давно здесь учитесь? Похоже, вы тут неплохо ориентируетесь.
    0xA9DB, // Хм… ну, я здесь с начала старшей школы, но переехала в общежитие только год назад.
    0xAA70, // Ханако тоже перевелась в начале старшей школы и сразу переехала в общежитие, если мне не изменяет память.
    0xAB31, // Верно. Со… старшей школы.
    0xAB60, // Тогда же вы и познакомились?
    0xAB94, // Именно. Ханако живёт в соседней комнате, так что это вполне естественно, правда?
    0xAC26, // П-правда.
    0xAC37, // Да, конечно.
    0xAC4D, // Соседство с кем-то, возможно, является уже достаточной причиной, чтобы подружиться, хотя думаю, что слепота Лилли тоже сыграла в этом не последнюю роль.
    0xAD62, // Не могу себе представить, чтобы Ханако легко подружилась с кем-то, кому пришлось бы нарочно отводить взгляд от её шрамов.
    0xAE3F, // Беседа иссякает, и мы принимаемся за ланч.
    0xAE8C, // Проходит немного времени, и звон колокола возвещает окончание перерыва. Девушки убирают свои ланчи так же быстро, как и доставали, и я следую их примеру.
    0xAFA3, // Думаю, мне пора идти. Ты пойдёшь с Хисао, Ханако?
    0xAFFA, // Ханако смотрит на меня, и несколько мгновений ясно видно, что она подумывает пропустить урок, просто чтобы не входить в класс вместе со мной.
    0xB0FB, // Д-да.
    0xB104, // Даже не знаю, что и думать. Ханако действительно очень легко задеть, если неправильно взглянуть на неё. От этого я тоже начинаю немного нервничать, но стараюсь отогнать это чувство, пытаясь вести себя как можно более естественно.
    0xB2A6, // Тогда нам надо торопиться. Судя по звонку, урок уже начался.
    0xB313, // Наклоняясь за тростью, Лилли кивает нам на прощание, и мы с Ханако выходим первыми.
    0xB3AA, // Мы быстро идём пустыми коридорами к нашим классам.
    0xB407, // Когда мы достигаем дверей класса 3-2, в котором учится Лилли, та поворачивается ко мне.
    0xB4A3, // Хисао, спасибо за то, что разделил с нами сегодня трапезу.
    0xB50C, // И тебе спасибо, Лилли.
    0xB534, // На этом наши пути расходятся; Лилли заходит в свой класс, оставив нас с Ханако, которая всё ещё выглядит так, будто хочет сбежать.
    0xB61F, // Ну что, ты уверена, что хочешь пойти на урок?
    0xB66F, // Тогда ладно.
    0xB686, // Мне хочется сказать ей что-нибудь ещё, но сложно придумать что-то уместное, да к тому и безопасное.
    0xB739, // И Лилли была права: чем дольше мы будем мешкать, тем больше потом придётся объяснять.
    0xB7D4, // Я открываю заднюю дверь класса и вхожу.
    0xB81C, // Учитель смотрит на меня и открывает рот, чтобы что-то сказать.
    0xB88D, // Но, когда за мной входит Ханако, он просто кивает нам и продолжает урок.
    0xB90F, // Вот уже в третий раз опоздание Ханако игнорируется. Определённо, этому должно быть какое-то объяснение.
    0xB9CD, // Мы идём к своим местам, и я замечаю, что Миша и Сидзунэ тоже отсутствуют.
    0xBA50, // Интересно, это какое-то неофициальное соглашение с персоналом или своего рода прерогатива для особых учеников этой школы?
    0xBB31, // Стараясь не шуметь, я достаю из портфеля нужный учебник и начинаю нагонять остальных.
    0xBBCE, // Урок проходит спокойно.
    0xBBFA, // Мы втроём покидаем класс.
    0xBC29, // Лилли идёт вдоль стены, легонько постукивая по ней тростью, Ханако держится рядом, буквально обнимая её.
    0xBCE8, // Похоже, что Лилли намного труднее перемещаться подобным образом, но, несмотря на это, она вовсе не возражает.
    0xBDAF, // Как только мы сворачиваем за угол, удар в грудь с силой несущегося на полной скорости поезда едва не сбивает меня с ног. Ханако сдавленно вскрикивает от неожиданности. У меня в глазах начинает темнеть.
    0xBF1E, // Хисао, что случилось?
    0xBF45, // Конечно, Лилли не в курсе происходящего, но её голос звучит крайне взволнованно. Хотя в этой ситуации такое волнение излишне.
    0xC02A, // Кое-кто в меня врезался, но вроде ничего серьёзного. Всего лишь небольшой ушиб.
    0xC0BA, // Э… извини, я нечаянно. Мне просто надо было срочно забрать кое-что, и я очень торопилась.
    0xC15B, // Этот «кое-кто» – Эми, не так ли?
    0xC194, // Маленькая девочка смущённо кашляет и шаркает «ногами», сделанными из какого-то металла или пластика, опуская на них взгляд, прежде чем что-либо ответить.
    0xC2AD, // …Привет, Лилли. Привет, Ханако.
    0xC2E6, // Похоже, они знакомы.
    0xC30B, // Пожалуйста, будь осторожнее. Ты достаточно крепкая, чтобы спокойно перенести такого рода происшествия, но в школе есть ученики, которые от подобного могут пострадать.
    0xC43D, // Девочка краснеет со стыда и начинает мяться на месте, как ребёнок, которого отчитывают за плохое поведение.
    0xC502, // А-а-а! Мне надо спешить!
    0xC52C, // Не успеваем мы и слова произнести, как Эми срывается с места и бежит дальше по коридору, который без неё становится гораздо тише.
    0xC617, // И часто здесь такое случается?
    0xC64F, // Насчёт бега по коридорам в «Ямаку» особенно строгие правила.
    0xC6BF, // …но, похоже, это редко останавливает Эми.
    0xC70B, // Она качает головой и сдержанно улыбается.
    0xC758, // Боюсь, не в наших силах как-то повлиять на неё. Что ж, пойдёмте.
    0xC7C9, // Лилли отправляется дальше по коридору, и Ханако, спохватившись, следует за ней.
    0xC85A, // Я легко восстанавливаю в памяти дорогу в комнату, которую эти двое используют для чаепитий, поскольку был там только вчера.
    0xC93C, // Этим утром я чувствую себя сильно утомлённым, возможно из-за того, что вчерашний день был столь утомительным. Кроме того, я сегодня проснулся раньше времени.
    0xCA5B, // Я поспешно здороваюсь с Сидзунэ и Мишей и принимаюсь решать задания с доски. Кажется, над примерами сегодня придётся попотеть.
    0xCB43, // Но я не возражаю. Сидзунэ и Миша могут начать требовать от меня ответа по поводу вступления в Школьный совет, хоть и прошёл всего день.
    0xCC38, // С них ведь станется. А ответить я пока не смогу, поэтому нынешняя ситуация вполне меня устраивает.
    0xCCEB, // Минут через десять после начала урока входит Ханако и молча занимает своё место. Никто не смотрит на неё, даже учитель не обращает внимания на её опоздание.
    0xCE08, // Он объявляет, что мы снова делимся на группы.
    0xCE5A, // Повернувшись, я вижу, что Сидзунэ и Миша смотрят на меня. Сидзунэ мило, но в то же время угрожающе улыбается мне, как бы говоря: «Вот ты и попался. Теперь не уйдёшь».
    0xCF82, // Хиттян~, выходит, мы снова вместе! Ур-ра~!
    0xCFCB, // Миша поворачивается ко мне, а Сидзунэ тем временем передвигает свою парту поближе к моей. Действительно, сбежать теперь можно лишь прыгнув в окно.
    0xD0D7, // Увы, это неприемлемый вариант.
    0xD10F, // А! Хиттян, ты уже решил по поводу вчерашнего? Ты ведь обещал подумать о вступлении в Школьный совет.
    0xD1C4, // Всё в порядке, Хиттян. Вчера мы с Ситтян решили, что было бы невежливо требовать от тебя ответа так скоро, верно? Верно~!
    0xD29C, // Ха-ха-ха-ха-ха-ха~!
    0xD2BC, // Очень рад, что вы нашли новую мишень для своих шуток. И ещё больше – тому, что вам известно, насколько настырными вы можете быть.
    0xD3A5, // Вновь переключившись в «серьёзный режим», Сидзунэ демонстративно хлопает по учебнику тыльной стороной ладони.
    0xD472, // Я пробегаю глазами по заданию: нам предстоит в основном чтение, собственно задачек там всего две.
    0xD524, // Меня так и подмывает высказать что-нибудь относительно того, насколько излишня её спешка, учитывая объём работы. Правда, Сидзунэ, видимо, известно, насколько он мал, но её это попросту не волнует.
    0xD688, // Похоже, её волнует не столько количество, сколько сам факт наличия работы. Она ко всему приступает с одинаковым рвением.
    0xD764, // Отвлекаясь от чтения, я натыкаюсь взглядом на Ханако. Она решает задачи. Судя по всему, в одиночку.
    0xD817, // Не припоминаю, чтобы она хоть раз работала с кем-нибудь.
    0xD87D, // Неудивительно, учитывая, насколько она застенчива.
    0xD8DB, // Эй, а вон та девушка…
    0xD902, // А? Кто, Хиттян?
    0xD91C, // Вон та. Ханако. Она всегда работает одна?
    0xD966, // Думаю, да, Хиттян. Тебе её из-за этого жалко?
    0xD9B5, // Я просто подумал, не могла бы она поработать с нами, например?
    0xDA25, // М-м-м-м… Нет, не думаю, что это хорошая идея, Хиттян.
    0xDA82, // Почему же?
    0xDA95, // Ситтян с ней не поладит.
    0xDAC1, // Почему?
    0xDACF, // Миша уходит от ответа, издав странный смешок: нервный, но всё с той же обычной для неё скачущей интонацией.
    0xDB91, // По кочану, Хиттян.
    0xDBB2, // В этот момент Сидзунэ отвлекается на наш разговор; я только сейчас замечаю, что всё это время Миша беспрестанно жестикулировала.
    0xDC9E, // Что, Ситтян? «Друг моего врага – мой враг»? Звучит слишком резко, я не буду этого говорить.
    0xDD42, // Ты это уже сказала.
    0xDD65, // Знаю, Хиттян, это ничего, что ты подслушал~!
    0xDDB3, // Видимо, так Миша обеспечивает справедливость в общении, ведь без неё я бы ни за что не понял, что хочет сказать Сидзунэ. И наоборот.
    0xDEA1, // Выходит, ещё одна причина, по которой Миша постоянно жестикулирует, – она хочет, чтобы Сидзунэ была в курсе всех разговоров, идущих вокруг неё.
    0xDFA6, // Как бы то ни было, пора решать задачи, Хиттян.
    0xDFF8, // Мы заканчиваем раньше времени, и я решаю спросить, есть ли поблизости местечко с меню поаппетитнее, чем в нашей столовой.
    0xE0D5, // На что Сидзунэ и Миша принимаются спорить о том, какой из местных ресторанов лучше. Все они находятся в городе, и мы вряд ли успеем сходить туда до начала следующего урока. И потом там наверняка дорого.
    0xE243, // Или они спорят ради удовольствия?
    0xE281, // Они настолько увлечены, что не замечают начала большой перемены.
    0xE2F8, // Я смотрю в конец класса через плечо.
    0xE33A, // …Похоже, она пересматривает свои конспекты с прошлого урока.
    0xE3AB, // Странное зрелище, на фоне того, как остальные заняты перерывом на ланч.
    0xE42D, // Болтают, сплетничают, сдвигают парты. Те, у кого еда была с собой, общаются с остальными, иногда прерываясь, чтобы отправить в рот очередную порцию.
    0xE539, // По мере наблюдения за Ханако начинает казаться, что я единственный, кто её замечает. Как будто она невидима для остальных; будто прячется у всех на виду.
    0xE64F, // Над ней издеваются? Или она отгородилась ото всех по собственному желанию?
    0xE6D8, // Я замечаю, как она смотрит через плечо на заднюю дверь класса.
    0xE749, // И она не перелистывает страницу с тех пор, как я начал за ней наблюдать.
    0xE7CB, // Думаю, она ждёт кого-то.
    0xE7F6, // По соседству с нашим кабинетом располагаются классы 3-1 и 3-2 по правой стороне и 3-4 – по левой, и все двери выглядят совершенно одинаково.
    0xE8EE, // Дальше по коридору с одинаковыми дверьми находятся кабинеты, для проведения уроков, как я считал, не используемые.
    0xE9C0, // Наверное, кабинет кружка рисования – один из них.
    0xEA1B, // Я аккуратно открываю последнюю в коридоре дверь и заглядываю внутрь.
    0xEA9A, // За ней оказывается классная комната, но либо неубранная, либо вообще неиспользуемая. Я не ошибся дверью?
    0xEB59, // Парты и стулья, покрытые тонким слоем пыли, в беспорядке расставлены по комнате. В углу стоит несколько мольбертов – похоже, я не ошибся.
    0xEC53, // Комната залита светом из огромных окон, на партах лежат тени.
    0xECC3, // Облачка пыли танцуют в недвижимом воздухе, делая солнечные лучи почти осязаемыми.
    0xED5A, // Ради смеха я обращаюсь к пустой комнате.
    0xEDA4, // Есть кто до—{w=.5}{nw}
    0xEDC6, // Заметив что-то краем глаза, я останавливаюсь на середине фразы.
    0xEE3A, // На парте сидит коротко стриженая девушка; к моему удивлению, она одета в мужскую школьную форму и держит пальцами ног вилку, на которую нанизан кусочек еды.
    0xEF57, // Такой необычный способ принятия пищи вызван очевидным отсутствием у неё рук, но ещё больше меня ошеломляет само её присутствие здесь.
    0xF04D, // Как же я её раньше не заметил? Она сидит в углу неподвижно и на первый взгляд кажется предметом обстановки или статуей.
    0xF126, // Я сегодня совсем невнимательный.
    0xF163, // Девушка застыла на месте, уставившись на меня огромными зелёными глазами, как кролик в свете фар.
    0xF215, // Её вилка так и замерла у открытого рта.
    0xF25C, // Я смотрю на неё, разинув рот, внезапно вспомнив, что остановился на полуслове, и пытаясь решить, стоит ли заканчивать фразу.
    0xF33D, // Мы застыли в тишине, нарушаемой лишь ритмичным тиканьем настенных часов.
    0xF3C3, // Привет.
    0xF3D1, // Девушка отправляет вилку в рот и выжидательно на меня смотрит, пережёвывая еду. Я чувствую себя неловко.
    0xF490, // М-м… привет. Меня попросили забрать отсюда кое-что. Для фестивальных киосков, в смысле. Я не думал, что тут кто-то есть.
    0xF567, // Никого нет. Именно поэтому я тоже сюда пришла.
    0xF5BB, // Она накалывает на вилку следующую порцию.
    0xF608, // Тогда разве это не значит, что здесь есть ты?
    0xF659, // Она приподнимает брови, как бы сомневаясь в верности моего замечания.
    0xF6D9, // А ты наблюдательный. Полагаю, что так. А ты кто?
    0xF72E, // Прямолинейная девушка, не правда ли?
    0xF771, // Меня зовут Накай, Хисао Накай. Я только в понедельник перевёлся.
    0xF7E6, // А меня – Рин. Тэдзука Рин. Рин Тэдзука.
    0xF82C, // Руку я тебе не пожму, но теперь мы хотя бы знаем, кто есть кто.
    0xF89B, // Это здорово.
    0xF8B2, // По её серьёзной манере разговора трудно определить, шутит ли она насчёт рукопожатия.
    0xF94E, // Шутки на эту тему кажутся совсем неуместными, и это меня беспокоит.
    0xF9C9, // Пока я пытаюсь выяснить, что уместно, а что нет, девушка теряет ко мне интерес и переводит голодный взгляд на еду.
    0xFA97, // Могу я продолжать ланч? Если ты не против моего присутствия, я не против твоего.
    0xFB28, // Если тебе нужно что-то взять, то всё хранится в конце класса.
    0xFB96, // Конечно, продолжай. Но… ланч? Учебный день уже кончился.
    0xFBFD, // Тогда как бы ты это назвал? Нет специального слова для приёма пищи между ланчем и обедом, ведь так? Меня это тоже беспокоит, но я не знаю, какое слово подобрать.
    0xFD1E, // Не думаю, что между ланчем и обедом следует что-то есть.
    0xFD83, // Но я голодная, и иначе мою восхитительную еду пришлось бы выбросить.
    0xFE00, // У меня тут карри. Очень вкусное.
    0xFE3A, // Решительным движением Рин снова поднимает зажатую между пальцами ноги вилку и по меньшей мере неучтиво указывает ею прямо на меня.
    0xFF2B, // Так что, Накай, какими судьбами ты здесь оказался?
    0xFF86, // Как я уже сказал, мне поручили поискать некоторые вещи.
    0xFFEB, // Нет, в школе. Судя по внешнему виду, ты вроде здоров. Проблема где-то внутри?
    0x10074, // Я в полном замешательстве, не могу из себя ничего выдавить.
    0x100E0, // Я…
    0x100E6, // Попробую угадать. Я хорошо угадываю. Лучше, чем большинство людей.
    0x1015F, // Рин обрывает меня на полуслове прежде, чем я успеваю ответить на вопрос или как-то его обойти. Не знаю, что бы я выбрал.
    0x10236, // Я снова оказываюсь перед этой проблемой. Я ещё никому не рассказывал здесь о своём недуге. Впрочем, возможно, лишь потому, что об этом никто не спрашивал.
    0x1034D, // У меня сложилось впечатление, что игнорирование таких вопросов – часть здешних общественных норм, как сказал учитель.
    0x10427, // Интересно, могут ли люди здесь найти общий язык? Наверное, не легче, чем обычные люди.
    0x104C2, // Я не могу понять условия, в которых находятся Сидзунэ или Лилли.
    0x10537, // Разумеется, пока я об этом размышляю, Рин с глубокомысленным выражением лица продолжает обдумывать, что со мной не так.
    0x10611, // Она помещает вилку в рот и откидывается назад, устремив взгляд в потолок, как если бы там был написан ответ.
    0x106D5, // Луч света из окна освещает её лицо, создавая на другой его половине маску тени.
    0x10765, // Вряд ли дело в твоей голове, а какая-нибудь кишечная проблема была бы банально-скучной, как мой обед. Да вдобавок пресной.
    0x10842, // Должно быть, проблема у тебя в штанах!
    0x10887, // Такое утверждение в духе пьяного Шерлока Холмса, а также полное отсутствие такта, с которым это произносится, застаёт меня врасплох.
    0x1097A, // Наверное, я неосознанно отшатываюсь, потому что глаза Рин расширяются от изумления и восторга.
    0x10A28, // Так, значит, я права! У тебя что-то не в порядке с причиндалами?
    0x10A99, // Всё ещё в шоке, но осознавая необходимость как-то отреагировать, я выдаю первое, что приходит в голову.
    0x10B54, // Нет! Ничего подобного! У меня проблемы с сердцем. Аритмия.
    0x10BBD, // Я произнёс это. Скорее, конечно, выпалил, но всё же сказал вслух.
    0x10C31, // Девушка кривит губки и сердито на меня смотрит, будучи явно очень расстроенной.
    0x10CC3, // Как скучно. Проблема в штанах была бы куда более позорной.
    0x10D2D, // Что это за реакция?
    0x10D50, // Извини, что подвёл.
    0x10D73, // Я тебя прощаю. Просто я коллекционирую людей, и иметь человека с… ну, знаешь, такой проблемой было бы очень здорово.
    0x10E46, // Коллекционируешь людей?
    0x10E73, // Людей с разными проблемами.
    0x10EA6, // Ты что, просто… ходишь и спрашиваешь у всех, что с ними не так?
    0x10F17, // Именно.
    0x10F25, // Понятно.
    0x10F35, // Разговор затухает, и Рин возобновляет приём пищи, а я продолжаю думать над тем, что она сказала.
    0x10FE3, // Я впервые поведал кому-то о своём недуге. Все остальные либо уже знали, либо слышали о нём от кого-то ещё.
    0x110A1, // Или же им до настоящего момента необязательно было знать об этом, как и всем прочим ученикам этой школы.
    0x1115F, // Мне следует упоминать его при знакомстве? От меня этого ожидают?
    0x111D5, // «Привет, меня зовут Хисао. У меня серьёзные проблемы с сердцем».
    0x1124A, // Так мне теперь представляться людям?
    0x1128E, // Как будто наши болезни характеризуют нас. Что за мерзкая идея?
    0x11300, // Или, может быть, у этой Тедзуки просто странный интерес к подобным вещам?
    0x11385, // Пока я иду в конец кабинета за вещами из Мишиного списка, мне представляется шанс краем глаза понаблюдать за Рин.
    0x11454, // У неё светло-каштановые, почти рыжие, коротко стриженые волосы. Без рук с длинными волосами было бы, наверное, трудно управиться.
    0x1153F, // Из-за мужской школьной формы и отсутствия рук она выглядит очень худой, почти тощей.
    0x115D9, // Она ничем особо не привлекательна, разве что тёмно-зелёными глазами, которыми беспрестанно моргает из-под короткой чёлки, даже когда ест.
    0x116D5, // Из-за теней и расстояния создаётся ощущение, что они вообще не отражают свет, а, наоборот, поглощают его полностью, как глубокие колодцы.
    0x117CE, // Движения её ног так же ловки, как и движения рук обычных людей.
    0x11840, // Однако, когда смотришь на это, может стать не по себе, особенно когда ногами едят. Во всяком случае, я себя чувствую немного неловко.
    0x11930, // Я стараюсь не думать о слове «неестественный», но уже поздно, да?
    0x119A6, // Я продолжаю шарить по ящикам и полкам, но со временем молчание становится слишком неудобным, поэтому я пробую разговорить эту странную девушку.
    0x11AAE, // Ты всегда ешь одна и так поздно? Или заходят случайные посетители?
    0x11B27, // Посетители… Наверное, ты – мой первый случайный посетитель. Но я не всегда ем одна.
    0x11BC0, // Иногда я ем с определённым человеком на крыше, если она не носится где-нибудь.
    0x11C4E, // Носится?
    0x11C5E, // Она увлекается спортом.
    0x11C8A, // А…
    0x11C90, // Это всё, что приходит мне в голову в качестве ответа.
    0x11CF0, // Мы снова погружаемся в молчание, пока Рин доедает остатки своей еды.
    0x11D6D, // Я смотрю на свою поклажу, сверяясь с Мишиным списком. Похоже, я достал всё, за исключением фанеры.
    0x11E1E, // Эм-м… ну, думаю, я всё нашёл.
    0x11E51, // Молодец. Можешь идти, я не возражаю. Я всё равно собиралась вздремнуть.
    0x11ED2, // Тебе ведь нужно делать с этими вещами то, что собирался?
    0x11F38, // Или, может быть, тебе нравится наблюдать за спящими девушками?
    0x11FAA, // Э…
    0x11FB0, // Я не уверен, как это следует понимать, но Рин выглядит серьёзной.
    0x12026, // Даже если бы и нравилось, полагаю, что мне пора.
    0x1207C, // Ещё… Ещё увидимся, Тэдзука.
    0x120AF, // Можешь звать меня Рин.
    0x120D8, // Думаю, на данном этапе наших отношений я могу тебе такое позволить.
    0x12153, // Я собираюсь уйти, но поддаюсь внезапно нахлынувшему на меня желанию сказать что-то ещё.
    0x121F3, // Хорошо, тогда я – Хисао.
    0x1221F, // Тогда да.
    0x12230, // Рин смотрит на меня прямо в упор, но угрожающего чувства, которое обычно бывает в такой ситуации, не возникает.
    0x122FA, // Будто она на меня и вовсе не смотрит.
    0x1233D, // Она пару раз моргает, и я не могу понять, почему внезапно между нами повисла пауза.
    0x123D3, // До встречи, Хисао.
    0x123F4, // Кажется, на её лице мелькает тень улыбки.
    0x1243F, // Я тихо пячусь вон из комнаты. Закрыв перед лицом дверь, я шепчу:
    0x124B2, // Какая загадочная девушка…
    0x124E4, // Из класса приглушённо, нараспев слышится:
    0x12531, // А я слы~ша~ла!
    0x12549, // Что она слышала?
    0x12567, // Я вздрагиваю от неожиданного появления Миши, чьего приближения я не услышал, несмотря на тишину, царившую в коридоре.
    0x1263E, // Каким-то образом она подобралась ко мне на расстояние прыжка, не издав ни звука. У меня от этого мурашки по коже бегут. На мгновение я вспоминаю про сумасбродную теорию Кендзи о всемирном тайном обществе феминисток, но тут же отбрасываю эту мысль подальше.
    0x12811, // Сидзунэ, стоящая чуть поодаль от Миши, выглядит озадаченной, поскольку не могла услышать замечания, привлёкшего внимание Миши, но Миша явно возбуждена.
    0x12927, // Нет, постой, а кто там? Сегодня в кружке нет занятий.
    0x12985, // Она пытается с любопытством выглянуть из-за меня, несмотря на то что закрытая дверь всё равно не даст ей ничего увидеть.
    0x12A60, // Что вы здесь делаете?
    0x12A87, // Тебя так долго не было, что нам пришлось прийти и проверить, что стряслось. Нехорошо, Хиттян~
    0x12B2F, // Она грозит мне пальцем.
    0x12B5A, // Я нашла фанеру, но остального до сих пор не хватает, потому что ты – копуша.
    0x12BE3, // А, прости. Э… я всё нашёл, как раз собирался принести.
    0x12C44, // Думаю, ты нас малость подвёл, Хиттян~! Интересно, кто это там с тобой был…
    0x12CC9, // Миша что-то быстро говорит Сидзунэ, пару раз указав на своё ухо.
    0x12D3D, // Сидзунэ тут же протискивается мимо меня к двери и открывает её.
    0x12DB1, // Могу только представить тот шок, который она сейчас испытает.
    0x12E22, // С её трудолюбием и жизненными принципами ей не под силу вынести дерзость, с которой некто осмелился надругаться над школьным имуществом, используя его в качестве поверхности для сна.
    0x12F72, // И действительно, она смотрит на Рин, застыв на месте, и только её плечи едва заметно дрожат, как мне кажется из-за подавляемой ярости.
    0x13064, // Вместо того чтобы взорваться, Сидзунэ, сделав несколько глубоких вдохов, поправив очки и с шумом захлопнув дверь, принимается неистово жестикулировать Мише.
    0x13185, // Может быть, она и взорвалась, только я этого не понял.
    0x131E6, // На меня она тоже бросает тяжёлый взгляд, как будто я был каким-то образом виноват в том, что Рин спит на одном из столов.
    0x132BF, // Надеюсь, у неё не возникло никаких сомнительных идей насчёт причин моей задержки.
    0x13355, // Эй.
    0x1335B, // Голос Рин доносится из-за закрытой двери, и через пару мгновений я понимаю, что для неё может быть проблематично открыть её.
    0x1343D, // Я открываю дверь. Рин стоит в проходе и полузаинтересованно-полусонно глядит на нас.
    0x134D8, // Мисс Тэдзука, что это вы вытворяете? У вас нет абсолютно никакого права использовать школьное имущество для таких… э… постыдных?.. занятий!
    0x135D8, // Как внезапно народу-то прибыло. Не знала, что я так популярна.
    0x13648, // Сложно сказать, довольна она таким поворотом событий или нет.
    0x136B9, // Во всяком случае, она игнорирует выговор Сидзунэ/Миши, так что им ничего не остаётся, кроме как оставить эту тему.
    0x13788, // Сидзунэ стучит Мишу по плечу, указывает на Рин и делает несколько быстрых жестов.
    0x1381D, // Неважно, насколько вы популярны, пожалуйста, больше так не делайте.
    0x13898, // Кстати, как продвигается ваш проект? К фестивалю всё будет готово?
    0x13911, // Невзирая на давление, оказываемое ледяным взглядом Сидзунэ, Рин смотрит на них вполне непринуждённо и вообще безучастно.
    0x139F0, // Я тоже постоянно об этом размышляю.
    0x13A31, // И?
    0x13A35, // Задумаюсь над этим серьёзнее.
    0x13A6C, // Когда Сидзунэ получает ответ Рин от Миши, она неудовлетворённо хмурится.
    0x13AF2, // Мисс Тэдзука, пожалуйста, попытайтесь подойти к этому ответственнее. Будет катастрофой, если стена будет выглядеть так, будто кого-то стошнило на неё обедом.
    0x13C12, // Рин утвердительно кивает.
    0x13C42, // Обязательно задумаюсь серьёзнее.
    0x13C80, // Миша в ответ хихикает, но на лице Сидзунэ не появляется и намёка на улыбку даже после перевода.
    0x13D2D, // Она только качает головой, забирает у меня материалы и в сопровождении Миши уходит.
    0x13DC6, // Рин задумчиво хмурится, наблюдая за удаляющимся дуэтом Школьного совета.
    0x13E4D, // Как грубо.
    0x13E60, // Однако это правда. Мне надо закончить проект до выходных. Если не закончу, последствия будут печальными.
    0x13F1F, // Конец того мира, который мы знаем.{w} Как конец недели, только ещё печальнее.
    0x13FA8, // Гора-аздо печальнее.
    0x13FCE, // Наверное, отложу свой сон. На необозримое будущее.
    0x1402A, // Я уже собираюсь спросить, над каким проектом она работает и что за апокалиптические последствия, но она уходит обратно в кабинет.
    0x14117, // Не мог бы ты мне помочь, раз ничем не занят?
    0x14165, // Банка с краской не влезает в мою сумку, но она мне нужна.
    0x141CB, // Она легонько пинает огромную банку краски, стоящую на полу рядом со столом, на котором она сидела и спала.
    0x1428C, // Та в ответ издаёт глухой звон.
    0x142C3, // Будучи джентльменом, я, естественно, поднимаю её.
    0x1431D, // Тяжёлая.
    0x1432D, // Да, конечно. Куда её нужно отнести?
    0x1436C, // В другое место.
    0x14388, // С этими словами она выходит в коридор, и мы с банкой следуем за ней, поскольку особого выбора у нас нет.
    0x14443, // Теперь, когда Сидзунэ и Миша ушли, коридор тих и пуст, и мы тоже направляемся к лестнице на другом его конце.
    0x14507, // Каждые десять, или пятнадцать, или двадцать шагов мне приходится перекладывать банку из одной руки в другую, потому что её тонкая ручка врезается мне в ладонь. Ну, хоть руки благодаря этому меньше устают.
    0x1467B, // Рин идёт передо мной неровной походкой, под которую трудно подстроиться, или, может быть, это я иду странно из-за лишнего веса.
    0x14761, // Кажется, что кто-то из нас постоянно идёт то ли слишком медленно, то ли слишком быстро, и я не могу понять, кто именно.
    0x14835, // Через два лестничных пролёта появляется проблема в виде фельдшера с его лисьей ухмылкой.
    0x148D9, // О, Накай, какое совпадение! И Тэдзука, конечно.
    0x1492D, // Он любезно кивает Рин, которая не отвечает на его приветствие, и поворачивается ко мне, потому что явно хочет поговорить именно со мной.
    0x14A25, // Я кое-что забыл упомянуть в понедельник.
    0x14A6F, // Я киваю и невозмутимо жду, потому что мне и в голову не приходит, чего бы он мог там забыть. Однако врезающаяся всё глубже в кожу ручка также не добавляет мне энтузиазма.
    0x14BA2, // Насчёт твоих лекарств. Поскольку ты перешёл на них не так давно, могут быть неожиданные побочные эффекты, в зависимости от которых нужно будет подкорректировать дозы или даже сменить лекарство.
    0x14D06, // Я буду регулярно брать у тебя анализы, но хочу, чтобы ты сообщал мне об отклонениях в своём состоянии, – если ты понимаешь, о чём я.
    0x14DF3, // Тошнота, головная боль – что угодно. Приходи на приём, если что-нибудь случится.
    0x14E85, // Так как дела? Всё в порядке?
    0x14EB7, // Я сдаюсь и опускаю банку на пол, прежде чем ответить. Видимо, это займёт больше времени, чем могут выдержать мои бицепсы.
    0x14F92, // Я собираюсь ответить общей фразой, но осознаю, как часто я это делал в последнее время.
    0x15030, // Другие люди у меня тоже об этом спрашивали. Учителя и ученики. Мои родители, посетители, медсёстры и врачи в больнице.
    0x15106, // Все кажутся обеспокоенными этим вопросом. Это естественно для больницы, но для школы – не очень.{w} Но эта школа – исключение.
    0x151EB, // Она невелика, и отношения между учениками и преподавателями здесь очень близкие.
    0x15280, // Во всяком случае такое у меня чувство.
    0x152C6, // И в такую школу ученики переводятся нечасто.
    0x15318, // От этой мысли у меня бегут по спине мурашки, но я всё равно даю стандартный ответ.
    0x153AC, // Это замечательно. И ещё кое-что.
    0x153E6, // Мои источники сообщили, что ты не был ни на школьном стадионе, ни в бассейне, так что хочу поинтересоваться: выполняешь ли ты упражнения, которые я рекомендовал?
    0x1550B, // Конечно нет, но такая постановка вопроса вызывает ощущение, что я должен был с самого первого дня прямо-таки надрываться на беговых дорожках.
    0x1560E, // У вас есть люди, которые шпионят за мной?
    0x15658, // Не совсем. Просто я со многими знаком. Но у нас другая тема разговора, не пытайся от неё увильнуть.
    0x1570A, // Ну, я вот как раз выполнял импровизированные упражнения – подъём тяжестей.
    0x15794, // Я несколько раз поднимаю и опускаю банку, изображая жалкую пародию на культуриста, хоть ручка и врезается болезненно мне в ладонь.
    0x15883, // Глупая ухмылка на секунду исчезает с его лица, а потом, как ни в чём не бывало, возвращается на место.
    0x1593A, // Тэдзука, позволь, мы с ним наедине поговорим?
    0x1598C, // Фельдшер хватает меня за плечо и, не дожидаясь разрешения Рин, в котором он и не нуждается, тащит меня в сторону.
    0x15A58, // Когда я говорил тебе про упражнения, я не шутил.
    0x15AAF, // Я понимаю, что это только твоя первая неделя, но, пожалуйста, не умаляй их значимости.
    0x15B4A, // Привычки трудно сформировать, поэтому я так настойчиво этого от тебя требую.
    0x15BD7, // Чем больше ты будешь увиливать и откладывать, тем труднее потом придётся. И так со всем, например с диетой.
    0x15C99, // Он окидывает меня изучающим взглядом, а затем пожимает плечами, снова улыбаясь.
    0x15D2B, // Хорошо. Вот так-то лучше.
    0x15D58, // Если ты завтра с утра придёшь на стадион, то встретишься с моим «шпионом», который наверняка не откажет тебе в консультации, если ты захочешь немного побегать.
    0x15E7B, // Консультации?
    0x15E95, // Ещё увидимся.
    0x15EAE, // Он уходит без ответа, помахав рукой, а я подхожу к Рин, которая ждёт, праздно оперевшись о стену коридора и разглядывая тусклые светильники на потолке.
    0x15FC1, // Даже когда я подхожу, она не отводит от них взгляда.
    0x1601F, // Ты принимаешь лекарства от своей сердечной болячки?
    0x1607F, // Ты подслушивала?
    0x1609E, // Мой тон более обвиняющий, чем я планировал, будто я на неё ругаюсь.
    0x16117, // Но, даже пускай и так, я не хочу об этом говорить. Я только что её встретил и не знаю её. Это не её дело.
    0x161CE, // Фельдшер, похоже, тоже не знаком с понятием врачебной тайны, раз говорит о таких вещах на людях.
    0x1627C, // Но Рин ведь в этом не виновата.
    0x162B4, // Я гляжу на неё, внезапно почувствовав укол вины, но Рин лишь задумчиво смотрит куда-то через моё плечо, по-птичьи наклонив голову.
    0x163A0, // Эх.
    0x163A6, // Не знаю, почему для меня это так сложно. Такое чувство, что у меня в голове есть какой-то непонятный сдерживающий механизм, который не позволяет мне говорить об этом более откровенно.
    0x164F3, // …Да. Они для моего сердца.
    0x16523, // Тебе от них лучше?
    0x16544, // …Нет, не особо.
    0x16560, // Просто чуть менее плохо.
    0x1658D, // Рин смотрит на меня ещё немного, ничего не говоря и без каких-либо различимых эмоций.
    0x16628, // Я благодарен ей за это. Кажется, я ещё не вполне привык к переменам в моей жизни.
    0x166B9, // В больнице с этим было проще, но я ещё не разобрался, как жить «нормальной» жизнью со своим недугом.
    0x1676E, // Мы выходим из главного здания, Рин ведёт меня в сторону общежитий.
    0x167E7, // Мы останавливаемся у небольшого клочка зелени перед зданием общежития.
    0x1686B, // Оно построено на небольшом возвышении, окружено стеной и несколькими деревьями, которые всем каждый раз приходится обходить. Это, наверное, единственный просчёт в планировке школы.
    0x169B8, // Вся стена, сложенная из таких же кирпичей, что и само здание, покрыта своего рода картиной.
    0x16A5D, // Большая её часть – не более, чем набросок – быстрые мазки, сделанные чёрной и белой красками по серой штукатурке, покрывающей практически всю длину стены, – но некоторые места выглядят более законченными.
    0x16BD6, // Тут лица людей, ноги и руки. Однако я не могу с уверенностью сказать, что именно изображает картина в целом.
    0x16C99, // Стопки чего-то, напоминающего банки с красками, штабелями располагаются на земле вдоль стены.
    0x16D45, // Видишь, работа над левой частью едва сдвинулась.
    0x16D9E, // Всё потому, что вчера у меня не было настроения и я сдалась, а взамен пошла медитировать. И тут внезапно настало утро.
    0x16E73, // Надо бы мне над ней поработать, но ребята из кружка рисования помогают с фонами и основными поверхностями лишь от случая к случаю – вот в чём проблема.
    0x16F87, // Легче рисовать большие участки, когда много народу, с руками.
    0x16FF7, // Им проще дотянуться до верха, и дело идёт быстрее.
    0x17052, // Совсем отходя от прежней темы, она машет рукой… ну, или той её частью, которая у неё есть, чтобы наглядно продемонстрировать, хотя я и так уже всё понял.
    0x17166, // Её белый рукав развевается, и мне приходит в голову мысль, что зрелище могло выйти печальнее, чем получилось.
    0x1722D, // Но всё же это заставляет меня чувствовать себя не в своей тарелке, как и практически любое напоминание об… особенностях учеников «Ямаку», которые я получал в течение последних нескольких дней.
    0x17390, // Девушка, конечно, не замечает моих мрачных чувств, как и того, что я перестал её слушать… и продолжает болтать.
    0x1745A, // …и поэтому я пытаюсь выяснить, есть ли что-то, что нужно выяснять, и выяснить это прежде, чем будет слишком поздно и всякая надежда будет потеряна.
    0x17565, // А почему надежда может потеряться?
    0x175A5, // Потому что краску надо нанести, потом она должна высохнуть, а потом быть закрашена слоем другой краски.
    0x17662, // На это нужно время.
    0x17685, // Она наконец останавливается, по-видимому думая, что пришла к какому-то логическому заключению.
    0x17733, // Полагаю, лучше начать сначала.
    0x1776B, // Так, значит, это твой проект? Ты сделала… это?
    0x177BE, // Да. Да.
    0x177CA, // Всё целиком?
    0x177E1, // Да.
    0x177E7, // Очень здорово. Но…
    0x1780A, // Я запинаюсь, вдруг почувствовав, что забрёл прямо в центр минного поля неполиткорректности.
    0x178B3, // Всё нормально, можешь сказать это вслух. Может быть, я даже не разозлюсь.
    0x17937, // Я сильно краснею. Даже не знаю, что правильнее будет сказать, если вообще стоит говорить хоть что-то. Однако кажется, что я куда более чувствительный, чем Рин.
    0x17A56, // Неловкая ситуация.
    0x17A79, // Ты не хочешь спросить?
    0x17AA2, // …Как ты рисуешь без рук?
    0x17ACF, // Видишь, со мной легко говорить, правда? Рисую ногами.
    0x17B2F, // Я, в общем-то, догадался, но разве это не трудно?
    0x17B85, // Ты догадлив. Как бы то ни было, думаю, что не трудно. Но, может быть, я просто уже привыкла.
    0x17C26, // Я и представить себе не мог, что она может быть художницей, но, вспомнив, как мастерски она управлялась с вилкой, решаю, что и рисование, возможно, не представляет проблем.
    0x17D5C, // Больше по этому поводу нам сказать нечего.
    0x17DAA, // А при свете дня довольно неплохо. Я боялась, что будет выглядеть слишком плоско, но в конце концов оказалось, что нет.
    0x17E7F, // Вообще, мне кажется, она довольно интересная. Я хотела посмотреть, как она выглядит при тусклом свете. Как по-твоему, не слишком плоская?
    0x17F77, // Э… ну, картины обычно плоские.
    0x17FAF, // Не в этом смысле плоская. Понимаешь, плоская. Как некоторые люди – без содержимого, без мяса там, где оно должно быть.
    0x18084, // Я знаю нескольких девочек, у которых—{w=.5}{nw}
    0x180D4, // Ладно, я понял. Но я ничем не могу помочь, потому что не слишком хорошо разбираюсь в искусстве. Я не способен перечислить так уж много художников или специальных терминов.
    0x1820B, // Так что мне нечего сказать.
    0x1823D, // Рин пожимает плечами, как бы говоря: «Ну, как знаешь», – и смотрит в небо, как будто выискивая там что-то.
    0x182FA, // Я не думала, что буду сегодня над ней работать, но если ты мне поможешь с красками, то дотемна успею что-нибудь сделать.
    0x183D2, // Я хотела раздобыть галогенную лампу, как на стадионах, но тут нет ни одной.
    0x1845A, // Рин быстро привлекает меня к работе, как и Сидзунэ. Складывается ощущение, что фестиваль – действительно серьёзное мероприятие, для которого дорога каждая пара рук.
    0x18589, // Почему бы и нет? Правда, не знаю, смогу ли я тебе чем-то помочь.
    0x185F9, // Просто посмешиваешь краски, ты это сможешь. Наверное. У тебя есть проблемы с моторикой, как у… ну, знаешь, людей с такими проблемами?
    0x186EA, // Может быть, церебральный паралич?
    0x18728, // Вроде бы нет.
    0x18740, // Ясно. Твоя сердечная болячка на это не влияет.
    0x18794, // Ни с того ни с сего она бросает на меня лукавый взгляд.
    0x187F7, // Никоим образом.
    0x18814, // Ну, тогда начнём.
    0x18833, // И вот она садится на пустой деревянный ящик и совершенно естественным жестом берёт толстую кисть босой правой ногой.
    0x1890A, // Я открываю несколько банок и выливаю немного их содержимого в пустые чаши для смешивания.
    0x189AF, // Краска густо струится из банки в чашу, как патока.
    0x18A0A, // Я мешаю их, создавая забавные, гипнотизирующего вида спиральные узоры, которые быстро тают друг в друге, образуя новый однородный цвет.
    0x18B02, // Рин приступает к работе, то и дело прося у меня той или иной помощи.
    0x18B7C, // Находить разные кисти легко, а вот смешивать краски для получения определённого тона, который эта девушка, вероятно, видит у себя в голове, кажется сущим адом.
    0x18C9E, // Она хочет точности до последнего миллиметра, прежде чем удовлетворяется, но её инструкции по меньшей мере туманны.
    0x18D71, // Добавь пол-ливка зелёного.
    0x18DA2, // Я приседаю подобрать банку ярко-зелёной краски.
    0x18DFA, // Другого зелёного. Этого зелёного.
    0x18E38, // Я аккуратно наливаю немного «другого зелёного» в чашу.
    0x18E9D, // Нет, это почти целый ливок. Больше белого.
    0x18EE9, // А зелёный сюда вообще подойдёт?
    0x18F23, // Без понятия. Это же ты у нас художник.
    0x18F67, // В уголках её губ появляется тень улыбки.
    0x18FB1, // У тебя нет своего мнения?
    0x18FDF, // Нет, просто не знаю, как будет лучше.
    0x19021, // Это ничего, потому что я только что поняла, как будет лучше. Добавь ещё белого.
    0x190AF, // После этого восклицания я наливаю немного белого в чашу и перемешиваю. Цвет становится чуть-чуть… белее.
    0x19170, // Так не пойдёт. Он должен быть как… как цвет, когда ты просыпаешься и {b}знаешь{/b}, что ты видел во сне смысл жизни, но не можешь его вспомнить.
    0x1926D, // Может быть, это жёлтый…
    0x19299, // Несмотря на неспособность намешать цвет «смены времён года» или ещё какой-нибудь вздор, который от меня требуется, я наслаждаюсь процессом больше, чем мог ожидать.
    0x193C5, // Рождение картины на оштукатуренной стене похоже на чудо.
    0x1942E, // Я провожу время между смешиванием красок, сидя на тротуаре и просто созерцая её работу.
    0x194CE, // Поначалу возникает чувство, будто я стою у неё над душой, вторгаюсь в интимность акта творчества, но Рин, кажется, нет до этого никакого дела. Наверное, я сам себе надумал, что могу ей помешать.
    0x1962B, // От неё исходит совсем иная аура, когда она терпеливо работает над деталями, покрывая слои краски новыми слоями и уверенно двигает ногой вдоль стены, добавляя новые формы.
    0x19763, // Когда мне удаётся добиться приемлемого цвета смеси красок, улыбка, которая при этом возникает на её лице, становится, как ни странно, наградой для меня.
    0x19878, // Не считая редких реплик во время обсуждения смесей, никто из нас подолгу не произносит ни слова.
    0x19928, // И даже эти короткие дискуссии вскоре превращаются в кодовый язык: мы оба придумываем и используем странные импровизированные слова для обозначения разных красок и оттенков.
    0x19A68, // Как если бы была какая-то необходимость беречь слова, дыхание и звуки.
    0x19AE8, // Мы задерживаемся здесь до позднего вечера, пока не становится слишком темно, чтобы рисовать.
    0x19B92, // Ай!
    0x19B98, // Придя в себя, я встречаю взгляд двух зелёных глаз размером с блюдца, удивлённо уставившихся на меня снизу.
    0x19C5A, // Они принадлежат виновнице столкновения – низенькой девочке, распластавшейся передо мной на полу.
    0x19D0F, // Она озабоченно хмурит брови. Она одета в физкультурную форму, что довольно странно для большой перемены.
    0x19DCF, // …Однако больше всего в её внешности меня поражает то, что у неё нет ног.
    0x19E52, // Точнее, есть, но ненастоящие. Её бледные ножки заканчиваются бёдрами, а голени и ступни заменяет устройство то ли из металла, то ли из пластика чёрного цвета.
    0x19F71, // Это смотрится чрезвычайно неестественно. На мгновение я даже забываю о боли в груди.
    0x1A00C, // Девочка морщится, трёт нос и вскакивает.
    0x1A056, // Вот чёрт… Эй, ты в порядке? Прости, пожалуйста!
    0x1A0AB, // Я бежала, а ты вдруг появился из ниоткуда… Прости, я нечаянно!
    0x1A11C, // Она смотрит на меня виноватыми глазами, будто наказанный щенок.
    0x1A191, // Я тут же забываю о всяком негодовании, ведь щеночки с таким вот взглядом – моя слабость.
    0x1A232, // Всё в порядке. Не волнуйся об этом… ай…
    0x1A27B, // Хоть я и сказал, что всё в порядке, но понимаю, что подобный удар – одна из сильнейших опасностей; в моей груди растёт острая боль.
    0x1A367, // Не перегружать себя, не забывать про лекарства и, самое главное, остерегаться ударов в грудь.
    0x1A411, // Я пытаюсь помассировать солнечное сплетение, чтобы ослабить боль, задерживаю дыхание, чтобы услышать сердцебиение.
    0x1A4E6, // Кажется, всё уже в порядке…
    0x1A519, // Эй, позвать врача?
    0x1A53A, // Взволнованный, пронзительный голосок девочки приводит меня в чувство.
    0x1A5BC, // Простояв в оцепенении несколько секунд, я внезапно осознаю, что сложившийся пополам и с болезненной гримасой на лице я выгляжу куда хуже, чем чувствую себя на самом деле.
    0x1A6F3, // Чёрт, я слишком беспокоюсь о своём сердце.
    0x1A740, // Эм… не стоит, я уже в порядке.
    0x1A776, // Я нахожу в себе силы выпрямиться, потирая напоследок рёбра, и делаю глубокий вдох.
    0x1A80C, // Она только что чуть не вышибла из меня дух. Но, похоже, обошлось.
    0x1A880, // Точно в порядке? Я тебя крепко стукнула.
    0x1A8C9, // Всё нормально, я же сказал. Ничего не сломано. Жить буду.
    0x1A92F, // Это хорошо! Я—
    0x1A94A, // Когда я не знаю, что делать, я стараюсь занять себя чем-нибудь привычным.
    0x1A9CE, // Как и сейчас.
    0x1A9E6, // Я уже начал читать одну из библиотечных книг и принёс её с собой в школу, чтобы скоротать время между уроками.
    0x1AAAE, // Я нахожу страницу со сложенным уголком-закладкой и начинаю оттуда.
    0x1AB29, // Миша и Сидзунэ всё ещё возбуждённо спорят, может быть до сих пор о ресторанах.
    0x1ABB7, // Если я сейчас попытаюсь заговорить с ними, они просто втянут меня в свой спор или, того хуже, опять попытаются затащить в Школьный совет.
    0x1ACB0, // Поскольку поблизости нет никого, кто мог бы присоединиться к их беседе, Миша перестаёт озвучивать дискуссию.
    0x1AD78, // Интересно, почему её тянет переводить на язык жестов даже то, что Сидзунэ знать необязательно, или, что ещё удивительнее, когда её даже нет рядом? Любопытная привычка.
    0x1AEA8, // Мне становится сложно сосредотачиваться на книге, перерыв манит меня прочь из скучного класса. Я повинуюсь его зову и отправляюсь в столовую.
    0x1AFAC, // Миша и Сидзунэ, кажется найдя компромисс, следуют за мной, продолжая энергично разговаривать.
    0x1B058, // Я всё ещё чувствую себя виноватым за то, что спугнул её вчера, так что, думаю, будет лучше сказать ей что-нибудь.
    0x1B122, // Эм, привет, Ханако.
    0x1B144, // Хи… Хисао?
    0x1B158, // Что ж, по крайней мере, она помнит моё имя.
    0x1B1A4, // Это… Я просто хотел извиниться за вчерашнее.
    0x1B1F7, // Я не хотел тебя напугать, ничего такого.
    0x1B240, // Просто я здесь новенький и думал, что надо бы познакомиться с одноклассниками.
    0x1B2D0, // Ханако поднимает на меня взгляд, и я ещё раз замечаю её шрамы.
    0x1B340, // Немного сбивает с толку то, что издалека они почти не заметны, а вблизи прямо-таки бросаются в глаза.
    0x1B3F7, // В… Всё в порядке.
    0x1B417, // Это… Это я виновата.
    0x1B43D, // Да нет, никто не виноват, просто так уж вышло.
    0x1B48F, // Ты кого-то ждёшь? Я заметил, как ты смотрела на дверь…
    0x1B4F1, // Д-да… Лилли.
    0x1B508, // А, ты имеешь в виду Лилли, слепую девушку?
    0x1B553, // Ханако слегка кивает в ответ, а я задаюсь вопросом, не является ли грубостью различать людей по типу их инвалидности или же здесь это считается нормальным?
    0x1B66F, // Теперь понятно, почему Лилли вчера отправилась за ней.
    0x1B6D3, // Мне она показалась приятной девушкой. Вы с ней подруги?
    0x1B738, // Она вновь глядит через плечо, будто в надежде увидеть Лилли.
    0x1B7A6, // Кажется, она опять начинает из-за меня нервничать.
    0x1B802, // Прости, если я снова тебя побеспокоил…
    0x1B84A, // Н-не в этом дело.
    0x1B868, // Просто лучше бы Лилли сюда не приходить…
    0x1B8B4, // А, потому что ей трудно найти класс?
    0x1B8F5, // Нет… не совсем.
    0x1B912, // Ханако переводит взгляд в сторону Сидзунэ.
    0x1B961, // Сидзунэ?
    0x1B971, // Она молча кивает.
    0x1B991, // При чём тут она? Они с Лилли не ладят?
    0x1B9D4, // Ханако качает головой. Очевидно, она не очень хочет рассказывать об этом.
    0x1BA5A, // То, что Лилли не ладит с Сидзунэ, кажется в некотором роде естественным.
    0x1BADD, // Общение между ними не представляется возможным. С Сидзунэ и так трудно разговаривать через Мишу, даже если видишь, кто из них жестикулирует.
    0x1BBDE, // Ханако так сосредоточена на Сидзунэ, что я первым замечаю Лилли в дверях.
    0x1BC64, // О, она тут.
    0x1BC77, // Ханако разворачивается и, увидев Лилли, бежит к двери.
    0x1BCDA, // Лилли…
    0x1BCE8, // О, Ханако. Доброе утро. Президент здесь?
    0x1BD30, // Ханако опять бросает через плечо взгляд на Сидзунэ, словно пытаясь удостовериться, что та их не слышит, хотя это невозможно в принципе.
    0x1BE27, // Тогда, пожалуй, нам лучше уйти.
    0x1BE5F, // Лилли вздыхает, и в её тяжёлом вздохе слышатся нотки отчаяния. Похоже, между ними действительно есть острая неприязнь.
    0x1BF38, // Мне любопытно, но я не решаюсь спросить об этом. Они сами рассказали бы, если б захотели.
    0x1BFD8, // Я здесь всего третий день; мне следует заводить друзей, а не пытаться выяснять причины чьей-либо вражды.
    0x1C096, // В любом случае забавно узнать, что даже тут случаются распри, как и в моей прежней школе.
    0x1C137, // Хоть люди здесь терпимее к другим, они всё равно умудряются досаждать друг другу.
    0x1C1CC, // Привет, Лилли. Как ты? Извини, что вчера тебе пришлось так спешно из-за меня уйти…
    0x1C260, // Боже мой, это Хисао? Я не знала, что ты здесь…
    0x1C2B2, // Лилли, кажется, немного смущена, что так разоткровенничалась в моём присутствии.
    0x1C346, // И-извини, Лилли. Я думала, ты поняла…
    0x1C389, // Нет-нет, всё в порядке, Ханако.
    0x1C3C0, // Хисао, пожалуйста, не беспокойся о вчерашнем. Это было простое недоразумение.
    0x1C44E, // Ну… как скажешь. Я всё ещё не до конца освоился здесь.
    0x1C4B0, // Думаю, скоро ты поймёшь, что люди в этой школе снисходительнее, чем где-либо ещё.
    0x1C542, // Если ты озадачен чем-то, то, пожалуйста, не стесняйся спрашивать.
    0x1C5B8, // Хорошо, буду знать.
    0x1C5DB, // Эм… Лилли…
    0x1C5F1, // Лилли понимающе кивает.
    0x1C61D, // Извини, Хисао, но нам пора.
    0x1C64D, // Видно, что Ханако чувствует себя напряжённо, да и Лилли всё ещё немного смущена.
    0x1C6DF, // Интересно, помогли ли хоть немного мои извинения?
    0x1C73A, // Вы не против, если я присоединюсь к вам?
    0x1C782, // Я, конечно, навязываюсь, но… Лилли, по-прежнему улыбаясь, тихонько хмыкает.
    0x1C80B, // У нас наверняка найдётся для тебя местечко, правда, Ханако?
    0x1C877, // Ханако переводит взгляд на Лилли, на меня, а затем замирает, широко раскрыв глаза.
    0x1C90C, // К… конечно.
    0x1C922, // Что ж, тогда пойдёмте?
    0x1C94A, // Уверен, что Лилли не согласилась бы с такой лёгкостью, если бы могла увидеть, насколько испугана её подруга.
    0x1CA0F, // Впрочем, всё уже решено.
    0x1CA3B, // Миша и Сидзунэ всё ещё спорят о местах, где можно перекусить, недостижимых для обычных школьников, которым пришлось бы добираться до города и обратно на такси.
    0x1CB5E, // Вы что, ещё не закончили?
    0x1CB8B, // А, прости, Хиттян! Ты нас ждал?
    0x1CBC1, // У тебя нет никаких планов?
    0x1CBF1, // Планов?
    0x1CBFF, // На большую перемену.
    0x1CC25, // Ну… нет, я думал провести время с вами.
    0x1CC6C, // Миша отмечает отсутствие у меня планов победоносной улыбкой, взволнованно передав мои слова Сидзунэ.
    0x1CD27, // Раз ты свободен, не хочешь перекусить с нами? Правда, мы собираемся в город… Не волнуйся, Хиттян, это совсем рядом!
    0x1CDF7, // Конечно, я не против.
    0x1CE1D, // На этом мы и покидаем класс.
    0x1CE50, // Да, я обещаю. Определённо.
    0x1CE7F, // Может быть, но… то есть…
    0x1CEAD, // После моей фразы в его глазах появляется что-то похожее на угрозу, отчего мне хочется взять свои слова обратно.
    0x1CF78, // То есть я не знаю… я всё ещё пытаюсь привыкнуть к школе.
    0x1CFDE, // Однако я обещаю попробовать.
    0x1D013, // Звучит не очень убедительно, Хисао. Совет первый: медработники не любят, когда к их рекомендациям относятся несерьёзно.
    0x1D0EE, // Да что с ним такое? Как будто день или два сыграют большую роль.
    0x1D161, // Я и в больнице ничего не делал.
    0x1D199, // Да, хорошо. Извините.
    0x1D1BF, // Почитать свою книгу.
    0x1D1E5, // Можешь пообещать мне впредь относиться к этому серьёзнее?
    0x1D250, // Может быть.
    0x1D265, // Ну что, давай скорей, Хиттян~! На ланч!
    0x1D2A9, // Обещаем, будет здорово!
    0x1D2D4, // Ловлю тебя на слове. Что это за место?
    0x1D318, // Что-то вроде ресторана?
    0x1D343, // Это чайный дом, Хиттян~!
    0x1D36E, // Чайный дом… может оказаться дороговато.
    0x1D3B9, // Почему ты смотришь в свой бумажник, Хиттян? Ничего страшного, если у тебя нет денег, мы за тебя заплатим~!
    0x1D477, // Очень мило с вашей стороны. Спасибо.
    0x1D4B9, // Всё в порядке, Хиттян! Мы же всё-таки друзья, да, Хиттян?
    0x1D51D, // Мы знакомы всего три дня. Неужели мы так быстро сумели сдружиться?
    0x1D596, // Хе-хе. Но мне приятно это слышать.
    0x1D5D3, // А, но это только на сегодня и только если ты согласишься прямо сейчас! Ты точно хочешь пойти, Хиттян?
    0x1D689, // Я начинаю задумываться, не ловушка ли это. Этот поход предложила мне Миша или Сидзунэ? Это важно. Меня несколько тревожат возможные мотивы девочки, чья любимая забава – игра в мировое господство.
    0x1D7EE, // …Нет, наверное я просто поддался паранойе. В конце концов, я не имею ничего против их компании. Иногда необходимо выбираться в город, так почему бы и не вместе с ними?
    0x1D91C, // Я никогда раньше не был в чайном доме, только видел их по телевизору в исторических фильмах. Возможно, сейчас это всего лишь обычные кафе, в которых от тех «чайных домов» осталось одно название.
    0x1DA7D, // Моё любопытство – лишь ещё одна причина, по которой я хочу пойти с ними.
    0x1DB00, // Конечно.
    0x1DB10, // Это здорово, Хиттян~! Здорово, здорово! Ура~!
    0x1DB5F, // Миша несколько раз радостно подпрыгивает на месте, в очередной раз привлекая своим поведением посторонние взгляды. Сидзунэ лаконично, едва слышно аплодирует, прежде чем выражение её лица снова становится невозмутимым.
    0x1DCF2, // Тебе не помешало бы быть немного радостней, Сидзунэ.
    0x1DD52, // О-о! А я не знала, что Хиттян у нас король. Ха-ха-ха-ха~!
    0x1DDB2, // Сидзунэ поправляет очки, пока Миша переводит её слова, причём без единой нотки сарказма. Полагаю, если бы она смогла передать интонацию Сидзунэ, эта насмешка могла бы меня задеть. В такие моменты я рад, что между нами существует подобный барьер.
    0x1DF70, // Я и не прошу тебя прыгать от радости из-за того, что решил к вам присоединиться. Я не столь высокомерен.
    0x1E02B, // Думаю, Сидзунэ и так это понимает. Под её предводительством мы втроём направляемся в город.
    0x1E0D2, // А теперь нам пора бежать: в Школьном совете важное собрание по поводу фестиваля. И мы наконец решили, где будем есть~!
    0x1E1A7, // Жаль, но тебе нельзя с нами: это бизнес-ланч только для членов Совета.
    0x1E225, // Мы обязательно позовём тебя в другой раз! О, но это было бы слишком похоже на свидание, не правда ли?
    0x1E2DA, // Девочки спускаются вниз по лестнице.
    0x1E31E, // Не успеваю я сделать и пары шагов по коридору, как меня буквально захлёстывает волна шума и суеты перемены. Мне тоже пора идти.
    0x1E405, // Больше за весь учебный день не происходит ничего интересного.
    0x1E477, // Я успеваю прочесть большую часть книги, начатой вчера, и перекусить в столовой, с трудом что-то выбрав из совершенно непривлекательного меню.
    0x1E57A, // Уроки ужасно скучны.
};

#endif // KS_SCRIPT_A1_WEDNESDAY_RU_TL_INDEX