#ifndef KS_SCRIPT_A1_SUNDAY_RU_TL_INDEX
#define KS_SCRIPT_A1_SUNDAY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int script_a1_sunday_ru_intl[] = {
    0x0000, // Моё сегодняшнее пробуждение сопровождается лёгким головокружением. Уже почти полдень.
    0x00A1, // Сегодня можно спать допоздна: воскресенье, уроков нет.
    0x0105, // Хотя это не простое воскресенье, а ещё и день фестиваля.
    0x016B, // Из окна видно, как люди в киоске с жареной собой накладывают лапшу страждущим по низкосортной пище.
    0x0221, // Я закидываю в рот пригоршню утренних лекарств и принимаюсь раздумывать, как же провести день.
    0x02CD, // На следующей неделе ожидается несколько экзаменов, но я, в отличие от остальных, не считаю их угрозой, потому и не беспокоюсь.
    0x03B2, // За неимением горящих обязательств по учёбе, я могу провести день фестиваля так, как хочу.
    0x0455, // Закончив утренние процедуры, я выхожу в коридор, намереваясь найти чего-нибудь поесть.
    0x04F4, // Проходя мимо двери Кендзи, я вдруг решаю поинтересоваться, чем собирается заняться он.
    0x0593, // Все сегодня чем-то заняты, и мне любопытно, есть ли у него какие-либо планы.
    0x061B, // Хотя, с другой стороны, он вполне мог сделать из комнаты звуконепроницаемое убежище.
    0x06B6, // Или нечто вроде крепости с табличкой «Женщинам не входить».
    0x0724, // …и слово «Женщинам» перечёркнуто, а над ним накорябано: «Никому».
    0x079D, // Постучав в дверь, на которой, к счастью, никакой таблички нет, я снова слышу щёлканье по меньшей мере десятка замков. Дверь со скрипом открывается.
    0x08A8, // Кто там?
    0x08B7, // «Кто там» надо спрашивать перед тем, как открываешь дверь.
    0x0922, // А, это ты. Блин, ещё же рано.
    0x0953, // На самом деле не так уж и рано.
    0x098A, // В чём дело, чувак?
    0x09AA, // Ни в чём, просто хотел спросить, чем будешь сегодня заниматься.
    0x0A1D, // Половина школы уже собралась снаружи.
    0x0A63, // Где – «снаружи»? Почему?
    0x0A90, // Что?
    0x0A98, // Что – «что»? Сегодня особый день? Почему они там? И кто это – «они»?
    0x0B12, // Я их слышу. Шумят… только не говори, что… Началось вторжение?
    0x0B83, // Он вдруг принимает тревожный вид.
    0x0BC1, // Какой сегодня день, чувак?
    0x0BF1, // Да, наверное ты не видишь деревянные киоски на улице и то, как люди продают еду…
    0x0C83, // О чём ты, чёрт возьми? Я держу занавески задёрнутыми, чтобы помешать снайперам.
    0x0D13, // О-ох, да фестиваль сегодня! Тебе ведь о нём известно?
    0x0D72, // Твою мать, что, уже сегодня? Ах, чёрт. Во-от… чёрт. Чёрт бы их побрал.
    0x0DEC, // Не могу поверить, что я забыл, я ведь ещё не закончил свою крепость! Это плохо.
    0x0E79, // Сегодня будет ужасный день… Хорошо, что ты меня предупредил, чувак. Паршивый будет день.
    0x0F1B, // Почему?
    0x0F29, // О-о, чувак, они же будут повсюду. Люди. За окном. Общаться!
    0x0F90, // Кендзи нервно трёт виски. Ему как будто стало плохо.
    0x0FEF, // Будет шумно, как в аду. Чёрт, а я собирался сегодня выйти, теперь всё пропало. Всё пропало.
    0x1091, // Это кошмар. Отстой. Лажа!
    0x10BE, // Блин, полный отстой. Я теперь не могу никуда пойти. Некуда бежать.
    0x1135, // Кендзи, похоже, нервничает. Можно сказать, капитально съезжает с катушек.
    0x11BB, // Не могу поверить. Так вот что сегодня за день!
    0x120E, // Чёрт, я даже не смог подготовиться.
    0x124E, // Я даже не смог собраться, а теперь, когда всё началось, я бессилен. Тебе следовало сказать мне раньше, чувак. То есть я хотя бы теперь знаю, но… Я должен был узнать раньше! Только представь, чего бы я смог достичь…
    0x13CF, // Прости. Я думал, ты знаешь.
    0x13FF, // Значит, я так полагаю, ты сегодня не будешь ничем занят?
    0x1464, // Даже погода хорошая. Вчера было ветрено, так что я думал, что сегодня будет холодно. Но раз нет, то и смысла сидеть дома тоже нет. Да, тебе надо сходить на фестиваль.
    0x158C, // Кендзи закрывает лицо руками и стонет.
    0x15D3, // А-а, нет, нет! Я не могу. Они съедят меня заживо, я знаю.
    0x1634, // Наверное, это шутка, но он произносит её с невозмутимым лицом. Относительно невозмутимым.
    0x16D8, // А что ты собираешься делать? Давай ко мне, поможешь строить крепость. Если будем работать вместе, то, может, ещё успеем.
    0x17B0, // Не знаю… Я голодный, но я заключил сделку, что попытаюсь беречь себя. Ну, быть здоровее, понимаешь?
    0x1863, // Не знаю, стоит ли мне держаться подальше от такояки или же пойти прямиком к ним.
    0x18F4, // Сделку? Звучит зловеще. А что ты получишь взамен?
    0x194D, // Полагаю, что ничего. Это не такого рода сделка.
    0x19A2, // Ты знаешь Эми из параллельного класса? Мы вроде как договорились присматривать друг за другом, и…
    0x1A56, // Йа-и-и-и-и-и-и-и-и!
    0x1A74, // От пронзительного визга и гримасы ужаса на лице Кендзи у меня кровь стынет в жилах. Как будто я сообщил католическому священнику, что продал душу дьяволу.
    0x1B8E, // С ней! Ты продал душу дьяволу и не получил ничего взамен?
    0x1BF5, // Чувак, да что с тобой вообще такое?
    0x1C34, // Ты в курсе, с кем имеешь дело?
    0x1C69, // Она – угроза здоровью общества. Знаешь, сколько народу она каждый месяц отправляет в больницу, когда влетает в них на полной скорости?
    0x1D5F, // Она – одна из них! Ключевой игрок в этом глобальном заговоре, преследующий цель полностью поставить на колени всё мужественное.
    0x1E4A, // Ушам своим не верю. Чувак, я доверял твоему здравомыслию. Я думал, мы братья.
    0x1ED4, // Тебе нужно отменить сделку, пока не поздно.
    0x1F23, // И отказаться от похода на фестиваль… это же одна из их ловушек.
    0x1F97, // Это как-то беспокоит, а теперь я и сам начинаю сомневаться.
    0x2002, // Стоит ли мне идти?
    0x2023, // Я достаю книгу, которую собирался почитать.
    0x2073, // Что-то о подпольной почтовой системе, которая, может, существует, а может, и нет…
    0x2106, // И эта книга короткая. Я могу прочитать её за день.
    0x2160, // Но хороший ли это способ провести время?
    0x21AA, // Ну, да. Определённо.
    0x21CE, // Но, полагаю, пойти на улицу окажется идеей получше.
    0x222B, // Посмотреть фестиваль.
    0x2254, // Попробовать поучаствовать во всех сопутствующих развлечениях.
    0x22C9, // В самом деле, я должен по крайней мере попробовать остаться тем дружелюбным человеком, которым был всю прошедшую неделю.
    0x23A6, // Можно найти там что-нибудь перекусить, как предлагает мой живот.
    0x241C, // Почти время ланча… По крайней мере, я мог бы взять чего-нибудь с одного из тамошних лотков.
    0x24C2, // Вскоре я оказываюсь снаружи, в окружении учеников и людей, которые могут приходиться кому-то из них родителями.
    0x258E, // Часто мне попадаются на глаза те, кто, очевидно, просто пришёл из города посмотреть на фестиваль.
    0x263F, // Их легко заметить.
    0x2661, // Они не могут перестать пялиться, и в их глазах читается: «Интересно, а что не так с {b}этим{/b} парнем?»
    0x2716, // Хочется накричать на них.
    0x2745, // С другой стороны, не могу же я отрицать, что всю неделю тем же самым и занимался?
    0x27D6, // Меня накрывает волна чего-то, похожего на отвращение, вины за собственную узколобость.
    0x2875, // …
    0x2879, // Я отбрасываю мысли в сторону, сосредоточившись на приступах голода, которые полыхают в моём желудке, словно лесной пожар.
    0x2958, // Запах жареного приводит меня в край обетованный, где я могу поесть.
    0x29D3, // Я протягиваю руки, чтобы получить свой заказ, но тут меня останавливает громкий голос.
    0x2A71, // Эй, какого чёрта ты делаешь?
    0x2AA4, // Собираюсь завтра… эм, есть ланч.
    0x2AE0, // Завтракать?
    0x2AF6, // Ты хочешь сказать, что только что встал?
    0x2B3F, // Эм-м…
    0x2B4A, // Внезапно проспать всё утро стало чем-то вроде преступления.
    0x2BB8, // Нет, я имел в виду ланч… Честно.
    0x2BF2, // Она не покупается на это.
    0x2C20, // Поздний завтрак?
    0x2C3F, // Как бы то ни было, это определённо не здоровая пища.
    0x2C9D, // Она выхватывает еду из моих рук, воззрившись на меня.
    0x2CFE, // Какого чёрта она творит?
    0x2D2B, // Эй, это мой завтрак!
    0x2D4F, // Ты ведь сказал, что это ланч?
    0x2D83, // Это мой… Неважно, это моя еда!
    0x2DBA, // Эми упирает руки в боки и начинает читать мне нотацию.
    0x2E1D, // Ты и правда уже забыл свой режим питания?
    0x2E68, // Тебе надо серьёзнее относиться к своему здоровью, Хисао!
    0x2ED0, // Как же твоё сердце?
    0x2EF3, // С моим сердцем всё в порядке! Почти.
    0x2F34, // В ответ она только закатывает глаза.
    0x2F77, // Я в этом сомневаюсь.
    0x2F9C, // Если бы это было так, тебя бы здесь не было, верно?
    0x2FF6, // В её словах есть смысл, разумеется.
    0x3036, // Но я не собираюсь так просто сдаваться.
    0x307E, // Для сердца это не так уж и плохо!
    0x30B9, // Оно, безусловно, способно справиться с капелькой жира время от времени!
    0x313C, // Вот именно. И небольшие пробежки – тоже не беда.
    0x3194, // Но не похоже, что Эми убеждена.
    0x31CC, // Неудивительно, мне и себя-то не удалось этим убедить.
    0x322D, // Может быть, но не тогда, когда ты дрыхнешь днями напролёт!
    0x3296, // Её лицо принимает вкрадчивое выражение.
    0x32E0, // Разумеется, если бы ты следовал расписанию с самого начала, то не оказался в этом положении…
    0x338A, // Эй, у меня была весьма насыщенная неделя, знаешь ли!
    0x33E8, // Например, я едва не умер! И встретился с множеством людей, и ещё я был на крыше…
    0x3478, // Это, чтоб ты знал, не является достаточным оправданием.
    0x34DD, // Краткое свидание со смертью – не повод для пропуска базовых упражнений.
    0x3562, // Таких как пробежка по утрам.
    0x3596, // Она кивает, словно приняла только что очень важное решение.
    0x3603, // Значит, решено!
    0x361F, // Ты увидел, насколько ошибочен был твой путь, и готов следовать моему расписанию, правда?
    0x36C0, // Я увижу тебя завтра рано утром?
    0x36F9, // Мы будем партнёрами по бегу?
    0x372D, // Знаешь, ты меня вчера уже убедила, что так будет лучше.
    0x3790, // Незачем убеждать меня заново.
    0x37C7, // Хотя моя убеждённость как-то слабо отражается на поступках.
    0x3835, // Она права насчёт здоровой еды, в конце концов. А то, что я здесь заказал, ничуть не здоровое.
    0x38DB, // Но вкусное!
    0x38F0, // Есть более важные вещи, чем вкусная еда, разве нет?
    0x394C, // Например, оставаться живым?
    0x397F, // Если бы Эми со своими угрозами за мои неверные решения здесь не было, я бы, наверное…
    0x3A1A, // Эй, погоди секунду.
    0x3A3D, // У меня в мозгу внезапно возникает вопрос.
    0x3A89, // Эй, а с какой радости тебя так волнует моё доброе здоровье?
    0x3AF4, // Эми пожимает плечами и ухмыляется.
    0x3B34, // Ты ведь новичок.
    0x3B52, // Я так понимаю, у тебя нет друзей, верно?
    0x3B99, // К тому же я доставляла тебе проблемы всю неделю, верно?
    0x3BFD, // Я должна тебе за то, что ты не разозлился.
    0x3C48, // Тем более я это фельдшеру обещала.
    0x3C87, // А-га. Чокнутая маленькая девчушка-попрыгушка хочет вернуть моё здоровье.
    0x3D0D, // Наверное, бывает участь и похуже.
    0x3D4A, // Ладно, это звучит… Неплохо.
    0x3D7D, // Спасибо за участие.
    0x3DA1, // Значит, завтра утром?
    0x3DC8, // Подумав, что беседа завершена, я поворачиваюсь, чтобы уйти.
    0x3E34, // Не так быстро!
    0x3E4E, // Эй, не так грубо!
    0x3E6C, // Что тебе ещё нужно?
    0x3E8F, // Эми, кажется, вот-вот обидится на мой раздражённый вопрос.
    0x3EF9, // Думала, тебе захочется провести время в компании.
    0x3F54, // Она глядит на меня с подозрением.
    0x3F91, // Кроме того, ты ведь просто собирался украдкой прикупить ещё той жареной гадости, разве нет?
    0x4038, // Я не собирался, но теперь, когда Эми об этом упомянула, идея кажется не такой уж и плохой.
    0x40D9, // Ничего подобного!
    0x40FA, // Ещё один пристальный взгляд.
    0x412F, // Ладно, может быть, немножко…
    0x4164, // Она всё глядит на меня в упор.
    0x419A, // Ладно, много.
    0x41B2, // О боже, я опасен для себя и окружающих, да?
    0x41FE, // Сначала соглашаюсь, что надо выздоравливать, и тут же покупаюсь на соблазн первой попавшейся нездоровой привычки.
    0x42D0, // Я так и знала! Тебе нельзя доверять!
    0x4311, // Теперь мне точно придётся пойти с тобой.
    0x435B, // Сама эта ситуация кажется глупой.
    0x4399, // Могу только представить, что думают прохожие, когда видят меня, выслушивающего наставления от девушки ростом вдвое ниже меня.
    0x4480, // Наверное, мне лучше пока сдаться.
    0x44BD, // Отлично, делай что хочешь.
    0x44ED, // Я вздыхаю.
    0x4500, // Попробую найти в этом положительную сторону.
    0x4553, // Чем тебе хочется заняться?
    0x4584, // Эми ненадолго задумывается.
    0x45B8, // Ну, я обещала Рин взглянуть на её фреску…
    0x4604, // Так что давай отправимся к ней!
    0x463D, // Признаюсь, мне самому слегка любопытно, что у неё в итоге получилось, и я снова отмечаю, что судьба моя могла быть куда менее приятной.
    0x4731, // Я согласно киваю и вдруг обнаруживаю, что Эми практически волоком тащит меня сквозь толпу, устремляясь к нашей цели.
    0x4806, // Ко времени прибытия к стенам общежития я чувствую, что моё сердце колотится очень сильно.
    0x48AA, // Оно не должно так стучать после всего лишь маленькой пробежки.
    0x491D, // Я делаю несколько глубоких вдохов, заставляя себя расслабиться.
    0x4993, // По сравнению со многими учениками «Ямаку», я выгляжу вполне здоровым, но я всё равно должен находиться здесь.
    0x4A5B, // Иногда мне прямо хочется, чтобы я лишился руки или что-то в этом роде.
    0x4AD9, // По крайней мере, тогда будет очевидно, почему я тут.
    0x4B37, // Но я, напротив, даже не кажусь больным.
    0x4B7D, // Даже сейчас, когда пытаюсь отдышаться, я просто похож на парня в плохой физической форме.
    0x4C20, // Эми оглядывается и замечает моё бедственное положение.
    0x4C86, // Надеюсь, ты не собираешься умереть тут при мне?
    0x4CDC, // Пожалуйста, не надо!
    0x4D01, // Это будет моей ошибкой, и я совсем не хочу заполучить такое чувство вины.
    0x4D86, // И вообще, мне хватило прошлого раза и я не думаю, что желаю снова это видеть, особенно если фельдшер скажет, что виновата во всём была я.
    0x4E7C, // Н… не, я в порядке.
    0x4E9E, // Пожалуй, мне всё же придётся начать бегать.
    0x4EED, // А ты ещё хотел продолжить есть то сочащееся жиром… что бы это ни было.
    0x4F6D, // Вот видишь? Хорошо, что я тебя нашла, правда?
    0x4FBD, // Да, так и есть.
    0x4FD7, // Может быть.
    0x4FEC, // Конечно, я не скажу ей, что не оказался бы в таком виде, если бы она не проволокла меня через весь фестиваль.
    0x50AF, // Дальнейшее общение прерывается внезапным появлением Рин.
    0x511A, // А, это вы.
    0x512B, // Привет, Эми.
    0x5141, // Здорово, Рин! Я взяла Хисао с собой, потому что он пытался вызвать у себя новый инфаркт!
    0x51DF, // Неправда!
    0x51F1, // Моё возражение проходит незамеченным.
    0x5238, // Мы зашли поглядеть, что вышло из фрески!
    0x5281, // Рин деловито кивает.
    0x52A7, // Что ж, она прямо тут.
    0x52CC, // Её довольно неплохо отсюда видно.
    0x530A, // Мне любопытно, как долго Рин уже стоит перед своей фреской.
    0x5376, // Кто-нибудь вообще приходил на неё посмотреть?
    0x53CA, // Или мы первые?
    0x53E4, // Очевидно, что мы не первые её увидели.
    0x5429, // В смысле, она довольно-таки большая.
    0x546B, // Нужно постараться, чтобы её не заметить.
    0x54B5, // И в то же время я не думаю, что кто-нибудь заговаривал о ней с Рин.
    0x552B, // Кроме нас, конечно.
    0x554E, // Я чувствую, что обязан что-то сказать.
    0x5593, // Выглядит здорово.
    0x55B4, // Я всё равно не очень довольна тем, какой она получилась.
    0x561A, // Но, думаю, сойдёт.
    0x563A, // Она, похоже, чуть ли не убеждает себя.
    0x567E, // Я точно не уверен, какого результата она ждала, но, полагаю, она не вполне его добилась.
    0x571C, // Мы стоим перед фреской и разглядываем её от края до края.
    0x5784, // Я старательно сосредотачиваюсь на композиции картины.
    0x57E9, // Она и в самом деле любопытная.
    0x5820, // Цвета переплетаются и смешиваются, вовлекая меня в свой хоровод.
    0x5897, // Картина настолько фантастическая, что я уже не вполне уверен, в том ли ещё мире я нахожусь.
    0x593C, // Я пытаюсь обнаружить следы красок, которые мы с Эми достали.
    0x59AA, // Но, как ни стараюсь, нигде не вижу следов прусской лазури.
    0x5A13, // Ну и ладно.
    0x5A27, // Уверен, она где-то тут.
    0x5A50, // У меня начинают ныть ноги, но Рин, похоже, не собирается двигаться с места.
    0x5AD7, // Эми решается заговорить.
    0x5B05, // Эй, Рин, а ты ела?
    0x5B23, // Конечно. Иначе не выживешь.
    0x5B55, // А как насчёт последних пяти часов?
    0x5B94, // Может быть. Но я снова голодна, поэтому, возможно, я ошибаюсь.
    0x5C03, // Эми улыбается и хлопает в ладоши.
    0x5C40, // Отлично! Пойдём с нами, перекусишь!
    0x5C80, // Рин молча кивает.
    0x5CA0, // Хорошо, но нам нужно спешить, пока они не заметили, что я ушла.
    0x5D10, // Я почему-то думаю, что им всё равно.
    0x5D50, // Кем бы «они» ни были.
    0x5D76, // Когда мы возвращаемся к прилавкам с едой, я жадным взглядом окидываю выставленную там жареную пищу.
    0x5E2D, // Нет, лучше не надо.
    0x5E4F, // Я совершенно уверен, что Эми всё равно мне не позволит.
    0x5EB3, // Мы находим отличное местечко на газоне и присаживаемся, чтобы расправиться со своими покупками.
    0x5F64, // Ну, вернее, моими покупками. Как-то так вышло, что я заплатил за всю еду.
    0x5FE5, // Удивительно, но моя (нежареная) еда вполне вкусная.
    0x6042, // Тишина окутывает нашу компанию – мы с Эми едим, а Рин глядит на… куда-то глядит, в общем, время от времени откусывая кусочек-другой.
    0x6132, // Я первым доедаю свою порцию и ложусь на траву.
    0x6186, // Эми отрывается от еды и переводит на меня взгляд.
    0x61E0, // Устал, Хисао?
    0x61F8, // Наверное, немножко.
    0x621C, // Ну, не проспи завтра, постарайся.
    0x6258, // Мы утром начинаем бегать, помнишь?
    0x6297, // Вообще-то, я как раз забыл.
    0x62C7, // Я сейчас просто наслаждаюсь спокойным отдыхом.
    0x631E, // Гулять с ними по фестивалю оказалось весело.
    0x6370, // Да, я поставлю будильник.
    0x639E, // Попробуй только не прийти!
    0x63CF, // Я рассержусь, если ты не придёшь!
    0x640B, // Боже упаси.
    0x6420, // Думаю, Бог тут ни при чём.
    0x644E, // Если только не случится что-нибудь невероятное и твой будильник закоротит.
    0x64D8, // Тогда это может оказаться божественным провидением.
    0x6539, // Значит, не надо навлекать на себя никаких провидений.
    0x659B, // В моей голове начинает формироваться план.
    0x65EA, // План, на который моя совесть отзывается уколом вины, но я всё равно собираюсь привести его в исполнение.
    0x66A8, // Чёрт побери, я заслужил немного жареной пищи.
    0x66FB, // И вообще, я начинаю бегать только завтра, так?
    0x674E, // Значит, расписание заработает тогда, а не сегодня.
    0x67AA, // Следовательно диета тоже начинается завтра, следовательно сегодня мне можно позволить себе что-нибудь нездоровое.
    0x687E, // Своего рода последнее «прощай» всему тому, что я жадно ел до больницы.
    0x68FE, // Кстати, думаю, мне стоит вернуться в свою комнату.
    0x6959, // Надо доделать домашку, а раз я завтра собираюсь бегать, то мне надо лечь пораньше…
    0x69F0, // Снова эти прищуренные глаза.
    0x6A25, // Ты уверен, что не собираешься улизнуть и купить себе всякой жареной гадости?
    0x6AB1, // Не, я слишком сытый для этого.
    0x6AE7, // В подтверждение своих слов я похлопываю себя по животу.
    0x6B4D, // И к тому же вы всё равно меня обчистили.
    0x6B95, // Эми хихикает. Неожиданно приятный звук.
    0x6BDE, // Чувствую ещё один укол вины.
    0x6C12, // Она же должна понимать, что я ей вру, разве нет?
    0x6C67, // Или она настолько мне верит?
    0x6C9B, // Я чувствую себя чуть ли не чудовищем.
    0x6CDF, // Всё часть моего генерального плана, Хисао.
    0x6D2D, // Ну, тогда увидимся завтра утром.
    0x6D68, // Спасибо за угощение! И за компанию!
    0x6DA8, // А я-то думал, это она оказывает мне услугу.
    0x6DF5, // Рин утвердительно кивает.
    0x6E25, // Я не скажу «увидимся завтра», потому что это будет звучать как предсказание будущего, а я уверена, что на такое не способна.
    0x6F06, // Ладно.
    0x6F12, // Ладно, пока.
    0x6F28, // Странно, но я рад, что решился выйти сегодня из комнаты.
    0x6F8D, // Не самый плохой способ начать вторую неделю пребывания здесь, это уж точно.
    0x7017, // Убедившись, что скрылся с глаз Эми, я сразу же бегу к прилавкам с едой и покупаю пирожные.
    0x70B9, // По крайней мере, они не жареные, верно?
    0x70FF, // Это чуть лучше, чем я изначально планировал.
    0x7150, // Правда, мне всё равно неловко, что я соврал Эми.
    0x71A6, // Её ведь действительно беспокоит моё здоровье.
    0x71FB, // Я должен как-нибудь ей отплатить.
    0x7238, // Вернусь-ка я лучше к себе.
    0x7267, // К тому же у меня {b}есть{/b} важное дело.
    0x72AB, // Меня дожидается книга, и я плюхаюсь на постель, принимаясь читать её под вспышки фейерверков.
    0x7356, // Наконец начинает сказываться вся эта сегодняшняя ходьба (или, точнее, беготня).
    0x73E7, // Я и правда не в форме.
    0x740E, // Наверное, всё-таки неплохо, что Эми принудила меня начать бегать с ней по утрам.
    0x749F, // Я буду ждать этих пробежек.
    0x74D1, // Ну, я вступил в кружок рисования, так что, думаю, я пойду с ними.
    0x7543, // Что ты сделал?
    0x755D, // Вступил в кружок рисования.
    0x7590, // Чувак, это был неверный ход. Совсем неверный. Ты не представляешь, что за девушки в кружке рисования. Грустные, застенчивые милашки, которые вырвут твоё сердце и проглотят его.
    0x76D0, // Я уже знаю одну из кружка рисования и не могу представить, чтобы Рин вдруг стала убийцей-психопатом.
    0x7787, // Звучит неправдоподобно.
    0x77B4, // Не говори так. Не обманывай себя. Ты и понятия не имеешь, с чем столкнулся, чувак. Такие хуже всех.
    0x7864, // Они тебя втянут своими выкрутасами, а потом, когда меньше всего ждёшь, – БАМ!
    0x78F0, // Что – «бам»?
    0x7907, // Мой скептицизм немного сбивает Кендзи с толку, но он выглядит всё таким же безумным.
    0x79A1, // Это неважно.
    0x79B8, // Будь осторожен, чувак, будь осторожен.
    0x79FE, // Когда я заставляю себя выйти за парадную дверь, снаружи меня встречает радостный гомон толпы.
    0x7AAA, // Территория школы за один день и одно утро превратилась в площадку для праздника.
    0x7B3E, // Красочные плакаты выстроились вдоль главной дорожки от основного входа к зданию школы.
    0x7BDF, // Кто-то ещё перетаскивает снаряжение, но за большей частью прилавков уже стоят ученики, расслабленные и готовые к бою.
    0x7CB6, // Большинству сегодня пришлось встать пораньше, чтобы закончить приготовления.
    0x7D46, // Чувство вины набрасывается на меня, но скоро уходит прочь.
    0x7DB1, // Я, в конце концов, перевёлся совсем недавно.
    0x7E01, // Посетители уже прогуливаются между рядами.
    0x7E51, // Я вижу несколько молодых семей, в которых озабоченные родители стараются утихомирить своих веселящихся чад…
    0x7F1B, // …некоторое количество наших учеников в сопровождении родителей…
    0x7F96, // …и множество старого и малого люда, чью причину появления здесь я не могу даже представить.
    0x803E, // Из системы школьного вещания доносится звон колоколов, и директор объявляет скрипучим голосом об открытии праздника.
    0x8117, // Все вежливо аплодируют, пусть и без особого энтузиазма.
    0x817D, // Школьный фестиваль… В моей прежней школе они не проводились. Мне это кажется чем-то старомодным, особенно учитывая то, из какой школы я перевёлся, но всё же немного захватывающим.
    0x82C5, // Выходной день кажется слаще после первой недели тяжёлой работы, хоть я и пролежал до того четыре месяца на больничной койке.
    0x83A9, // Помнится, во время своего заточения в больнице я мечтал оказаться пусть даже на уроке математики, лишь бы не на койке.
    0x8480, // Не могу вспомнить программу фестиваля, несмотря на то что Муто как-то рассказывал о ней на уроке.
    0x8531, // Я начинаю спускаться по ступенькам общежития, собираясь обойти весь праздник и попробовать всё, что он может мне предложить, но добираюсь лишь до основания лестницы.
    0x8661, // Несколько человек изучают фреску Рин, а сама художница стоит, прислонившись к стене в нескольких шагах от неё, выглядя при этом так, будто тихо-мирно умирает со скуки.
    0x8791, // Доброе утро.
    0x87A8, // Привет.
    0x87B6, // Как идут дела?
    0x87D0, // Никак не идут.
    0x87EA, // Я застряла.
    0x87FF, // В смысле «застряла»?
    0x8825, // Это значит, что я не могу ходить. Думаю, мои ноги после вчерашнего вышли из строя.
    0x88B8, // Больно?
    0x88C6, // Сложно сказать. Наверное.
    0x88F5, // Нагрузка во время работы над фреской была больше, чем она давала понять. Я думаю, она просто слегка перегрузила мышцы или что-то вроде того. Я хочу расспросить её подробней, но Рин плавно меняет тему.
    0x8A5F, // Друзья учителя заходили.
    0x8A8D, // Потом они собрались в город на обед и пригласили меня. Хорошо, что мои ноги настолько устали.
    0x8B36, // Но ты осталась сидеть тут? Это плохо.
    0x8B79, // Я просто жду, пока снова смогу ходить. Это должно рано или поздно произойти.
    0x8C03, // Учитель был рад, что я закончила фреску.
    0x8C4C, // А как иначе?
    0x8C62, // Но я не знаю, на самом ли деле она закончена.
    0x8CB2, // Вот как?
    0x8CC1, // Вчера я думала, что сделала всё, но сейчас уже не уверена. Мне надо было нарисовать больше деталей. Может быть. Наверное. Очень трудно сказать наверняка.
    0x8DD6, // Законченная или нет, в ярком дневном свете фреска выглядит великолепно.
    0x8E5A, // Основной её элемент – разные части человеческого тела, в большинстве своём искажённые, снова и снова повторяющиеся в причудливых вариациях.
    0x8F5D, // Они кажутся грубыми, будто их бессмысленно разбросали и коряво покрасили, но в каждую деталь вложено много мысли и труда.
    0x903B, // А у этого из головы растёт лягушка?
    0x907B, // Это золотая рыбка.
    0x909D, // А что это?
    0x90AF, // Ничего.
    0x90BD, // Ну и ладно…
    0x90D3, // Стена настолько широка, что мне приходится крутить шеей влево-вправо, чтобы разглядеть всю картину.
    0x918A, // Это сложно оценить как единую композицию. Кажется, что части не подходят друг к другу, но я полагаю, что они всё же объединяются в целое.
    0x9281, // Пусть я понятия не имею, что изображает эта абстракция, но выглядит она красиво. И мне этого достаточно.
    0x933E, // Я устраиваюсь рядом с Рин, прислонившись к стене так же, как и она.
    0x93B6, // Весёлые звуки фестиваля становятся громче по мере прибытия всё новых и новых горожан.
    0x9454, // Общежития находятся далеко от основных аттракционов в главном здании и киосков, расположившихся в школьном дворе, так что большинство посетителей сюда ещё не добралось.
    0x958C, // На лице Рин появляется какое-то утомлённо-скучающее выражение, из-за чего она кажется отстранённой от всего, что происходит вокруг.
    0x967D, // Она удивительно немногословна. Может, виной тому сильная боль?
    0x96F0, // Ну так что люди искусства сказали о твоей фреске?
    0x974A, // Мой вопрос пробуждает Рин ото сна. Она лениво поворачивается ко мне.
    0x97C7, // Я не уверена.
    0x97DF, // Я думаю, она им понравилась? Наверное, так и есть.
    0x9838, // А ты сама? Ты довольна фреской? Раз я в некотором роде поучаствовал, то было бы ужасно, если бы ты осталась недовольна.
    0x990E, // Рин качает головой, прикусив нижнюю губу.
    0x995A, // Думаю, получилось сносно. Не плохо, но и не хорошо. Просто… получилось. У меня в голове нет никаких мыслей по этому поводу, ну и пусть.
    0x9A4C, // Можно ещё спросить? Что на самом деле изображено на картине? Я думал об этом вчера, когда ты сказала, что ничего.
    0x9B17, // Но это же логическая ошибка, ведь так? Нельзя создать что-то из ничего, даже в искусстве.
    0x9BB7, // Рин хмурится и, повернув голову, глядит на облака.
    0x9C12, // Я не знаю. У меня не очень-то получаются объяснения. Это просто фреска, в ней нет ничего особенного. Я говорила.
    0x9CDB, // Мои расспросы её, похоже, раздражают.
    0x9D1F, // Я не знала, что я буду рисовать, поэтому решила нарисовать просто фреску.
    0x9DA4, // На этой фреске изображена фреска.
    0x9DE2, // Нет, постой. Я сейчас подумала, что лучше сказать так: «Она изображает саму себя».
    0x9E76, // Значит… её фресочность на максимуме, настолько, насколько у меня получилось; так что если ты думаешь, что в ней есть некий смысл, то он примерно вот такой.
    0x9F8F, // Это бессмыслица.
    0x9FAE, // Значение… Я чувствую, как уголки моего рта поднимаются вверх, складываясь в улыбку с лёгкой тенью озабоченности.
    0xA07E, // Я никогда не понимал живопись в полном смысле слова.
    0xA0DE, // Мне знакомы основы – она является средством для обмена идеями и мыслями.
    0xA164, // Однако я не учился тому, как надо воспринимать предметы живописи, как прочувствовать то, что художник намеревался выразить посредством неё.
    0xA265, // Я знаю, что тут не нужно никакого специального умения, но мой мозг почему-то не может связать картину с чем-то иным, кроме воспринимаемого моими глазами. Всё, что я вижу, – лишь фреска.
    0xA3B2, // Я могу восхититься мастерством рисунка, в конце концов даже я знаю разницу между плохой живописью и средней, между средней и хорошей.
    0xA4A6, // Но я не способен ни на что большее, так что не спрашивай меня о её значении, Рин.
    0xA536, // После её ответа у меня пропадает желание расспрашивать её дальше.
    0xA5AF, // Так чем займёшься, когда встанешь на ноги?
    0xA5FC, // Ничем.
    0xA608, // Ничем? Но сейчас же фестиваль, разве тебе не хочется повеселиться?
    0xA681, // Мне и так хорошо.
    0xA6A0, // Ты не очень-то общительна, да?
    0xA6D6, // Думаю, сейчас я больше убеждаю её, чем себя. Хотя меня и самого фестиваль не особо волнует, мне слегка любопытно поглядеть, на что он похож, только и всего.
    0xA7EE, // Её ответ меня не удивляет.
    0xA81E, // Нет, не общительна.
    0xA841, // Да и я, в общем-то, тоже…
    0xA86D, // Если тебе хочется, то иди.
    0xA89C, // Знаю, но я могу составить тебе компанию. Я ещё не привык ко всему этому, так что никуда торопиться не собираюсь.
    0xA966, // Но могу и уйти, если ты хочешь побыть одна.
    0xA9B3, // Я была бы рада, если бы ты остался.
    0xA9F1, // Походив вокруг да около, мы наконец к чему-то приходим. Её ответ вызывает во мне чувство странной радости, поэтому я остаюсь.
    0xAAD4, // Мне нравится быть рядом с ней. Странная тёплая аура безмятежности, которую она излучает, делает молчание уютным. Я очень это ценю.
    0xABC1, // Мы молча глядим на проходящих мимо людей, пока все остальные весело общаются друг с другом.
    0xAC68, // Некоторые ученики ведут семьи к общежитиям, чтобы показать свои комнаты. Они проходят мимо нас и мимо фрески, взглянув, может, разок-другой.
    0xAD67, // Я больше думаю не о них, а о своей напарнице, пытаясь пробиться сквозь загадочную, нечитаемую стену её лица.
    0xAE2B, // Глаза Рин безустанно перебегают от одного проходящего мимо человека к другому.
    0xAEBD, // Ждёт ли она, что кто-нибудь остановится перед фреской, надеется ли втайне, что её творчество вызовет отклик?
    0xAF82, // Я не думаю, что в ней могут признать художницу. В конце концов, мы просто сидим тут, как парочка неприкаянных, а у неё даже нет рук.
    0xB06D, // Я вообще сомневаюсь, что Рин стала бы напрашиваться на комплименты. Она для этого кажется слишком нелюдимой.
    0xB134, // Мимо проходит всё больше людей, некоторые тычут пальцем во фреску, обмениваются словами, которые я не могу расслышать. Кто-то роняет себе на ботинок мороженое. Бедолага.
    0xB269, // Всем, похоже, нравится.
    0xB293, // Высказываю я предположение, вбросив тему в разделяющий нас спёртый летний воздух.
    0xB32A, // Рин отвечает не сразу, но я уже почти привык к подобным паузам. Она будто с большой осторожностью подбирает слова, во что, если честно, трудно поверить, учитывая, какая мешанина срывается с её языка.
    0xB492, // Я хотела создать её такой, чтобы на неё можно было просто глядеть не думая. А потом я поняла, что в этом нет смысла. Поэтому получилась смесь того и сего.
    0xB5A6, // Издалека кажется, будто кого-то стошнило стадом бабочек на стену. Именно то, чего не хотела та несносная президентша. Для этого есть слово?
    0xB6A3, // Что за слово?
    0xB6BB, // Такое. Каким словом называют скопище бабочек?
    0xB70F, // Бабочки?
    0xB71F, // Нет, как стадо, или косяк, или куча.
    0xB75E, // А. Я не знаю. Может, стая?
    0xB78A, // Может, людям нравится блевотина из бабочек.
    0xB7DA, // Рин смотрит на фреску с удивительно недовольным выражением лица.
    0xB852, // Середина могла быть куда лучше.
    0xB88C, // Обычно я люблю промежутки, но этот стал просто болью в заднице. Не буквально, конечно… но потом и она началась. Да, всё-таки, похоже, буквально.
    0xB98F, // Не будь к себе чересчур требовательной.
    0xB9D8, // Она одаряет меня изумлённым взглядом, но закрывает рот.
    0xBA3E, // Я начинаю задумываться, не стоит ли мне уйти и потратить своё воскресенье на что-нибудь более полезное.
    0xBAFB, // Это просто апофеоз замкнутости. Целый свободный день, праздник прямо за моей дверью, а что делаю я?
    0xBBAF, // Сижу тут с Рин; мы с ней словно два отщепенца, которым нечем заняться, кроме как думать, какая же это жалость – быть лишь наблюдателем.
    0xBCA3, // Даже осознав, насколько я жалок, я ничего не предпринимаю. Я не встаю и не иду отрываться в океане веселья.
    0xBD64, // *шорх-шорх*
    0xBD78, // *суетится*
    0xBD8B, // *шорх*
    0xBD96, // Рин беспокойно вертится, постоянно перекладывая одну ногу на колено другой и обратно.
    0xBE34, // На лице у неё страшно раздражённое выражение.
    0xBE88, // Что-то не так?
    0xBEA1, // Да. Нет. Да.
    0xBEB5, // Она внезапно вскакивает на ноги. Удивительно, я думал, она ещё обездвижена, но, выходит, нет.
    0xBF5C, // Мне надо пойти и разыскать Эми или кого другого, мне нужна кое-какая помощь.
    0xBFE6, // Я помогу.
    0xBFF7, // Нет, спасибо. Один из нас должен остаться здесь на всякий случай.
    0xC06D, // Не глупи. С тех пор как я сюда пришёл, не случилось абсолютно ничего интересного, не считая парня, который уронил мороженое на ботинок. Давай я тебе помогу, мне скучно.
    0xC19C, // Так в чём дело?
    0xC1B7, // Губы Рин плотно сжимаются, превращаясь в одну почти идеально горизонтальную линию.
    0xC250, // Она закрывает глаза и глубоко вздыхает.
    0xC299, // Когда она раскрывает веки, в её тёмных глазах читается пугающе суровое выражение, от которого мне делается не по себе.
    0xC371, // Хисао, хочешь ты это услышать или нет, я не знаю, но в любом случае ты не оставляешь мне иного выбора.
    0xC427, // У меня критические дни, и мне нужна помощь. Однако я не думаю, что наши отношения зашли так далеко, что я могу позволить тебе стянуть с меня нижнее бельё, находясь в женском туалете, даже если ты и предложишь.
    0xC59F, // Вот почему ты должен остаться здесь, а я – пойти искать Эми.
    0xC60C, // Кровь приливает к моим щекам, как набегающая волна, пока мозг безуспешно пытается найти ответ, но сейчас я могу думать только о том, что это самая разумная вещь, которую я услышал от Рин за четыре дня знакомства.
    0xC78C, // Ага.
    0xC794, // Не желая встречаться с Рин глазами, я отворачиваюсь в сторону, притворяясь, что гляжу на чьих-то родителей.
    0xC857, // Уголком глаза я замечаю, как Рин поворачивается на месте и без лишних раздумий отправляется прочь.
    0xC90C, // Мне хочется провалиться на месте.
    0xC94A, // Интересно, надолго ли ушла Рин… и вернётся ли она вообще?
    0xC9B3, // Некоторое время спустя она всё же возвращается, появившись словно из ниоткуда и присев там же, где была, – рядом со мной.
    0xCA8F, // Я вернулась.
    0xCAA6, // Произносит она ровным голосом, будто я ничего не сморозил. Я тоже предпочитаю обо всём забыть и молчу.
    0xCB60, // Время проходит в бездействии, солнечные лучи свысока падают на главное здание. Они бьют мне прямо в глаза, но я только щурюсь, вместо того чтобы подвинуться.
    0xCC7E, // Ещё немного, и становится больно даже чуть приоткрыть глаза, а виски начинает ломить.
    0xCD1A, // У меня голова разболелась. Не день, а головная боль, представляешь?
    0xCD94, // Ты голоден?
    0xCDA9, // И как это связано с головной болью?
    0xCDE9, // Никак. Я спросила, потому что сама проголодалась.
    0xCE43, // Её безразличная серьёзность смывает моё раздражение своей нелепостью, и я снова замечаю, как приподнимаются уголки моих губ.
    0xCF29, // Знаешь что? Я тоже.
    0xCF4B, // Пойду куплю нам еды. Чего бы тебе хотелось? Я угощаю.
    0xCFAA, // Всё равно.
    0xCFBD, // Вернувшись с едой, я отдаю одну порцию Рин, другую оставляю себе и, не говоря ни слова, мы принимаемся есть.
    0xD07F, // Рин смотрит вверх со свисающей из уголка рта вилкой.
    0xD0DF, // Что такое облака? Я всегда думала, что это мысли неба или типа того. Потому что их нельзя коснуться.
    0xD193, // Ты так думала, когда была ребёнком?
    0xD1D3, // Нет, на прошлой неделе.
    0xD1FD, // Может, потому что иногда мои мысли кажутся облаками. Пушистые, белые и неторопливые.
    0xD297, // Как будто небо оказалось у меня в голове. Как будто моя голова – небо.
    0xD316, // Небо твоего разума?
    0xD33A, // Закрой глаза и подумай о небе. Ты не сможешь думать ни о чём другом, пока не остановишься.
    0xD3DC, // Я пробую так сделать. Работает. Волшебство?
    0xD42B, // Открыв глаза, я вижу, как Рин изучающе смотрит на меня. Мне от этого неловко, потому что она ничего не говорит. Я отворачиваюсь.
    0xD511, // Облака – это вода. Испарившаяся вода.
    0xD556, // Знаешь, говорят, что почти вся вода в мире часть своего существования проводит в виде облаков.
    0xD602, // Каждая твоя капля слёз, крови или пота когда-нибудь станет облаком. И вся вода в твоём теле тоже отправится наверх после твоей смерти. Хотя это может занять какое-то время.
    0xD73A, // Твоё объяснение лучше любого из моих.
    0xD77F, // Потому что это правда.
    0xD7A8, // Должно быть.
    0xD7BF, // Я возвращаюсь к еде, пока она не остыла.
    0xD807, // Стена начинает отбрасывать на нас вожделенную тень, поскольку солнце продолжает своё путешествие по небесному своду.
    0xD8E0, // Но день уже плавно переходит в вечер, так что наш обед – скорее ужин. Или какое там слово можно подобрать для такого приёма пищи.
    0xD9CA, // Но, как его ни назови, он определённо вовремя. Я сто лет уже не ел.
    0xDA40, // Утолив голод, я издаю удовлетворённый вздох. Рин съела не всё, но тоже, видимо, закончила с едой.
    0xDAEE, // Я откидываюсь назад, наслаждаясь атмосферой. Толпа редеет, но звуки веселья пока не стихают. Все, похоже, с удовольствием проводят время.
    0xDBE8, // А почему бы и нет? Тепло, идеальный летний день, когда солнце греет жарко, но не слишком.
    0xDC87, // Солнце скоро сядет. Время и правда летит быстро.
    0xDCDF, // Мы сидим здесь уже шесть часов.
    0xDD18, // Да, верно.
    0xDD2A, // Тебе хочется заняться чем-то другим?
    0xDD6D, // Нет, не особо.
    0xDD86, // И мне тоже.
    0xDD9A, // Она меняет позу и прислоняется к стене, и я следую её примеру, давая расслабиться телу.
    0xDE38, // Мы сидим ещё несколько минут не говоря ни слова.
    0xDE90, // Я пытаюсь понять настроение Рин по её внешнему виду, по напряжению мышц лица, по слабым намёкам на какое-либо выражение, проплывающим по её лицу. Всё без толку. Она непроницаема, как всегда.
    0xDFE8, // Толпа накатывает то туда, то сюда, люди счастливо болтают друг с другом. Очень мало кто всерьёз уделяет внимание фреске, и ещё меньше людей – нам.
    0xE0F1, // Я рассеянно кручу в руках пару камешков.
    0xE13B, // Делать что-то просто ради того, чтобы что-то делать, – самая суть безделья.
    0xE1C3, // По миллиметру солнце клонится всё ниже к веткам деревьев, меняя цвет неба при приближении к горизонту с жёлто-золотого до оранжевого, а потом до красного, говоря нам, что закат уже рядом.
    0xE317, // После такой плотной трапезы желудок будто полон свинца, но кирпичная стена кажется удивительно приятной подушкой для спины.
    0xE3FC, // Я пытаюсь бороться с напавшей на меня дремотой, но безуспешно.
    0xE46E, // Вздрогнув, я просыпаюсь.
    0xE49B, // Низкий грохот сотрясает школьную территорию. В моих глазах пляшут, как звёзды, шлейфы ярких искорок.
    0xE553, // Что-то взмывает к небесам со стороны стадиона.
    0xE5A8, // За ним тянется огненный хвост, а затем следует вспышка, освещающая небо высоко над школой красными и жёлтыми огнями с ещё одним громким хлопком.
    0xE6B0, // Фейерверки.
    0xE6C6, // Внезапная вспышка света на холсте ночного неба разбудила меня, заставив осознать, что уже давно стемнело.
    0xE788, // Долго я спал? Я едва могу пошевелиться и не чувствую правую руку.
    0xE7FE, // Пытаясь её согнуть, я понимаю почему.
    0xE842, // Рин всем весом облокотилась на моё плечо, почти что упав мне на колени.
    0xE8C3, // Она крепко спит, и даже фейерверки не тревожат её сон.
    0xE925, // Рот слегка приоткрыт, а глаза мирно сомкнуты. Невинное лицо спящего ребёнка.
    0xE9B1, // Я осторожно трясу Рин свободной рукой, стараясь её разбудить или, если не удастся, подвинуть так, чтобы высвободить вторую руку.
    0xEA9B, // Лицо Рин дёргается, и её веки сжимаются плотнее, как будто сопротивляясь пробуждению.
    0xEB38, // Она постепенно открывает глаза, но оставляет их полуприкрытыми. Свет фейерверков проникает сквозь её ресницы, отражаясь яркими вспышками в зелёной радужке; затем она поднимает взгляд на меня и хмурит брови.
    0xECB4, // Ещё немного, ладно?
    0xECD7, // Голос Рин сонный и неторопливый, её почти неразборчивое бормотание лениво повисает в воздухе.
    0xED84, // Похоже, она не вполне осознаёт ситуацию.
    0xEDCE, // Рин снова роняет голову мне на плечо, наваливаясь на меня всем своим весом.
    0xEE57, // Она ворочается под боком, устраиваясь поудобней и одновременно лишая меня всякого удобства.
    0xEF01, // Я отчётливо чувствую тепло Рин и то, как вздымается и опадает грудь девушки, касающаяся моей руки; вскоре её дыхание возвращается к размеренному ритму.
    0xF016, // Не могу не позавидовать её способности засыпать несмотря ни на что, а также её непосредственности, позволяющей использовать как подушку того, кого знаешь меньше недели.
    0xF14C, // Ракеты по одной взмывают в небо, распускаясь красными, зелёными и золотыми цветами, – и всё это сопровождается охами и ахами зрителей.
    0xF242, // Я пытаюсь выкинуть сбивающую с мыслей близость Рин из головы, ибо что я могу поделать? Я только надеюсь, что её «ещё немного» не слишком затянется.
    0xF34D, // Один за другим блистающие всполохи рождаются и умирают за краткий миг, раскрашивая тёмное ночное небо и превращая его в постоянно изменяющуюся абстрактную картину.
    0xF47C, // Я слушаю низкое буханье взрывов и тихое дыхание Рин, понемногу прочищая голову от сонного дурмана.
    0xF531, // К счастью, Рин просыпается до окончания фейерверков.
    0xF592, // Я заснула.
    0xF5A5, // Наконец она полностью открывает глаза и несколько раз моргает.
    0xF619, // Ты заснула на мне. Дважды.
    0xF648, // Тебе не понравилось?
    0xF66E, // Э-э… Ну-у…
    0xF682, // Не обращая внимания на мою запинку, Рин выпрямляется, отстраняясь от меня.
    0xF70A, // Ты тяжёлая.
    0xF71F, // Это неправда – она весит всего ничего, – но мне надо хоть чем-то её попрекнуть, пусть даже это удар ниже пояса. Моя насмешка не оказывает на Рин никакого воздействия, поскольку её внимание устремлено вверх, к вспышкам фейерверков.
    0xF8C3, // Она кажется загипнотизированной игрой их красок.
    0xF91E, // Лёгкое колющее ощущение пробегает по моей руке, когда кровь вновь начинает течь по венам. Оно неприятное, но позволяет мне избавиться от головокружения.
    0xFA36, // Всё больше и больше ракет взмывает к небу, яркие цвета разрывов отражаются на облаках.
    0xFAD4, // Мы оба не отрываясь глядим на фейерверк сквозь полог деревьев, зачарованные представлением.
    0xFB7E, // У нас мог бы быть куда лучший вид на небо, сдвинься мы всего на несколько метров, но никто даже и не думает внести такое предложение.
    0xFC6E, // Я очень люблю фейерверки, пусть мне от них и становится как-то грустно. Как будто им очень хочется, чтобы ты взглянул на них, какие они громкие и яркие, но только поглядишь – а их уже нет.
    0xFDBF, // Как будто они даже не реальны.
    0xFDF6, // Они настоящие, точно тебе говорю.
    0xFE33, // Всё это… настоящее, понимаешь?
    0xFE6C, // Если задуматься, то ничто на самом деле не длится долго. Даже что-то вроде моей жизни или твоей – это лишь миг в истории мира, как одна из тех ракет. Хлоп – и нас нет.
    0xFF96, // Но мы живём, не так ли?
    0xFFBE, // Да, это реальность. Рин, сидящая рядом со мной, громкие взрывы фейерверков, широкое, бескрайнее небо. Эти вещи определённо настоящие, даже если они не останутся надолго.
    0x100F1, // Я чувствую тепло в груди и гадаю, вызвано ли оно близостью Рин или же я просто рад быть живым.
    0x1019A, // Не представляю, что на это ответить.
    0x101DC, // Да ничего… наверное, я просто разговариваю сам с собой.
    0x10242, // Знаешь, фейерверки прекрасны… Но в конечном счёте разве не глупо тратить столько денег на горстку искорок, рассыпающихся в долю секунды?
    0x1033E, // Рин отрывает взор от всё ещё продолжающегося представления и отстраняется, глядя на меня с неприязненным выражением.
    0x10416, // Ух ты, никогда бы не подумала, что ты такой циник.
    0x1046F, // Циник – довольно грубое слово. Предпочитаю называть себя реалистом.
    0x104ED, // А разве «реалист» – не то слово, которым циники обычно себя называют?
    0x1056C, // Последняя ракета взрывается серебряными и голубыми искрами, на мгновение накрывая школу зловещей тишиной, а затем толпа начинает двигаться к главному выходу, напоминая стадо.
    0x106AF, // Клочки серого дыма плывут к общежитию со стадиона. Резкий серный запах пороха, который они несут с собой, кажется пропитывает мою одежду и волосы.
    0x107BA, // Что, всё?
    0x107CA, // Вроде бы да.
    0x107E0, // Я встаю и потягиваю пострадавшую спину. Спать, прислонившись к кирпичной стене, всё же не лучшая идея.
    0x1089A, // Рин тоже встаёт и поворачивается ко мне. Она явно устала, её глаза выжидательно смотрят на меня.
    0x10949, // Несмотря на то что ей обычно с трудом удаётся сосредоточить взгляд, сейчас она глядит прямо на меня – такое за прошедшую неделю случалось нечасто.
    0x10A56, // Так… значит…
    0x10A70, // Я вдруг понимаю, что это было почти что свидание, пусть и спонтанное. Пусть даже мы ничего и не делали.
    0x10B29, // Но это было и не совсем свидание… но почему же у меня тогда краснеют щёки и я запинаюсь?
    0x10BC9, // Не знаю, что мне сказать Рин, явно ожидающей моих слов, но, к счастью, она решает этот вопрос за меня.
    0x10C7E, // Спокойной ночи, Хисао.
    0x10CA7, // Она одаряет меня продолжительным взглядом, оглядывая с головы до пяток, затем разворачивается на месте и удаляется, растворяясь в толпе.
    0x10DA2, // Да… Доброй ночи.
    0x10DC1, // Я остаюсь в одиночестве, давая ответ прохладному ночному воздуху.
    0x10E3A, // Эх.
    0x10E40, // Ничего подобного я от фестиваля не ожидал.
    0x10E8E, // Мы с Рин провели целый день на одном месте, хоть никто из нас и не предлагал что-либо сделать.
    0x10F37, // У меня просто не нашлось занятия получше, и, очевидно, у неё тоже.
    0x10FAD, // Тепло тела Рин ещё ненадолго задерживается в моём теле, прежде чем раствориться в наступающей ночи.
    0x11064, // …Точно. Я знаю, что мне делать. Пусть это лишь один человек, но я сделаю фестиваль более приятным для неё.
    0x11123, // Я кладу чашу на прилавок и зову Лилли.
    0x11168, // А, Хисао. Возвращаешь её, да?
    0x1119B, // Да, вот.
    0x111A9, // Я сую плошку ей в руки, и она передаёт её тем, кто, видимо, отвечает за мойку посуды. Прежде я их не видел, так что это, вероятно, наказанные за опоздание.
    0x112BB, // Хм, Лилли?
    0x112CD, // Снова услышав мой голос, она поднимает голову и возвращается к прилавку, осознав, что я ещё тут.
    0x1137B, // Хочешь, пойдём получше посмотрим на фестиваль?
    0x113D1, // Она неодобрительно надувает щёки. Выглядит довольно мило, представляя собой полную противоположность её обычной сдержанной натуре.
    0x114C5, // Требуется несколько секунд, прежде чем до меня доходит, в чём дело. Опаньки.
    0x1154F, // Ой… я имел в виду, не…
    0x11578, // Лилли хихикает, показывая, что это был лишь розыгрыш.
    0x115D9, // Ты всё ещё не привык к школе, да?
    0x11613, // Она меня подловила.
    0x11637, // Но всё же… Мне, пожалуй, надо остаться за прилавком. Нам только сейчас удалось наконец всё распаковать.
    0x116F4, // Думаю, её нежелание не должно меня слишком удивлять, учитывая, сколько труда она в это вложила.
    0x117A1, // Но сейчас-то всё уже в порядке. Да и к тому же к тебе пришла подмога.
    0x1181B, // Парень, занятый приготовлением лапши соба, ухмыляясь, поворачивается к нам.
    0x118A6, // Давай, Лиль, ты заслужила передышку. Мы пока удержим форт.
    0x1190F, // Раз ты так говоришь, то я думаю, что можно…
    0x1195D, // Но если будет нужна какая-либо помощь…
    0x119A5, // То мы тебя позовём. Иди, у нас всё схвачено.
    0x119F3, // Он машет на Лилли своей лопаточкой, и она наконец прекращает сопротивляться. На ощупь обходя прилавок, она подбирает по дороге свою трость.
    0x11AF2, // Пожалуй, первым делом нам нужно поискать Ханако. Лилли, видно, волнуется за неё, да и я сомневаюсь, что в её характере в одиночку гулять среди толпы.
    0x11BFE, // Так, я думаю, мы должны поискать Ханако. Откуда начнём?
    0x11C61, // Хм…
    0x11C69, // Мы оба на миг замолкаем, раздумывая.
    0x11CAB, // Может, в её комнате в общежитии?
    0x11CE5, // Вряд ли. У неё там мало вещей, так что ей нечего там делать.
    0x11D4F, // …А! Библиотека?
    0x11D6C, // Не самое плохое место для поисков заядлой читательницы, я полагаю.
    0x11DE6, // Значит, библиотека. Проверим сначала там.
    0x11E32, // За исключением приглушённых звуков толпы, просачивающихся снаружи, внутри школа кажется почти заброшенной.
    0x11EF9, // Видимо, чтобы обеспечить всех достаточным простором, все мероприятия были устроены снаружи, на школьных угодьях. Они действительно очень велики по меркам любой другой школы.
    0x12039, // Здесь тихо и уютно, не правда ли?
    0x12074, // Ага. Куда уютнее, чем тот шум и гам снаружи.
    0x120C2, // Мы не торопимся и медленно проходим по первому этажу школы, добираясь в итоге до лестницы на второй этаж.
    0x12182, // Я замечаю, что Лилли словно знает, когда на её пути появится дверь или какое-нибудь препятствие, не шевеля тростью, но скользя рукой вдоль перил коридора.
    0x1229A, // Ты в самом деле знаешь школу наизусть, да?
    0x122E6, // Она улыбается и сразу кивает.
    0x1231C, // Я здесь уже несколько лет, поэтому знаю, где что находится.
    0x12387, // Хотя общежития иногда сбивают меня с толку. Я не так часто там бываю, и планировка у них не такая продуманная, как в главном здании.
    0x12475, // Если я правильно помню, они раньше были бесхозным строениями, прежде чем их подновили и открыли в них общежития.
    0x12542, // Это объясняет, почему мужские и женские корпуса выглядят по-разному и почему комнаты в них довольно необычной для своего назначения планировки.
    0x1264B, // Я предполагал, что она жила в общежитии с тех пор, как начала ходить в школу, но сейчас припоминаю сказанное ей вчера.
    0x12720, // Да, точно, ты уже упоминала об этом.
    0x12760, // Я полагал, что большинство учеников жили в общежитиях с самого момента их зачисления. Или что таких по крайней мере немало.
    0x12841, // На лице Лилли появляется выражение, которое я не могу прочитать, – своим вопросом я, видимо, задел деликатную тему.
    0x12913, // Хм… Как бы лучше выразиться…
    0x1294A, // У всех… свои причины.
    0x12972, // Что-то мне подсказывает, что одной из таких, «имеющих свои причины», является Ханако, вот Лилли и осторожничает с ответом. Моё собственное положение служит ещё одним примером.
    0x12AB2, // Полагаю, это выбор, который каждый делает для себя… или же, как в моём случае, подобный выбор делают за них.
    0x12B75, // Думаю, тут ничего не поделаешь. По крайней мере, «Ямаку» кажется вполне милым местом.
    0x12C10, // Рада слышать это от тебя. Я боялась, ты возненавидишь «Ямаку».
    0x12C81, // А что насчёт тебя?
    0x12CA2, // Мой вопрос, заданный в ответ на утверждение Лилли, застаёт её врасплох.
    0x12D24, // Я здесь уже давно, так что…
    0x12D56, // Я не об этом. Ты кажешься довольно расстроенной из-за Акиры.
    0x12DC3, // Хм~
    0x12DC9, // Это ещё что за выражение?
    0x12DF7, // Акира занята. Извини, Хисао.
    0x12E2A, // Лилли не видит, как быстро я подношу ладонь к лицу от этого её обвинения.
    0x12EAE, // Эй, я беспокоился за тебя. Так не отвечают на заботу.
    0x12F0D, // Она награждает меня усмешкой, в то время как мы проходим коридор и входим в библиотеку.
    0x12FAC, // Сделав это, мы без труда обнаруживаем Ханако, ведь больше в комнате никого нет.
    0x1303C, // А раз никого из сотрудников поблизости тоже не наблюдается, то и нужды соблюдать обычные библиотечные правила нет.
    0x1310F, // Эй, Ханако.
    0x13123, // Ханако тут?
    0x13138, // Услышав наши голоса, Ханако поднимает голову из-за книги, вероятно той же самой, что она читала в пятницу.
    0x131F8, // Хисао? Лилли?
    0x13210, // Да вот, решили заглянуть. Лилли только что удалось сбежать из лапшичного киоска… с небольшой помощью.
    0x132CB, // Это был не совсем побег…
    0x132F9, // Ханако хихикает, на мгновение удивляя нас обоих.
    0x13352, // Я как раз беспокоилась о том, что… Лилли сейчас может не веселиться на фестивале.
    0x133E7, // Ну, теперь мы можем наслаждаться им вместе, да?
    0x1343C, // Они обе радостно кивают, и мы выходим из библиотеки навстречу веселью.
    0x134BD, // Я передаю немного мелочи девушке за кассой и беру два пластиковых стаканчика с чаем. Я кланяюсь чуть ниже, чем следует, так как девушка явно глуха.
    0x135C8, // Если подумать, мне, наверное, стоило попросить этих двоих помочь мне, а не оставлять их в сквере, а самому идти за напитками.
    0x136A9, // Жонглировать двумя стаканами с горячим чаем (для них) и банкой кофе (из автомата, для меня) не очень-то просто.
    0x13770, // С помощью осторожных манёвров мне удаётся сохранить всё в стабильном и вертикальном положении к тому моменту, как я подхожу к скамейке, на которой сидят и болтают Лилли и Ханако.
    0x138B6, // Это довольно неплохое место. Освещённое лишь лунным светом, оно находится на некотором удалении от самой гущи событий.
    0x13990, // По сравнению с тем, каким знойным оно было днём, сейчас тут довольно прохладно.
    0x13A20, // Не то чтобы это что-то значило. Большинство посетителей ушли поближе к месту запуска фейерверков или поднялись на холм, чтобы получше увидеть запланированное представление.
    0x13B5F, // С возвращением, Хисао.
    0x13B88, // У неё хороший слух. Я довольно далеко, и даже Ханако меня ещё не видит.
    0x13C07, // Вот, держите. Извините, что из пакетика, но это всё, что у них осталось.
    0x13C86, // Ханако осторожно берёт стакан из моей правой руки, и я аккуратно вкладываю второй в протянутую руку Лилли.
    0x13D49, // Понравился тебе фестиваль, Хисао?
    0x13D87, // Да, было довольно весело.
    0x13DB5, // Отвечаю я честно. Большая часть еды была не ахти, но зато под конец было и правда весело, особенно с Ханако и Лилли.
    0x13E85, // На самом деле я думаю, эти двое повеселились даже больше моего. Из-за нашего с Лилли присутствия замкнутость Ханако, обычно проявляющаяся в окружении других людей, уменьшилась настолько, что она начала получать удовольствие от происходящего.
    0x14041, // Пока мы сидим и пьём, раздаётся первый залп фейерверка, взрывающегося ярким дождём синих искр на фоне ночного неба, провозглашая начало конца фестиваля.
    0x14159, // Его приветствуют весёлые крики из групп отдыхающих, разбросанных тут и там по школьной территории.
    0x1420F, // Мы с Ханако несколько минут наблюдаем за фейерверками в небе, а Лилли спокойно слушает их с закрытыми глазами.
    0x142D9, // Красные, зелёные, жёлтые, в форме звёзд, кругов и узоров всех форм и расцветок, один за другим они наполняют воздух, танцуя по небу.
    0x143C6, // Нигде рядом с моим прежним жильём не устраивалось такое щедрое представление. Фестивали, подобные этому, в больших городах канули в лету.
    0x144C2, // Наблюдать подобное зрелище вместе с ними… Наверное, это лучшее, что со мной случалось за последнее время.
    0x14584, // Ну, вот и всё. Фестиваль подходит к концу.
    0x145CF, // Она грустно вздыхает.
    0x145F7, // Как бы я ни жаловалась на то, что на нас свалилось много хлопот, всё-таки жаль, что нам предстоит выпуститься до следующего фестиваля «Ямаку».
    0x146F9, // Я делаю несколько шагов вперёд, подходя к Лилли, и мягко кладу руку ей на плечо.
    0x14789, // Не волнуйся. Мы в этом году ещё успеем сходить на Танабату, верно?
    0x14800, // Ты прав. Было бы здорово сходить на этот праздник вместе.
    0x14868, // Проходят минуты молчания, сопровождаемые лишь взрывами фейерверков.
    0x148E7, // Глядя на них двоих, я вспоминаю совет, который Лилли дала мне, когда мы вместе ходили в город.
    0x14990, // «Тебе стоит ценить возможность завести новых друзей», а?
    0x149F8, // Эй, Лилли?
    0x14A0A, // Она слегка поворачивает голову, показывая, что слушает. Ханако тем временем по-прежнему не отрывает взгляда от сочных цветов фейерверка над головой.
    0x14B1B, // Ты не против, если я и впредь буду пить с вами чай?
    0x14B75, // Улыбка на её лице служит мне наилучшим ответом.
    0x14BCC, // Буду рада, Хисао.
    0x14BEB, // Лилли, похоже, не в лучшем настроении, и я не могу её винить.
    0x14C57, // Помимо проблем с киоском ей, похоже, приходится волноваться за Ханако.
    0x14CD8, // С первым я не могу ей по-настоящему помочь, так что, думаю, единственный для меня способ оказать ей помощь – снять с неё заботу о нашем общем застенчивом друге.
    0x14DFA, // Поставив плошку на прилавок, я зову Лилли.
    0x14E47, // Эй, Лилли, не волнуйся за Ханако. Я обязательно прогуляюсь с ней, когда отыщу, договорились?
    0x14EED, // Я вижу, как на лице Лилли появляется выражение облегчения.
    0x14F58, // Спасибо, Хисао. И, если заметишь кого-нибудь из моего класса, будь добр, скажи им зайти сюда.
    0x14FFE, // Обязательно. Желаю приятно провести время. И не забудь сделать перерыв, хорошо?
    0x1508F, // Если получится. Увидимся позже, Хисао.
    0x150D5, // Я оставляю Лилли за прилавком и направляюсь на поиски Ханако.
    0x15146, // Я отчасти виню себя за то, что оставил её одну, но, пусть на её долю и выпала немалая нагрузка, мне всё же кажется, что она вполне довольна.
    0x1523F, // Проходы забиты колышущейся толпой, слоняющейся туда-сюда по праздничным угодьям.
    0x152D5, // Если я что-то знаю о Ханако, так это то, что она к такому даже не приблизится.
    0x1535F, // И, учитывая, что некоторые ученики показывают друзьям и семье свои комнаты в общежитии, сомневаюсь, что она найдётся и там.
    0x1543F, // Положившись на слепую интуицию, я неохотно погружаюсь в людскую массу.
    0x154C1, // К счастью, толпа не такая шумная, как обычно бывает на праздниках, – я предполагаю, из предупредительности к физическим недостаткам учеников.
    0x155C5, // Я пробиваюсь сквозь скопления людей, и вскоре они редеют, а позже и вовсе исчезают.
    0x1565C, // Неудивительно, учитывая, что я стою перед библиотекой.
    0x156C0, // Даже самые дотошные из учеников не станут никому показывать эту часть школы.
    0x1574D, // Когда я захожу внутрь, шум праздника тает позади, превращаясь в глухое гудение где-то на заднем плане, и вскоре я оказываюсь в отведённой для чтения дальней части помещения.
    0x15889, // Позади одного из огороженных столов я замечаю чью-то макушку с тёмными прямыми волосами, привлекающую моё внимание.
    0x1595E, // Привет, Ханако. У меня было чувство, что я найду тебя здесь…
    0x159CB, // Она вздрагивает от изумления, прежде чем медленно показаться над перегородкой.
    0x15A5D, // Х-Хисао?
    0x15A6C, // Ага. Лилли изрядно занята, так что послала меня найти тебя.
    0x15AD7, // В-вот как. Хочешь присесть?
    0x15B08, // Вообще-то я слегка голоден. Не хочешь пойти перехватить чего-нибудь с лотков?
    0x15B95, // Ум… Я… Я взяла с собой еду, поэтому…
    0x15BD9, // Что и неудивительно, но всё-таки попытаться стоило. Ожидать, что она выйдет сегодня наружу, – слишком смелое предположение.
    0x15CBB, // А как насчёт поесть в чайной комнате? Я прошёл мимо неё по пути сюда, и там никого не было.
    0x15D5D, // Там мы сможем заварить себе чай, и вообще так будет удобней. Что скажешь?
    0x15DE1, // К-конечно. Пойдём.
    0x15E02, // Ханако закрывает книгу и отработанным движением откладывает её в сторону.
    0x15E8B, // Готова к походу?
    0x15EA9, // А… ага.
    0x15EB7, // Мы выходим из библиотеки в направлении чайной комнаты.
    0x15F1C, // Как и ожидалось, вокруг ни души.
    0x15F56, // Если бы не доносящийся из-за стен гомон толпы, то и не скажешь, что снаружи сейчас большое празднество.
    0x16011, // Ханако несёт портфель обеими руками и глядит в пол.
    0x1606F, // Время от времени она, кажется, делает короткие шажки вместо обычных.
    0x160EC, // В первый раз я не обращаю внимания, но вскоре замечаю, что она делает так постоянно.
    0x16184, // С тобой всё в порядке?
    0x161AC, // Она резко замирает на полушаге.
    0x161E6, // Ч-что?
    0x161F1, // Не знаю… Кажется, будто ты спотыкаешься или типа того…
    0x16257, // Розовый румянец окрашивает её щёки, и взгляд её снова утыкается в пол.
    0x162D7, // Нет… всё в порядке.
    0x162FB, // Знаешь, когда ты вот так говоришь «всё в порядке», то прямо подталкиваешь задать тебе ещё вопрос.
    0x163AC, // Секунду мне кажется, что она не ответит.
    0x163F5, // Приготовившись оставить эту тему, я собираюсь снова отправиться дальше, как…
    0x16484, // Это… игра.
    0x16498, // Игра?
    0x164A2, // Ты… видел, какие тут полы?
    0x164D2, // Странный вопрос. Полы выглядят точно как любые другие полы, расчерченные ячейками из квадратов линолеума.
    0x16595, // Ничего примечательного.
    0x165C2, // Ну, да. А что с ними?
    0x165E5, // Иногда… когда никого нет рядом… я наступаю только на тёмные…
    0x16658, // Голос Ханако становится всё тише и тише по ходу объяснения, до такой степени, что я едва могу её расслышать в звенящей тишине пустого коридора.
    0x1675D, // Тёмные?
    0x1676B, // Шаркнув ногой, Ханако указывает носком своей туфли на кусочек, который выглядит чуть-чуть темнее прочих.
    0x1682B, // В-вот такие.
    0x16841, // А, понятно. Значит, вот эти не годятся?
    0x16886, // Я показываю на соседний квадратик.
    0x168C6, // А-ага. Примерно… примерно так.
    0x168FE, // Угу, ясно. Ты часто так играешь?
    0x16937, // Ханако качает головой.
    0x16961, // Только когда в коридорах пусто?
    0x1699B, // Она кивает.
    0x169B0, // Что ж, не будем задерживаться, а то скоро я по-настоящему проголодаюсь.
    0x16A31, // Она снова кивает, на сей раз с большим воодушевлением.
    0x16A94, // Ну, тогда пойдём.
    0x16AB3, // Мы продолжаем путь по коридору, но на этот раз я замечаю, что Ханако чуть реже глядит на пол.
    0x16B5A, // Интересно, насколько человек должен быть одинок, чтобы додуматься до игры вроде этой?
    0x16BF7, // Не успев понять, что я делаю, я замечаю, что стараюсь выверять каждый шаг, чтобы наступать только на правильные квадратики.
    0x16CD7, // В чайной комнате шум фестиваля слышен чуть сильнее, но ветерок, дующий из открытого окошка, того стоит.
    0x16D93, // Я не раздумывая подхожу к подоконнику и делаю глубокий вдох. Иногда я забываю, насколько легко здесь дышится по сравнению с моим родным городом.
    0x16E9B, // Ты… будешь чаю?
    0x16EB8, // Было бы здорово, спасибо.
    0x16EE6, // Мне приходит в голову, что это первый раз, когда я остаюсь наедине с Ханако и при этом она не пытается куда-нибудь сбежать.
    0x16FC4, // Отвернувшись от окошка, я гляжу, как она заваривает чай в простом чайничке и выкладывает на тарелку несколько бутербродов.
    0x170A5, // Я не раз видел, как она это делает, но сейчас она кажется чуть другой.
    0x17122, // Как будто она…{w} спокойна.
    0x17153, // Вскоре она опускает на стол маленький поднос и наливает две чашки чая.
    0x171D4, // Аромат свежезаваренного чая смешивается с ветерком, и на миг мне представляется, будто я нахожусь с миром один на один.
    0x172AE, // Пожалуй, теперь я понимаю, почему тебе нравится эта комната.
    0x1731C, // Эм… Я не совсем поняла, о чём ты.
    0x17357, // Ну, там, подальше, немало народу, но здесь будто совершенно другой мир.
    0x173D7, // Можно вообразить, что тут нет никого на километры вокруг.
    0x17440, // И-и верно.
    0x17452, // Словно мир позабыл об этой комнате.
    0x17493, // И п-поэтому можно забыть о том, что снаружи.
    0x174E2, // В некоторых случаях это привлекательно.
    0x1752C, // Насколько я могу судить, издевательства в своей классической форме в этой школе не практикуются.
    0x175DE, // Но при всём при том я не видел ни единого человека, разговаривающего с Ханако, кроме Лилли.
    0x17683, // Если тебя игнорирует мир, то место, где ты можешь забыть о его существовании, будет обладать особой притягательностью.
    0x1775C, // Верно, в этом её плюс. Эта комната словно дарит нам своего рода свободу.
    0x177DE, // Д-да.
    0x177E7, // Скажи… А ты в шахматы играешь?
    0x1781F, // Шахматы? Думаю, немножко умею.
    0x17856, // Я так понимаю, ты раньше играла?
    0x17890, // Чуть-чуть…
    0x178A5, // Ханако, не проронив более ни слова, подходит к одному из буфетов и достаёт из него маленький шахматный набор.
    0x1796C, // Ты… ты хочешь…
    0x17989, // Конечно, почему бы нет?
    0x179B3, // Я прерываю её на полуслове, но она, очевидно, не в обиде.
    0x17A18, // Мы расставляем фигуры и вскорости уже посылаем пешек навстречу их неизбежной судьбе.
    0x17AB5, // Я не тороплюсь и внимательно изучаю каждый ход и его последствия, и ностальгия по игре отходит на задний план.
    0x17B7E, // Поначалу игра представляет собой длительную войну на истощение, но тут я замечаю брешь в её построениях и прорываю линию обороны.
    0x17C6C, // Спустя несколько ходов её король попадает в окружение моих фигур.
    0x17CE5, // Шах и мат.
    0x17CF7, // А ты неплохо играешь, да?
    0x17D24, // Честная оценка. Её техника довольно хороша, но несколько раз мне удалось использовать её слабость в предвидении.
    0x17DF3, // Я поднимаю фигурку к глазам и внимательно её рассматриваю. Она кажется относительно новой, но уже потрёпанной.
    0x17EBE, // Я… я думаю, нет.
    0x17EDB, // А Лилли играет?
    0x17EF7, // Пауза перед ответом Ханако заставляет меня задуматься над своим вопросом.
    0x17F80, // Н-немножко…
    0x17F97, // Э-это первый раз, когда я играла с кем-то… кроме неё или…
    0x17FFF, // Или?..
    0x18009, // Она резко обрывает себя, а мой вопрос остаётся невысказанным. Видимо, она имела в виду человека, которого знала ещё до поступления в «Ямаку».
    0x1810A, // Что ж, я польщён, что мне довелось с тобой сыграть.
    0x18165, // Эм-м… Мы можем сыграть ещё?
    0x18197, // Она спрашивает так неуверенно, будто просит меня отрезать себе руки. У неё разыгрался азарт?
    0x18240, // Конечно. Хотя на сей раз не жди от меня пощады…
    0x18296, // Хотя не то чтобы я поддавался раньше. Боевой настрой ей, похоже, нравится.
    0x1831C, // И… и ты от меня тоже…
    0x18344, // Только мы расставляем фигуры, как вдруг до нас доносится стук в дверь.
    0x183C4, // Добрый день.
    0x183DB, // Лилли…
    0x183E9, // О… С возвращением, Лилли. Ты уже закончила?
    0x18438, // Значит, вы здесь? Чудесно. Учитель попросил помочь других ребят, так что мне наконец-то удалось освободиться. Вы тут с тех пор, как ты ушёл, Хисао?
    0x1853F, // Большую часть времени. Мы немножко поиграли в шахматы.
    0x185A3, // Н-не хочешь выпить чашечку чая?
    0x185DC, // Если честно, у меня появилась, как мне кажется, довольно неплохая идея: прогуляться за пределы школы…
    0x18696, // Ханако мгновенно падает духом, что сразу же отражается на её лице, хоть она ничего и не говорит.
    0x18744, // Я почему-то чувствую себя обязанным озвучить отражённые на лице Ханако мысли, которые ясно вижу я, но не может увидеть Лилли.
    0x18828, // Мне… мне кажется, что нам стоит остаться здесь…
    0x18881, // В самом деле? Сейчас в школе слишком людно, и поэтому я подумала, что мы могли бы сходить в расположенный неподалёку чайный дом.
    0x18969, // Ты имеешь в виду «Ш-Шанхай»?
    0x1899C, // Именно. Пока все на фестивале, там должно быть практически пусто.
    0x18A13, // Чайный дом?
    0x18A28, // Ах да, кажется, мы тебе о нём ещё не рассказывали.
    0x18A81, // Этот чайный дом находится совсем неподалёку отсюда, и мы посещаем его время от времени.
    0x18B21, // А что, неплохая идея. Ханако, как думаешь?
    0x18B6C, // Вовлечённая в разговор против своей воли, Ханако слегка вздрагивает, но зато сосредотачивается.
    0x18C1D, // Ес… если в «Шанхай», то ладно.
    0x18C54, // В таком случае решено. Пойдёмте.
    0x18C8F, // Мы с Ханако встаём из-за стола, прерывая шахматную партию.
    0x18CF9, // Не успеваю я и глазом моргнуть, как Ханако собирает фигурки в маленький ящичек и убирает доску.
    0x18DA7, // Похоже, теперь мы готовы. Пожалуйста, ведите.
    0x18DF9, // Ханако встаёт рядом с Лилли, и мы выходим в коридор.
    0x18E57, // Девушки проводят меня через несколько незнакомых дверей, и мы выходим на улицу с противоположной от места проведения фестиваля стороны.
    0x18F52, // Приглушённый толстыми каменными стенами здания шум, исходящий от столпотворения людей, затухает до невнятного шёпота.
    0x1902D, // Странно, я думал, что в такое-то время люди уже начнут расходиться…
    0x190A8, // Они, наверное, всё ещё здесь из-за фейерверка.
    0x190FB, // Фейерверка?
    0x19111, // Да. Похоже, школа приготовила настоящее представление. Множество горожан прибыло именно ради того, чтобы на него посмотреть.
    0x191F6, // Теперь мне становится понятным решение Лилли покинуть территорию школы. Сложно представить, как Ханако справилась бы с тем, что население всего города свалилось на школу как снег на голову. Или, применительно к «Ямаку», поднялось.
    0x1939C, // С момента моего перевода сюда мы с Лилли уже во второй раз спускаемся по этой дороге.
    0x19437, // Лишь теперь, когда я едва могу слышать оставшийся позади непрекращающийся гул фестиваля, становится понятно, насколько же он был оглушительным. В тишине вечернего воздуха я замечаю незначительный звон в ушах, восстанавливающихся от оказанного на них днём давления.
    0x1961F, // Ханако, пусть и вцепившись в Лилли, всё-таки умудряется вести её по дороге. Поэтому, а также из-за любопытных взглядов случайных прохожих, она вновь полностью замыкается.
    0x19755, // Она редко отрывает взгляд от дороги перед собой, и от неё не слышно ни слова.
    0x197E0, // С другой стороны, Лилли, как и в школе, придерживается своего обычного чопорного и благопристойного образа. Очевидно, что она намеренно выставляет свою внешность напоказ, а не старается её скрыть, подобно Ханако.
    0x19964, // Удивительно, насколько же по-разному они держатся за пределами «Ямаку». И очевидно, что они обе существенно изменяются.
    0x19A3F, // {vspace=90}Каждый в «Ямаку» – «особенный», что сводит на нет всю эту «особенность».
    0x19ACF, // Однако, стоит лишь выйти за пределы школьных ворот, мы вновь ощущаем себя «изгоями».
    0x19B69, // Особенно если мы идём в своей школьной форме. Будто вешаем себе на шею объявление, побуждающее людей заинтересоваться, что же с нами не так.
    0x19C68, // Я удивляюсь тому, что большинство учеников выходит за пределы школы, не снимая её. Правда, многие из них передвигаются с помощью трости или инвалидной коляски, поэтому она поясняет то, что и так очевидно.
    0x19DDB, // {vspace=30}Или, быть может, я единственный, кто воспринимает нашу форму как клеймо? Возможно, я привыкну к ней через некоторое время, как и к любой другой школьной форме.
    0x19F05, // Снаружи чайный дом выглядит довольно обыкновенно: кафе с типичной вывеской над входом.
    0x19FA5, // Оно похоже на одно из тех мест, мимо которого вы пройдёте не задумываясь, не обратив внимания на очередное заурядное кафе средь морской пучины тысяч подобных заведений.
    0x1A0DA, // Если бы Ханако не направила Лилли ко входу, я бы продолжил идти по дороге, так и не узнав о его существовании.
    0x1A1A0, // Интерьер выполнен в традиционном стиле. Всё выглядит так, словно выпилено из одного бруска дерева, начиная с прилавка и скамеек и заканчивая креслами с высокими спинками вдоль стен.
    0x1A2ED, // Но самой поразительной особенностью этого помещения является его безлюдность. На кухне за стеной вроде бы что-то кипит, но помимо этого стоит тишина.
    0x1A3FF, // Не услышав какого-либо приветствия, мы просто стоим рядом со входом, вежливо повинуясь надписи «Пожалуйста, подождите, вас проводят».
    0x1A4F4, // Э-э, тут что, сегодня закрыто?
    0x1A529, // Звук упавшего стула эхом разносится по помещению, и тут же из-за стойки появляется голова.
    0x1A5CE, // Я не спала, и добро пожаловать в «Шанхай»!
    0x1A61A, // Юко, одетая в пастельный передник и держащая в руках меню, бросается нам навстречу. Съехавшие очки и растрёпанные волосы заставляют усомниться в её предыдущем утверждении.
    0x1A756, // Но спала она или нет – отнюдь не первый вопрос, что возникает у меня в голове.
    0x1A7E3, // Ты теперь здесь работаешь? А как же библиотека?
    0x1A839, // А? Лилли? Хисао?
    0x1A855, // Добро пожаловать в «Шанхай»!
    0x1A88A, // Ещё просыпающаяся Юко в неистовом поклоне сбивает с себя очки.
    0x1A8FD, // А?! Мои очки…
    0x1A915, // Пока я поднимаю их с пола, Лилли всё объясняет.
    0x1A96A, // Юко работает здесь на полставки, как и в библиотеке. И это одна из причин, по которой мы любим проводить здесь время.
    0x1AA3D, // Юко забирает у меня очки и дрожащими руками возвращает их на место.
    0x1AAB8, // Да… это так… спасибо…
    0x1AAE3, // Могу я проводить вас к столику?
    0x1AB1C, // Посетителей сейчас больше нет, так что вы можете занять любой понравившийся вам столик и сразу же сделать заказ. Но всё же вам придётся немного подождать, потому что готовить буду я сама…
    0x1AC73, // Ничего, Юко. Нам чайничек чёрного чая и тарелку бутербродов, пожалуйста.
    0x1ACF7, // Хорошо! Я сейчас же займусь!
    0x1AD2A, // Юко устремляется во внутреннюю часть кафе, оставив нас стоять у входа.
    0x1ADAB, // Она раздвигает дверки-половинки, когда вспоминает, что так и не усадила нас.
    0x1AE36, // Извините! Извините! Пожалуйста, усаживайтесь там, где понравится! Я скоро вернусь!
    0x1AECC, // Последовав её совету, я подвожу Лилли к ближайшей кабинке. Ханако шагает следом.
    0x1AF5F, // Присаживаясь рядом с Лилли, я понимаю, насколько это место подходит Ханако.
    0x1AFE9, // Высокие стенки кабинки полностью отделяют нас от остального помещения, и не похоже, что здесь бывает много посетителей.
    0x1B0C5, // Все предметы обстановки, от подушек на скамейках до подставок для приправ, выглядят старыми, но не изношенными.
    0x1B191, // Интересно, осознанно ли Лилли выбирает подобные места для провождения времени с Ханако? Создаётся впечатление, что она готова пойти куда угодно, лишь бы её подруга не испытывала дискомфорта.
    0x1B2EF, // Итак, Хисао, я и не знала, что ты играешь в шахматы…
    0x1B34C, // Не сказать, что я мастер, но правила знаю.
    0x1B397, // Полагаю, логично будет спросить… кто победил?
    0x1B3EC, // Невинная улыбка Лилли ставит меня в тупик. Я совершенно не желаю кичиться своей победой над Ханако.
    0x1B4A2, // Х-хисао.
    0x1B4B1, // Да… но, м-м, с небольшим преимуществом…
    0x1B4FA, // Проклятие. Теперь я чувствую себя так, словно совершил что-то ужасное.
    0x1B57A, // Отлично, Хисао. Ты сделал то, в чём я постоянно терпела неудачу.
    0x1B5ED, // Э-э, спасибо. Я давным-давно не играл, потому было здорово сыграть вновь.
    0x1B670, // Д… да… Было здорово.
    0x1B697, // Ханако в волнении поправляет волосы и отводит взгляд, но лёгкая улыбка всё же появляется на её лице.
    0x1B74E, // Реакция несколько более яркая, чем я ожидал, но по-своему милая.
    0x1B7C2, // Она застигает меня врасплох. И лишь подобное стихийному бедствию появление Юко возвращает мне дар речи.
    0x1B881, // Ты в порядке, Юко? Может, тебе помочь?
    0x1B8C4, // Всё в порядке, всё в порядке, всё в порядке. Я всё сделаю, это моя работа.
    0x1B946, // С крайне сосредоточенным лицом Юко устремляет взгляд на поднос, который несёт, словно просто лишь глядя на него она способна удержать его содержимое на месте.
    0x1BA69, // К сожалению, это не производит никакого эффекта: чашки и блюдца медленно начинают танцевать по кругу, позвякивая при каждом столкновении друг с другом.
    0x1BB7F, // С большой осторожностью Юко ставит поднос на стол. В итоге посуда на нём лишь слегка дзынькает.
    0x1BC2D, // Вот видите!
    0x1BC42, // Э-эм, молодец.
    0x1BC5B, // Спасибо, Юко.
    0x1BC73, // Прежде чем ответить, Юко склоняет голову в фирменном поклоне.
    0x1BCE4, // Всегда пожалуйста.
    0x1BD07, // Может, присоединишься к нам? Я хотела бы обсудить с тобой мой недавний заказ, если можно…
    0x1BDAA, // А ведь и правда, когда я впервые встретился с Ханако, Лилли и Юко обсуждали какие-то книги.
    0x1BE4E, // Какую-то литературу для Лилли на Брайле…
    0x1BE9A, // Ах… да. У нас так и не было возможности перебрать их, так ведь?
    0x1BF0B, // Юко спешно садится рядом с Ханако.
    0x1BF4A, // Очевидно, преданность Юко работе не сильнее сосредоточенности; стоит ей лишь немного пошатнуться, и она тут же забывает про неё.
    0x1C035, // Я буду в библиотеке завтра днём, если захочешь попробовать ещё раз…
    0x1C0B2, // Замечательно, тогда я встречусь там с тобой после уроков.
    0x1C11B, // М-м… Л-Лилли…
    0x1C135, // Боже мой, точно. Завтра понедельник, как я могла забыть?
    0x1C19A, // Не совсем понимаю, о чём они толкуют. Что и неудивительно: я здесь всего неделю, так что с распорядком каждого ученика едва ли могу быть знаком.
    0x1C29E, // В таком случае нам стоит заново договориться.
    0x1C2F2, // Юко, а ты будешь в библиотеке в другие дни недели?
    0x1C34C, // Хм, может быть, но будет слишком поздно…
    0x1C396, // И-и мне кое… кое-что надо…
    0x1C3C7, // Это может быть проблематично…
    0x1C400, // Лилли на секунду задумывается, но затем отвечает.
    0x1C45B, // Интересно, сможем ли мы попросить кого-нибудь нам помочь, если будет нужно?..
    0x1C4E6, // М-м, что будет нужно? Я как-то потерял нить разговора…
    0x1C548, // Не люблю, когда меня в добровольно-принудительном порядке заставляют заниматься чем-то, о чём я не имею ни малейшего понятия.
    0x1C62D, // А я-то думал, что мне удалось вырваться из объятий Школьного совета и их неоднократных попыток меня завербовать.
    0x1C6FB, // О, конечно. Как-то на днях я помогала Юко сортировать новые книги на Брайле, поступившие в библиотеку.
    0x1C7B4, // Но по понедельникам мы с Ханако обычно ходим по магазинам: меньше народа, чем в выходные.
    0x1C856, // На прошлой неделе мы не смогли пойти, потому что я была занята подготовкой к фестивалю. И хотя мне удалось вырваться в конце недели, но тогда уже не смогла Ханако.
    0x1C97D, // И, так как я всё равно не понимаю шрифт Брайля, полагаю, ты хотела бы, чтобы я сходил с Ханако по магазинам?
    0x1CA3D, // Правильно. Ты бы очень мне этим помог.
    0x1CA82, // Думаю, мне это по плечу. Ханако, что скажешь?
    0x1CAD2, // Е-если ты не против…
    0x1CAF8, // Конечно же нет. Я всё ещё не знаком с магазинами в округе, так что, думаю, это неплохая идея.
    0x1CB9D, // Х-хорошо.
    0x1CBAE, // Теперь, когда мы всё решили, может быть чаю?
    0x1CBFD, // И тут я понимаю, что мой чай за время беседы отнюдь не становился горячее.
    0x1CC83, // Это моя вина! Позволь налить тебе другой…
    0x1CCD0, // Юко протягивает дрожащие руки, но я останавливаю её: не похоже, что она в состоянии управиться с кипятком.
    0x1CD91, // Всё в порядке, оставь. Раз ты уже сделала чай и бутерброды, то выполнила свои обязанности официантки, верно?
    0x1CE55, // П… полагаю, что да.
    0x1CE78, // Юко немного успокаивается, но всё ещё напряжённо наблюдает, как я делю бутерброды.
    0x1CF0F, // Я собираюсь откусить кусок бутерброда, но тут снаружи раздаётся громкий низкий грохот одновременно со вспышкой света.
    0x1CFE9, // А, полагаю, фейерверк начался.
    0x1D020, // Взглянув в окно, только сейчас я понимаю, что на смену сумеркам на город опустилась ночь.
    0x1D0C2, // Искры взрывающихся снарядов образуют фонтаны фейерверков, напоминающие огромные цветы.
    0x1D165, // Пойдёмте посмотрим!
    0x1D18A, // Ой… извини, Лилли…
    0x1D1AE, // Пожалуйста, обо мне не беспокойтесь. Я слышала, что из этого кафе на салют открывается довольно неплохой вид.
    0x1D275, // Мы все, за исключением Лилли, несёмся к окну небольшой чайной, чтобы посмотреть фейерверк.
    0x1D31A, // Вспышки цветных огней играют на лицах Ханако и улыбающейся Юко, и я даже на секунду забываю о том, что собирался смотреть на происходящее за окном.
    0x1D426, // Даже в этом совершенно новом мире есть несколько вещей, что остаются неизменными.
    0x1D4BC, // Наверное, потому школа и создала такой ажиотаж вокруг этого фестиваля, что он даёт шанс показать сходство между всеми людьми.
    0x1D5A2, // Представление заканчивается слишком быстро; фейерверки дорогие и бьют по карману даже хорошо финансируемым школам.
    0x1D678, // Прежде чем вернуться к чаю с бутербродами, Ханако поворачивается ко мне.
    0x1D6FD, // М-м, с-спасибо за сегодняшний день…
    0x1D73E, // …и за завтрашний.
    0x1D75F, // Всё хорошо. Не думаю, что я и сам любитель потолкаться в толпе народа.
    0x1D7DD, // Такой день, как этот, намного приятнее проводить где-нибудь далеко ото всех, правда же?
    0x1D87B, // А-ага.
    0x1D886, // Однако наше чаепитие слишком затянулось, поэтому давай вернёмся к столу.
    0x1D90C, // Т-точно.
    0x1D91B, // Мы возвращаемся в нашу кабинку, к бутербродам.
    0x1D970, // Звучало впечатляюще. По меньшей мере громче, чем в прошлом году.
    0x1D9E5, // Ага, было здорово! Ни разу не видела, чтобы они организовывали такое представление.
    0x1DA7D, // С каждым годом оно становится всё лучше.
    0x1DAC7, // Всё же боюсь, что за это время чай остыл.
    0x1DB10, // О нет! Позволь мне налить новый! Это моя вина!
    0x1DB62, // Успокойся, Юко, в этом никто не виноват.
    0x1DBAA, // Я делаю глоток из своей чашки, просто чтобы подтвердить её слова.
    0x1DC21, // Остыв, этот чай не стал плохим. Лишь стал похож на чай со льдом.
    0x1DC93, // Правда?
    0x1DCA1, // Да, правда. А если ты добавишь немного сахара, то станет просто отличным.
    0x1DD25, // Ты уверен?
    0x1DD38, // Абсолютно. Давай ты присядешь и попьёшь его с нами?
    0x1DD95, // Не похоже, что я убедил Юко, но она всё же садится.
    0x1DDEF, // Она аккуратно насыпает пять чайных ложечек сахара себе в чашку.
    0x1DE64, // Э-э, я сказал «немного» сахара…
    0x1DE9E, // Знаю, но мне нравится, когда чай сладкий.
    0x1DEE8, // Я с любопытством заглядываю в её чашку. Как я и предполагал, такое количество сахара отказывается растворяться в остывшей жидкости.
    0x1DFDA, // Дважды помешав ложечкой, она поднимает чашку и одним глотком выпивает всё содержимое.
    0x1E078, // Ты прав, он не так уж и плох!
    0x1E0AA, // Э-э, хорошо…
    0x1E0C1, // Я поворачиваюсь к Лилли и Ханако. Пока я наблюдал за Юко, они уже закончили есть.
    0x1E153, // Не желая всех задерживать, я следую примеру Юко и допиваю остатки своего чая одним глотком.
    0x1E1FA, // Кажется, теперь мы закончили.
    0x1E230, // Возвращаемся, или кто-то хочет повторить?
    0x1E27C, // На лице Юко ясно отражается, что это плохая идея.
    0x1E2D5, // Думаю, лучше бы нам уже возвращаться в школу.
    0x1E327, // В конце концов, мы должны вернуться до отбоя.
    0x1E379, // Ох, в этом определённо есть смысл.
    0x1E3B7, // Встретимся завтра, Юко.
    0x1E3E2, // Буду ждать, Лилли. До свидания, ребята.
    0x1E428, // Мы выходим из маленькой чайной, погружаясь в ночную темноту.
    0x1E497, // Ханако вновь цепляется за Лилли. Сейчас, под покровом темноты, она кажется не такой напряжённой, как по пути сюда.
    0x1E566, // Навстречу нам начинают попадаться группы людей, покидающих территорию школы. Чтобы избежать встречи с ними, Ханако ведёт нас в обход.
    0x1E65B, // Дойдя до общежитий, мы замечаем, что школа кажется необычайно тихой в сравнении с гулом фестивального дня.
    0x1E71E, // Спасибо за сегодня. Думаю, я узнал много нового.
    0x1E775, // Всегда пожалуйста. А теперь, боюсь, мне пора откланяться. Сегодня был длинный день.
    0x1E80C, // И правда, Лилли весь день провела на ногах; представляю, как должна была утомить её прогулка за пределы школы.
    0x1E8D4, // Я ощущаю укол вины, вспомнив, что я, наверное, единственный в школе, кто встал сегодня около десяти.
    0x1E988, // Без проблем.
    0x1E99F, // В таком случае увидимся с вами завтра. Спокойной ночи.
    0x1EA02, // С… спокойной.
    0x1EA1C, // Мы с девушками расходимся по общежитиям.
    0x1EA67, // Я проиграл спор, так что теперь должен побыть со Школьным советом.
    0x1EAE0, // Я внезапно понимаю, что мы не обговорили место встречи. Я лучше просто подожду этих двоих, нежели буду рисковать потерять их в толпе на улице. Они, скорее всего, заняты тем, что бегают туда-сюда и решают организационные вопросы.
    0x1EC7D, // Забавно. Я ожидал, что цена проигрыша Сидзунэ в её дурацкой игре будет куда более жестокой. Это просто предлог, чтобы провести с ней время. В общем, думаю, она просто хочет, чтобы я повеселился.
    0x1EDDA, // У неё могут быть добрые намерения, даже если она не может подойти и сказать о них прямо, и, думаю, она мне начинает нравиться всё больше.
    0x1EED0, // Я мог бы не пойти, но многое бы потерял. И к тому же я хочу пойти. То есть, понимаешь, сегодня захватывающий день. В любом случае будет что-то интересное.
    0x1EFE2, // Школьный совет? Что? Он ещё существует?
    0x1F029, // Там разве не всего два чувака?
    0x1F060, // Две девушки.
    0x1F077, // Правда? Симпатичные? Чёрт, нет, постой… симпатичные?
    0x1F0D7, // Нет! Это неважно! Я слышал, что президент у них сумасшедшая… никогда не говорит, а только отдаёт приказы через своих лакеев.
    0x1F1B9, // Чёрт, в любой школе они одинаковые… Какие-то бессердечные сучки. Сучки повсюду.
    0x1F24B, // Если там две девушки, они в большинстве – двое на одного. Опасная ситуация, чувак. Кто знает, что может случиться.
    0x1F319, // Чёрт, в Совете всего две девушки, но сколько у них в руках власти!
    0x1F38F, // Их надо остановить.
    0x1F3B3, // Я прямо вижу, как они ищут пути осуществления своих феминистских планов. Я не могу доверять такому руководству.
    0x1F47F, // Это не круто. Совсем!
    0x1F4A5, // Чёрт. Дерьмо! Чёрт!
    0x1F4C7, // Я задумываюсь, чем же мне хочется заняться с Сидзунэ и Мишей. Решив, что лучше быть во всеоружии, я заглядываю обратно в комнату, чтобы наполнить бумажник.
    0x1F5E0, // Интересно, там есть игра, где надо поймать золотую рыбку бумажным сачком?
    0x1F666, // Поймать её гораздо легче, чем вам пытаются внушить. Но, с другой стороны, если бы я поймал рыбку, мне бы незачем было держать её у себя.
    0x1F759, // Что мне делать с рыбой в своей тесной комнатке? Зажарить?
    0x1F7C1, // Я бы мог её отдать Сидзунэ или Мише, но это, наверное, было бы слишком.
    0x1F83F, // Действительно, проблема. Они обе милые, но не думаю, что у меня с кем-то из них есть шанс. Но, невзирая на это, я продолжаю обдумывать такой вариант. Я представляю себе, как они могли бы отреагировать, если бы я им сегодня что-нибудь подарил, например рыбку или куклу.
    0x1FA1E, // Миша бы, наверное, как всегда засмеялась. А Сидзунэ бы выбила её у меня из рук.
    0x1FAAB, // Может, это не такая уж и хорошая идея.
    0x1FAEF, // Ладно, думаю, я готов.
    0x1FB16, // По прошествии приличного количества времени мне в голову приходит мысль, что это – очередной психологический тест за авторством Сидзунэ. Даже если я ошибаюсь, время-то не стоит на месте.
    0x1FC6C, // Я решаю пойти и поискать их, пусть даже не зная, где именно. Сегодня найти их будет, похоже, очень непросто.
    0x1FD2D, // Выйдя обратно в коридор, я чуть не врезаюсь в Сидзунэ.
    0x1FD8F, // Привет, Сидзунэ. А где Миша?
    0x1FDC1, // Я пытаюсь жестикулировать, но, по сути, просто размахиваю руками. Надо будет попросить Мишу, чтобы чуть-чуть меня научила.
    0x1FE9F, // Здесь!
    0x1FEAB, // Миша выскакивает из-за Сидзунэ, широко ухмыляясь.
    0x1FF06, // Мы просто пришли убедиться, что ты идёшь с нами на фестиваль.
    0x1FF75, // Не нарушай своё обещание~!
    0x1FFA5, // Обещание? Не припомню, чтобы я что-нибудь обещал.
    0x1FFFE, // Хватит пытаться увильнуть!
    0x20030, // Ну давай, Хиттян, будет весело! Тебе в любом случае это необходимо, иначе станешь никчёмным!
    0x200D7, // Ты ведь не хочешь стать одним из людей, сидящих целыми днями напролёт в комнате наедине с паранойей?
    0x2018E, // Я невольно бросаю взгляд через её плечо на дверь в комнату Кендзи.
    0x20207, // Я надеюсь, что он не слышит её слов, но, видимо, Миша как раз этого и добивается.
    0x20296, // Нет, конечно не хочу. Я просто дурачился и всё равно уже собирался уходить. Вам было не обязательно за мной заходить.
    0x2036A, // Правда? А-ха-ха-ха! Ситтян волновалась, что ты попытаешься как-нибудь отмазаться!
    0x203FD, // Ты нам нужен, Хиттян~!
    0x20424, // Чего?
    0x2042E, // Сердце, кажется, ёкнуло.
    0x2045A, // У меня плоховато с прицелом, чтобы сбивать кукол с подставок… а Ситтян отказывается бросаться вещами.
    0x20516, // Вот оно что.
    0x2052C, // Сидзунэ глядит на меня, мгновенно замечая моё разочарование. Она поправляет очки.
    0x205C2, // О чём, по-твоему, мы говорили? Я вообще ничем не хочу бросаться.
    0x20634, // Почему, Ситтян? Как-то странно…
    0x2066E, // Ну, как бы то ни было, Хиттян, тебе ведь приходилось кидать мячи, правда~, правда~? Так что! Тебе придётся пойти с нами!
    0x20741, // Меня поражает их логика. Непонятно, шутят они или нет.
    0x207A3, // Хе-хе, если б я не знал, что вы шутите, то обиделся бы.
    0x20802, // Вы ведь шутите, да?
    0x20824, // Так и есть, Хиттян~! Всё так и есть, так и есть, так и есть!
    0x2088A, // Тогда я спокоен.
    0x208A8, // Давай, пойдём! За окнами уже группа глухих музыкантов настраивает инструменты.
    0x20939, // Миша хватает меня за руку и тянет из дверного проёма, но мне вполне очевидно, что она не особо старается.
    0x209F7, // Сидзунэ смотрит на нас, немного покраснев и нетерпеливо теребя пальцами дужку очков.
    0x20A93, // Я не привык к таким, казалось бы, обыденным прикосновениям, но ничего против не имею. Как я могу возражать?
    0x20B54, // На улице ещё светло, но солнце уже собирается скрыться в кронах деревьев.
    0x20BDA, // Похоже, что здесь собралась половина школы, я даже замечаю в стороне нескольких преподавателей, попивающих пунш.
    0x20CA9, // К ужасу работающих в киоске девушек, они уже почти опустошили целый чан.
    0x20D2D, // Предсказатели судьбы стоят и болтают с друзьями, в то время как остальные уже начали метать гороскопами в каждого из прохожих.
    0x20E15, // Такая тактика кажется мне чересчур агрессивной, но она хотя бы показывает, что они вжились в роль. Это здорово, но я не знаю, смогу ли привыкнуть.
    0x20F1C, // Надо бы чего-нибудь поесть. Ты голодный, Хиттян?
    0x20F73, // Кстати сказать, я не ел целый день.
    0x20FB2, // Жареной лапши мне не очень хочется.
    0x20FF3, // Ничего страшного, тут много чего другого жареного!
    0x21050, // А какая-нибудь нежареная пища есть?
    0x21091, // Конфеты. Вредная пища – самое главное в празднике!
    0x210EE, // Ва-ха-ха-ха-ха!
    0x21108, // Давай я – то есть Ситтян – угощу тебя чем-нибудь одним~!
    0x2116E, // Одним?
    0x2117A, // …!
    0x2117F, // Только одним~! Чтобы ты набрался сил для метания!
    0x211D8, // Только похоже, что ещё не все киоски открылись, так что тебе может не достаться желаемого.
    0x2127C, // Я оглядываюсь, поражённый количеством киосков. Невероятно, фестиваль в «Ямаку» шире по своему размаху, чем в иных городах.
    0x2135C, // Несмотря на сказанное Мишей, половина школы уже празднует.
    0x213C8, // Воздух наполнен возбуждённой болтовнёй по меньшей мере половины всех учеников интерната.
    0x2146E, // От аромата готовящейся еды мой голод с каждой секундой только усиливается.
    0x214F8, // Ну же, Хиттян, еду скоро всю расхватают! Если хочешь такояки, надо идти прямо сейчас!
    0x21591, // Я бы поела такояки~! Давайте поедим!
    0x215D2, // Хорошо, я бы не отказался – сто лет их не ел.
    0x21622, // Сидзунэ срывается с места прежде, чем Миша успевает ей перевести, и энергично направляется к лавке с такояки, а Миша пытается угнаться за ней.
    0x21725, // Миша смеётся, подскочив к Сидзунэ, которая заказывает три порции такояки, показывая три пальца.
    0x217D4, // Я раньше не обращал внимания, но теперь кажется странным, что Сидзунэ, будучи человеком, одержимым чаем высшего сорта, любит также и фастфуд.
    0x218D5, // Я принимаю от неё тарелку с такояки, раздумывая, стоит ли начинать есть. Блюдо выглядит очень горячим.
    0x2198F, // От него поднимается пар, а на поверхности шкворчит масло.
    0x219F8, // Сидзунэ с Мишей смотрят на меня так, будто ждут, что я начну есть первым.
    0x21A7B, // Я не могу уступить, поэтому насаживаю один кусочек на пластиковую вилочку, небрежно торчащую из угла тарелки.
    0x21B44, // Однако не успеваю я отправить его в рот, как Сидзунэ с Мишей страстно набрасываются на еду. Сидзунэ кусает такояки быстро, но аккуратно, а Миша, словно ребёнок, подолгу смакует каждый кусочек.
    0x21CA1, // Думаю, что они, как и все прочие здешние ученики, в конце концов просто обычные дети.
    0x21D3A, // Это здорово. Давненько я не гулял с кем-то вот так запросто, наслаждаясь компанией.
    0x21DD1, // Даже до того, как я попал сюда, у меня был очень занятой год. Настолько занятой, что я до сих пор даже не осознавал, чего лишался.
    0x21EB8, // А здесь я чувствую себя безмятежно.
    0x21EF9, // Очень умиротворяющая атмосфера. Я и не думал, что подобные фестивали до сих пор проводятся.
    0x21FA0, // А? Хиттян, ты что, не будешь есть?
    0x21FDB, // Буду, буду.
    0x21FEF, // Надеюсь, тебя не отпугнуло то, что они горячие?
    0x22044, // Нет, не в этом дело.
    0x22067, // Мне уже начинают нравиться их поддразнивания.
    0x220BC, // Я поспешно принимаюсь есть, пока еда не остыла, размышляя о том, какое великолепное зрелище создают тускло подсвеченные бумажные фонарики, сияющие тёплым светом на фоне заката.
    0x22200, // Не успеваю я доесть свои такояки, как Сидзунэ встаёт передо мной, выпрямившись и строго сложив руки за спиной.
    0x222C9, // Заметно, что она пытается быть как можно серьёзнее, но с такой улыбкой на лице даже ей не спрятать своё хорошее настроение.
    0x223A9, // А-ха-ха-ха~! Пойдём, Хиттян, поиграем в какие-нибудь игры!
    0x2240F, // Разве у них всё уже готово?
    0x22440, // Нет, но неважно, неважно~! Пойдём, Хиттян, пока толпа не собралась!
    0x224B7, // Миша кладёт руку мне на плечо и заливается смехом.
    0x22513, // Пойдём! Пойдём! В этом году призы просто здоровские, правда-правда~! Тебе разве не хочется выиграть призы для таких красоток, как мы?
    0x22603, // Миша напускает на себя «милый» вид, и, надо сказать, получается эффектно. Я смотрю на Сидзунэ, ожидая, что она сделает то же самое, но она только глядит на меня как на сумасшедшего.
    0x22748, // Миша, прекрати!
    0x22764, // Стоп… Миша – это же я…
    0x2278F, // Хиттян, торопись, ты уже тысячу лет держишь этот несчастный кусочек такояки!
    0x2281B, // Ха-ха-ха-ха-ха!
    0x22835, // Я люблю смаковать всё, что ем. Даже такое.
    0x22880, // Внезапно Сидзунэ выхватывает у меня из руки вилку и с улыбкой отправляет такояки себе в рот.
    0x22929, // Всё происходит так быстро, что я оказываюсь не в состоянии этому помешать.
    0x229B1, // Не успеваю я осознать, что же произошло, как Миша взрывается хохотом, а Сидзунэ так улыбается, что кажется, будто вот-вот к ней присоединится.
    0x22AB2, // Вот дело и решено~! Ва-ха-ха! Ха-ха-ха-ха!
    0x22AF9, // Сидзунэ хватает меня за правую руку, а Миша – за левую.
    0x22B5D, // Ты идёшь с нами! Сегодня нас ждёт много интересного, веселись!
    0x22BCE, // Ха-ха-ха-ха~!
    0x22BE4, // Пробираясь сквозь уже довольно внушительную толпу, мы играем во все игры подряд: «Брось кольцо», «Замочи крота» и в такие, о которых я даже не слышал.
    0x22CF4, // Выигрываем мы редко, но нам всё равно весело.
    0x22D46, // Эй, а тут есть «Поймай золотую рыбку»?
    0x22D8B, // Конечно! Я не знала, что тебе нравится эта игра, Хиттян!
    0x22DEF, // Просто я всегда хотел попробовать. Она вроде не сложная.
    0x22E56, // Ты в этом уверен, Хиттян~?
    0x22E84, // Ва-ха-ха-ха~! Ладно, ладно! Посмотрим! Их киоск где-то тут!
    0x22EEA, // Только где ты собираешься держать рыбку? У тебя есть аквариум?
    0x22F5C, // Ну… нет.
    0x22F6C, // Может, он её съест?!
    0x22F8F, // Ха-ха-ха-ха-ха-ха! А-ха-ха-ха-ха-ха-ха!
    0x22FD0, // Ладно, Хиттян, если нам удастся поймать рыбку, мы отдадим её тебе!
    0x23047, // Что, правда? Снова посостязаемся? Ну что ж…
    0x23096, // Сидзунэ, пытаясь скрыть горящий в глазах энтузиазм, оживлённо подталкивает меня к киоску.
    0x2313B, // К счастью, им не удаётся поймать ни одной рыбки, но и мне везёт не больше.
    0x231BF, // У меня не получается сдержать смех, когда они сразу после этого начинают тащить меня к особенно крупному цветастому киоску, в строительстве которого я принимал активное участие.
    0x23306, // Я его помню: с ним было особенно много возни.
    0x23357, // Продавец, парень ничем не примечательной наружности с выкрашенными в каштановый цвет волосами, выпрямляется, увидев, что мы подходим. Я замечаю две вещи:
    0x23470, // Во-первых, это киоск с игрой по сбиванию кеглей, выстроенных пирамидой.
    0x234F2, // Четыре шарика за пятьдесят иен, весьма неплохо.
    0x23549, // Во-вторых, тут есть инструкция к игре, напечатанная шрифтом Брайля. Мне хочется что-нибудь сказать по этому поводу, и я поворачиваюсь к Сидзунэ с Мишей.
    0x2365D, // Но они либо не замечают её, либо для них она не кажется странной.
    0x236D2, // Привет! Здорово, что ты пришла, Хакамити! Спасибо большое за помощь с этим киоском. Веселитесь?
    0x2377E, // Сидзунэ бросает взгляд на Мишу, которая молниеносно всё ей переводит, и лучезарно улыбается продавцу.
    0x23839, // Ха-ха~! Это ерунда, сущие пустяки~! Да, всё здорово~! Думаю, это лучший фестиваль из тех, что мы проводили!
    0x238F4, // Сираки, мы бы хотели поиграть, ведь можно?
    0x23940, // Разумеется~, было бы чудесно, если бы ты просто отдал приз милым трудолюбивым работницам Школьного совета за все часы, которыми они пожертвовали, чтобы устроить весь этот праздник!
    0x23A8A, // Ха-ха-ха, ха-ха… Нет.
    0x23AAF, // А Сираки крут.
    0x23AC9, // Эй, я пролил немало пота, строя этот киоск, и потратил два часа своей жизни. Думаю, я заслуживаю хотя бы один бесплатный раунд.
    0x23BAD, // И я!
    0x23BB4, // Я тоже!
    0x23BC1, // Ой…
    0x23BC9, // Немного поколебавшись, он всё-таки сдаётся и, пожав плечами, вручает нам всем по четыре шарика.
    0x23C76, // Не проходит и секунды, как Сидзунэ и Миша отдают свои шарики мне.
    0x23CEC, // Чего это вы?
    0x23D02, // Только не говорите, что, наделав столько шума, вы даже не собираетесь играть!
    0x23D8E, // И это после того, как мы все вместе накинулись на Сираки!
    0x23DF5, // Вот именно…
    0x23E0C, // А ты, пожалуйста, не вмешивайся~!
    0x23E47, // Сидзунэ поворачивается ко мне и пренебрежительно машет рукой. Миша разрывается между переводом и утешением продавца.
    0x23F20, // А-ха-ха-ха! Хиттян, где твоё рыцарство? Кроме того, я – то есть Ситтян – придерживаюсь политики небросания шаров!
    0x23FED, // Ой, прости, Хиттян. У меня тоже плохо с бросанием шариков в цель. Однако у тебя наверняка это хорошо получается, правда, правда? Для тебя это не проблема!
    0x24101, // Выглядит довольно просто. Кегли не так уж далеко, единственное препятствие в том, что шарики полые, пластиковые, да ещё и с дырками.
    0x241F0, // Я бросаю один в кеглю, и он бесцеремонно отскакивает.
    0x24251, // Какого чёрта?
    0x2426A, // Да, это не так просто, как кажется. Кегли наполнены водой. Секрет фирмы.
    0x242EB, // Это не очень-то честно!
    0x24315, // Потому-то четыре шарика всего за пятьдесят иен. Как хитро!
    0x2437F, // Ну давай, Хиттян, ты сможешь их сбить! У тебя ещё одиннадцать попыток, давай!
    0x24409, // Может, сама попробуешь?
    0x24434, // Сидзунэ? Хочешь попробовать?
    0x24469, // Сидзунэ выразительно качает головой из стороны в сторону.
    0x244D4, // Я смеюсь: это выглядит довольно забавно.
    0x2451E, // Собравшись, я бросаю ещё один шарик в пирамиду кеглей и заставляю её немного покачнуться.
    0x245C2, // Сидзунэ с Мишей бросают жадные взгляды в сторону игрушечной кошки.
    0x2463D, // В общем-то, не так уж они и отличаются друг от друга.
    0x2469B, // Порой я задумываюсь, не был бы голос Сидзунэ похож на Мишин, если бы она могла говорить.
    0x2473A, // Нет, ну не настолько они похожи.
    0x24774, // Я бросаю ещё один шарик, поняв, что на самом деле это довольно просто. Если я смогу одновременно сбить две нижние кегли, то легко выиграю.
    0x2486D, // Уже начинает собираться небольшая толпа, и давление на меня усиливается. Ещё девять бросков.
    0x24917, // Я замахиваюсь, словно бейсбольный питчер, швыряю шарик изо всех сил, и кегли сыпятся вниз.
    0x249BB, // Я торжественно требую приз в виде плюшевой кошки, а Миша заливается хохотом, будто это она её выиграла.
    0x24A77, // Сидзунэ смотрит на меня своим обычным безэмоциональным взглядом. Ясно, что она тоже хочет эту игрушку.
    0x24B33, // Хиттян, поздравляю~! Что ты собираешься делать с этой куклой?
    0x24BA2, // Правильного ответа не существует. Я должен ступать осторожно.
    0x24C14, // Я… не знаю.
    0x24C29, // Ну-у-у-у-у-у~ Если тебе не нужна, я заберу…
    0x24C74, // Если ты только не хочешь оставить её себе, Хиттян. Не знала, что тебе нравятся мягкие игрушки. Как щекотливо.
    0x24D39, // Не хочу. Мне она ни к чему.
    0x24D68, // Можно тогда мне?
    0x24D86, // Их глаза сверлят мою душу.
    0x24DB6, // Такое решение я принимать не хочу. Я поворачиваюсь к киоску.
    0x24E24, // У вас есть ещё одна такая же?
    0x24E58, // Да, как раз одна.
    0x24E76, // Хорошо, ставьте всё на место, попробую ещё раз.
    0x24ECB, // У меня всё ещё остаётся восемь шаров.
    0x24F0F, // Как только кегли снова устанавливают, я бросаю изо всех сил, но промахиваюсь.
    0x24F9C, // Ха-ха-ха! Пытаешься выиграть ещё одну? Хочешь выкрутиться по-лёгкому, Хиттян?
    0x25028, // Если это так легко, можешь сама попробовать.
    0x25079, // Нет, спасибочки~!
    0x25098, // Скажи, Хиттян, а ты можешь положить игрушку, хотя бы пока кидаешь шары?
    0x25118, // Нет.
    0x25120, // Осталась всего одна, и лучше бы тебе попасть! Облажаешься – убью~!
    0x25198, // Однако же какой хитрый способ, чтобы не отдавать мне игрушку! И говоря «я», я имею в виду себя~!
    0x25243, // !
    0x25245, // А-ха-ха-ха-ха~! Шутка!
    0x2526A, // Понятно, что Миша никого не хотела обидеть, и Сидзунэ шутка вроде бы нравится, но затем ей становится немного грустно.
    0x25341, // Я решаю вручить игрушку ей, хотя бы на то время, пока пытаюсь выиграть ещё одну. Целиться с огромной кошкой в руках трудновато.
    0x25427, // Спасибо, Хиттян. Ситтян, похоже, счастлива~! Но ты ведь выиграешь и для меня тоже?
    0x254B9, // А я разве не этим занимаюсь?
    0x254EC, // Я снова делаю бросок, но в этот раз совсем мажу.
    0x25542, // В руке чувствуется тяжесть, как будто кровь туда не поступает.
    0x255B4, // Я ругаю себя, думая, что устать от такой ерунды – просто жалкое зрелище.
    0x25637, // И тут я понимаю, что это, вероятно, из-за сердца. Если так, то я не знаю, что и думать.
    0x256CD, // Удручающе осознавать, что такой малости для меня достаточно, чтобы осознать собственную смертность.
    0x25786, // Наверное, я никогда не смогу перестать об этом вспоминать.
    0x257F1, // Даже сегодня, в день, который я надеялся провести с удовольствием, в этот чудесный вечер, я не могу отделаться от причины моего присутствия в этой школе.
    0x25907, // Это место не сравнится ни с одним другим, я нигде ещё не чувствовал себя так умиротворённо.
    0x259AD, // Но теперь сложно не думать о том, о чём думать совсем не хочется:
    0x25A22, // Возможно, меня просто отправили сюда умирать.
    0x25A76, // Последние несколько дней были лучшими в моей жизни. Впервые после долгого времени я почувствовал себя по-настоящему живым.
    0x25B58, // Но в конечном счёте каждый раз, когда я взбираюсь на чересчур длинную лестницу или слишком сильно швыряю шарик, мне приходится вспоминать о том, что я могу умереть в любой момент.
    0x25C9E, // И это всегда будет меня ограничивать.
    0x25CE3, // Я ощущаю тоску и злобу. Всё-таки мне дорога моя жизнь, и я наслаждаюсь ею, а теперь она как никогда бренна.
    0x25DA2, // Интересно, что же меня в конце концов добьёт? Если я настолько слаб и жалок, это может быть что угодно: неудачное падение, удар в грудь или шальной бейсбольный мяч.
    0x25ECA, // Несмотря на потерю воли, я продолжаю играть в эту игру.
    0x25F2E, // Внезапно я чувствую укол в груди. Боль сразу же улетучивается, но заставляет меня чуть пошатнуться.
    0x25FE4, // Сидзунэ в испуге отпрыгивает, а потом подходит поближе, не отрывая беспокойного взгляда. Миша кладёт руку мне на плечо.
    0x260BE, // Эй, Хиттян, ты в порядке?
    0x260EA, // Да, в порядке. Не очень хорошо себя чувствую, наверное заболел. Думаю, я не смогу продолжить.
    0x26191, // Миша хмурится.
    0x261AC, // Не перенапрягайся. Если ты настолько болен, то так только заболеешь ещё больше.
    0x2623D, // Смотри, фестиваль только начался, а мы постоянно играли в игры. Если устал, то давай отдохнём.
    0x262E7, // Хорошая идея, Ситтян, я тоже немного устала! Все мы малость выбились из сил, бегая по школе, Хиттян!
    0x2639A, // Я киваю. Они вроде бы не заметили ничего необычного. Вот и отлично.
    0x26413, // Мы пробираемся через море народа, а Миша указывает на лица каждого из своих знакомых. Сидзунэ держит в руках тряпичную кошку, рассеянно обнимая её. Похоже, им весело.
    0x26541, // И вдруг на меня нападают угрызения совести.
    0x26591, // Из-за моего слабого здоровья нам пришлось всё прекратить.
    0x265FB, // Хиттян, мы немного голодны, а ты?
    0x26636, // Не то чтобы сильно, но чего-нибудь съел бы.
    0x26683, // Этого вполне достаточно, Хиттян~! Чего бы нам купить?
    0x266E3, // Мне неважно, что угодно.
    0x2670F, // А! Тогда как насчёт бутербродов? И ещё что-нибудь попить! Миша всё принесёт!
    0x26798, // Что?..
    0x267A2, // Сидзунэ с улыбкой смотрит на меня. Я понимаю, что она пытается развеселить меня шуткой, и ей это удаётся – я смеюсь.
    0x26874, // Хиттян, народу уже слишком много, поэтому здесь мы поесть, пожалуй, не сможем. И шумно к тому же.
    0x26921, // Может, лучше подняться на крышу и поесть там?
    0x26973, // Я согласен. Наверняка вид оттуда замечательный, да и ветерок, наверное.
    0x269F5, // Значит, договорились! Думаю, мне теперь надо сходить за едой и напитками… Тогда до встречи~!
    0x26A9D, // Миша неловко машет рукой и убегает.
    0x26ADE, // Раньше я не замечал, как бумажные фонарики освещают ночь, но теперь могу оценить, насколько это завораживающее зрелище.
    0x26BB9, // Мягкое сияние пролетающих над головой светлячков походит на сверкание снежинок в ночном небе.
    0x26C67, // В большом городе такого не увидишь.
    0x26CA8, // Сидзунэ нетерпеливо тянет меня за рукав и, нахмурившись, скрещивает руки на груди, выражая недовольство тем, что я отвлёкся.
    0x26D8B, // Ты ведь знаешь, что я не понимаю язык жестов.
    0x26DDC, // Кстати, а разве не глупо с моей стороны говорить? Она ведь не услышит.
    0x26E5A, // Я пожимаю плечами, показывая, что ничего не понимаю. Сидзунэ качает головой и отмахивается.
    0x26F01, // Может, стоит попросить Мишу провести урок языка жестов?
    0x26F67, // Поднявшись на крышу, я снова поражаюсь размерам школы. Территория настолько обширна, что непонятно, как я раньше не обращал на это внимания.
    0x27067, // Идя по крыше вслед за Сидзунэ, я не могу не поддаться очарованию сверкающих звёзд.
    0x270FD, // Мы с Сидзунэ усаживаемся на скамейку. Кажется, она пребывает в хорошем настроении и мягко улыбается, а ветер развевает её волосы.
    0x271E9, // Мы смотрим на фестиваль внизу, который отсюда кажется морем янтарных фонарей и колышущихся бумажных вееров, переполненный людьми, часть которых нарядилась в праздничные юкаты.
    0x2732E, // Собственно, большинство девушек одеты в юкаты. Интересно, почему Сидзунэ и Миша не надели их сегодня?
    0x273E7, // Юкаты хорошо бы на них смотрелись. Я мельком задумываюсь, какой тип юкаты каждая из них выбрала бы.
    0x2749B, // Сидзунэ наверняка надела бы что-то традиционное, а вот насчёт Миши я не уверен.
    0x2752B, // Прибегает Миша, тяжело дыша от быстрого бега и стараясь не уронить еду, которую несёт в руках.
    0x275D6, // Разложив её на крыше, она позволяет себе расслабиться.
    0x2763A, // А-ха-ха-ха! Это заняло немало времени! Вы не сказали, чего хотите, так что я взяла рисовый пунш, сэндвичей и сладостей! Всего понемножку!
    0x2772F, // Отлично. Давайте начнём.
    0x2775C, // Миша откусывает кусочек от маленького треугольного сэндвича.
    0x277CE, // Ну как, Хиттян, что думаешь о фестивале? Он замечательный, правда?
    0x27845, // Красивые звёзды сегодня вечером. Трудно придумать более идеальный день.
    0x278CA, // Звуки людской толпы, доносящиеся снизу, звучат как тихая музыка, смешиваясь с отдалённым стрекотом цикад.
    0x2798C, // Я отпиваю пунш из банки и поднимаю взгляд на Мишу, которая, кажется, с комфортом спит, растянувшись на гравии с полупустой банкой яблочного сока на животе.
    0x27AA6, // Сидзунэ сидит с поджатыми ногами, медленно раскачиваясь взад и вперёд, словно нетерпеливый ребёнок, и смотрит на небо.
    0x27B7F, // Они обе такие красивые. Оглядевшись, я отмечаю, что многие ученики держат за руку свою девушку или парня.
    0x27C3E, // Не так далеко от нас на крыше расположилось несколько держащихся за руки парочек, созерцающих звёзды в вышине или огни фестиваля под нами.
    0x27D3C, // Часть меня хочет этого же.
    0x27D6C, // Глядя на Сидзунэ и Мишу, я размышляю о том, что, возможно, стоит пригласить одну из них на свидание. Может, рискнуть?
    0x27E3D, // Золотые стрелки на изящных часиках Сидзунэ привлекают моё внимание, и я вижу, что уже довольно поздно. Но фестиваль ещё в самом разгаре.
    0x27F35, // Сидзунэ всё так же держит за лапу плюшевую кошку, которую я выиграл. Она замечает, что я на неё смотрю.
    0x27FEE, // …?
    0x27FF3, // И без раздумий протягивает её мне. Я улыбаюсь, желая спросить, что же мне с ней делать, – но она меня не поймёт.
    0x280BB, // Я трясу головой и стараюсь объяснить, чтобы она оставила её себе. Надеюсь, она меня поняла.
    0x28160, // Посмотрев в сторону школы, я вижу перед собой множество людей, и все они веселы и счастливы.
    0x28207, // Я гляжу на них и чувствую умиротворение.
    0x28251, // Это было нечто. Сегодняшний день прошёл не зря.
    0x282A7, // Но я всё ещё не могу стряхнуть с себя меланхолию и чувство вины, напавшие на меня чуть ранее. Они продолжают цепляться за меня, и я не могу от них избавиться.
    0x283C3, // Сидзунэ что-то показывает мне жестами, а я не могу её понять. Что бы я ни сказал, она меня не услышит.
    0x28478, // Я не понимаю тебя, Сидзунэ.
    0x284A9, // Ладно, проехали. Интересно, мы оба считаем себя виноватыми в этом? В любом случае мне жаль, что я не могу тебя понять.
    0x2857C, // Знаешь, я почти… почти рад, что ты чуть ли не силком меня сюда привела. Правда, если я попытаюсь встречаться с тобой, мне придётся крепко подумать над этой твоей стороной.
    0x286B2, // Нет, на самом деле… Я искренне рад. Сегодня было здорово.
    0x2871A, // Ты бы была привлекательней, если бы чаще улыбалась. У тебя милая улыбка.
    0x2879D, // Раздосадованная, она поднимается, сложив руки за спиной и выглядя уверенно и властно на фоне звёздного полотна.
    0x2886A, // Внезапно Сидзунэ вскидывает руки к открытому небу, словно удерживая его в своих руках.
    0x28909, // Словно она говорит мне: «Оглядись, посмотри на мир вокруг!»
    0x28975, // Школа, купающаяся в свете фестиваля и раскрашенная цветастыми кимоно, крыша, освещённая светлячками, небо, настолько огромное, что вселяет благоговейный трепет.
    0x28A9D, // Чего она хочет? Понимание медленно снисходит на меня. Этот прекрасный вид – доказательство того, что в мире есть много вещей настолько прекрасных, что портить их плохим настроением непростительно.
    0x28C07, // И я чувствую силу личности Сидзунэ, подчёркивающей эту точку зрения.
    0x28C85, // Спасибо, пожалуй.
    0x28CA5, // Я отворачиваюсь в сторону, но Сидзунэ хватает меня за плечо, при этом её часы скользят по моей щеке.
    0x28D5A, // Левой рукой она указывает на небо.
    0x28D99, // Со слабыми хлопками в небе начинают взрываться фейерверки, рассыпая дождь ярких красок, которые медленно исчезают во тьме.
    0x28E7B, // Я не могу вспомнить, когда в последний раз видел фейерверк, не говоря уже о таком большом. К тому же кажется, что его запускают откуда-то из школы, во что почти невозможно поверить.
    0x28FC1, // Огни в небе смешиваются со вторым залпом из города внизу, и создаётся впечатление, что совпадение не случайно, что они призваны дополнить друг друга, как две части дуэта.
    0x290F7, // Это продолжается ещё, наверное, минут пятнадцать, а затем прекращается.
    0x2917A, // Сидзунэ наконец понимает, что рука её так и лежит на моём плече, и аккуратно убирает её со стеснённым видом.
    0x2923E, // Восстановив самообладание, она усмехается, уперев руки в боки и выпятив грудь вперёд.
    0x292DB, // В такие моменты она выглядит словно обычная девочка-подросток. Энергичная, весёлая и беззаботная.
    0x2938F, // Мы с Сидзунэ не торопясь едим, молча наблюдая, как толпа внизу постепенно редеет.
    0x29423, // Она сидит чуть наклонившись вперёд, удобно оперевшись подбородком на сложенные руки, и на лице её написано умиротворение с лёгким оттенком задумчивости.
    0x2953D, // И она по-прежнему бережно держит за лапу плюшевую кошку.
    0x295A4, // Я чувствую, что устал за день, говорю ей, что увижусь с ней и Мишей завтра, – даже и не подумав, что она меня не слышит, – и направляюсь назад к общежитию.
    0x296B8, // Я ощущаю радость жизни и тепло в груди даже на прохладном ночном воздухе.
    0x2973E, // Образ Сидзунэ, твёрдо стоящей перед самими звёздами и призывающей меня отбросить жалость к самому себе, никак не хочет покидать мой разум.
    0x2983C, // Если… если для того, чтобы влюбиться, нужен лишь миг, то, думаю, я влюбился в неё.
    0x298CE, // Самую чуточку.
    0x298E9, // Чем мне заняться? У меня нет никаких планов. Как ни крути, это довольно глупо.
    0x29975, // Может, мне стоило пригласить девушку? Но, с другой стороны, вряд ли я смог бы . Это ведь моя первая неделя.
    0x29A33, // Неделя, которую я потратил впустую, неуклюже ведя себя со всеми, спотыкаясь на каждом шагу, пытаясь понять, как здесь всё устроено.
    0x29B21, // Если подумать, чего я добился?
    0x29B58, // Кого я мог бы пригласить?
    0x29B86, // Чёрт, как ни крути, а выходит, что Кендзи – мой единственный шанс на свидание сегодня.
    0x29C22, // Это самое грустное, что случалось со мной с тех пор, как я схлопотал инфаркт из-за девушки, признавшейся мне в любви.
    0x29CF5, // Ничего не поделаешь.
    0x29D1B, // Я не знаю, правда. Хоть мне и нечем заняться, но крепость – это, кажется, перебор.
    0x29DAD, // Ты уверен, что не хочешь пойти на улицу? Посетители обязательно заявятся сегодня в общежитие.
    0x29E58, // Эти слова его словно громом поражают.
    0x29E9D, // Чёрт, а ты прав. Это место сегодня небезопасно.
    0x29EF2, // Надо найти где спрятаться.
    0x29F23, // На миг он задумывается.
    0x29F4E, // Крыша.
    0x29F5A, // Что «крыша»?
    0x29F71, // Мы пойдём и схоронимся там до позднего вечера.
    0x29FC6, // Идеальное место, туда никто никогда не поднимается.
    0x2A025, // Жди меня там через час. Мне надо приготовиться.
    0x2A07B, // Он захлопывает дверь и закрывает её на замок.
    0x2A0CE, // Блин, да что, чёрт побери, не так с этим парнем?
    0x2A122, // И, подумать только, я сейчас готов смириться с его безумствами. Меня это и правда угнетает.
    0x2A1C7, // Чувствую себя неудачником…
    0x2A1FB, // Я делаю шаг наружу, и меня приветствует оглушительный шум толпы.
    0x2A271, // Вся школа кипит от бурной деятельности.
    0x2A2BA, // Повсюду видны киоски, между которыми роятся внушительных размеров толпы.
    0x2A341, // Я не ожидал, что фестиваль привлечёт столько гостей.
    0x2A3A1, // Должен признать, что люди, отвечающие за украшение территории, знатно постарались, и это заметно.
    0x2A453, // Народу, похоже, весело, и атмосфера яркая, красочная и счастливая.
    0x2A4CB, // То есть была бы, если бы не моё паршивое настроение.
    0x2A529, // Поэтому сейчас фестиваль меня скорее раздражает.
    0x2A584, // Ну, деваться некуда. Я решаю придерживаться изначального плана и поесть, а потом придётся взглянуть, что затеял Кендзи на крыше.
    0x2A66E, // Чтобы убить время, я неспешно прохаживаюсь взад-вперёд, поглядывая на киоски, но настроения играть в игры у меня нет никакого.
    0x2A754, // Кричащие цвета режут глаз, и с каждой минутой мне становится всё хуже.
    0x2A7D4, // Я даже не могу решить, что бы мне съесть, и большой выбор в сочетании с оживлёнными толпами празднующего народа задачу тоже не упрощает.
    0x2A8CC, // Я просто направляюсь к ближайшему лотку, предлагающему что-то хотя бы наполовину съедобное, и встаю в очередь.
    0x2A996, // Оказывается, это лапша.
    0x2A9C1, // Также выясняется, что она не очень-то хорошо приготовлена.
    0x2AA2C, // Ну, по крайней мере, питательная. А ничего другого мне сейчас и не требуется.
    0x2AAB7, // Помешивая свою сомнительного качества лапшу, я вяло задумываюсь, чем сейчас занимаются остальные.
    0x2AB6C, // Сидзунэ и Миша определённо где-то что-то организовывают.
    0x2ABD4, // Мне лучше держаться от них подальше. Думаю, они так быстро не простят, что я бросил их наедине со всей этой работой.
    0x2ACA5, // Эми, мне представляется, шныряет туда-сюда по территории, будучи удручающе жизнерадостной.
    0x2AD4C, // Нет ни малейшего шанса её найти, равно как и избежать случайной встречи, так что пофиг.
    0x2ADEA, // Лилли, вероятно, помогает своему классу с праздничным мероприятием и определённо слишком занята, чтобы составить кому-то компанию.
    0x2AEDB, // Ханако не станет ни с кем общаться. Она либо держится ото всех подальше, либо помогает Лилли.
    0x2AF84, // Рин, должно быть, на посту у своей фрески, пусть и вряд ли чем-нибудь может помочь интересующимся, если таковые найдутся.
    0x2B05F, // Пойти туда ради тишины и спокойствия кажется самым лучшим выбором из имеющихся, но я всё же не могу представить, каким образом заталкивание в мой мозг искусства сможет поднять мне настроение, так что воздержусь.
    0x2B1E2, // Пока я размышляю, моя еда вместе с голодом куда-то исчезает.
    0x2B24F, // Видимо, я просто мысленно отгородился от вкуса еды, что, вообще-то, неплохо.
    0x2B2D8, // Сытый, но не довольный, я разворачиваюсь и иду к главному школьному зданию. Час уже почти прошёл.
    0x2B388, // Толпа здесь даже плотнее, чем снаружи.
    0x2B3CE, // В коридорах не протолкнуться, и я боюсь представить, что творится внутри классных комнат.
    0x2B472, // Я поднимаюсь по лестнице, ведущей к моей цели.
    0x2B4C6, // Крыше.
    0x2B4D2, // К счастью, дверь наверх не заперта, но сейчас на ней висит написанная от руки табличка:
    0x2B570, // Ну, это не мне.
    0x2B58A, // Шум праздника здесь практически не слышен, а крыша выглядит заброшенной, как и ожидалось.
    0x2B62E, // Рядом с местом, где повалено проволочное ограждение, лежит кипа одеял, странно выделяющаяся на общем фоне.
    0x2B6F1, // Погодите.
    0x2B703, // Мне кажется, или куча шевелится?
    0x2B73E, // Удивительно, учитывая полное безветрие.
    0x2B788, // Я осторожно вытягиваю руку и тыкаю её.
    0x2B7CE, // Испугавшись, я отпрыгиваю назад.
    0x2B80A, // Чёрт тебя побери, Кендзи. Это я.
    0x2B843, // Ох блин, чувак, ты меня напугал.
    0x2B87C, // Так что мы здесь делаем?
    0x2B8A8, // Мы устроим пикник.
    0x2B8CA, // То. У меня есть одеяла, крендельки и виски. Идеальный набор, чувак.
    0x2B942, // Виски?
    0x2B94E, // Ты разве не слишком молод для выпивки?
    0x2B994, // Мне, знаешь ли, двадцать.
    0x2B9C1, // …Вовсе нет.
    0x2B9D7, // И мне, и тебе.
    0x2B9EF, // Чего? Что за бред?
    0x2BA0F, // Эй, ТЫ-то, по крайней мере, кое-что с того получил, а мне досталась всего-навсего бутылка виски…
    0x2BABC, // Он несёт какую-то несуразицу, но я решаю ему подыграть.
    0x2BB20, // Так откуда у тебя бутылка виски?
    0x2BB5B, // Моя мама не смогла приехать на фестиваль, поэтому взамен прислала мне дорогого односолодового вискаря.
    0x2BC19, // Звучит правдоподобно.
    0x2BC42, // Хочешь глотнуть?
    0x2BC61, // А что мне, собственно, терять? Этот день хуже стать уже не может.
    0x2BCD5, // …Почему бы и нет.
    0x2BCF5, // Мы располагаемся на куче одеял, которые Кендзи сюда притащил.
    0x2BD66, // Он достаёт почти полную бутылку виски и передаёт её мне.
    0x2BDCD, // Ты даже не принёс стаканы?
    0x2BDFD, // Не, это ж не пикник какой-нибудь романтичной принцесски. Какого хрена, чувак?
    0x2BE89, // Это настоящий мужской пикник.
    0x2BEC0, // Никаких стаканов.
    0x2BEE1, // Никаких салфеточек.
    0x2BF06, // Только виски. Выпивка настоящих мужчин.
    0x2BF4F, // Как скажешь.
    0x2BF66, // И крендельки.
    0x2BF7F, // Я рассматриваю бутылку поближе.
    0x2BFBA, // Односолодовый виски двенадцатилетней выдержки, как он и сказал.
    0x2C030, // Пожав плечами, я делаю глоток. Выпивка обжигает горло, словно кислота, но на вкус вполне неплохо.
    0x2C0E0, // Я чувствую, что виски ударяет в голову, а его послевкусие, задержавшееся во рту, так и просит сделать ещё глоток.
    0x2C1AC, // Нам стоит обсудить ответный удар и промыть косточки знакомым женщинам, пока они нас не слышат.
    0x2C259, // Чёрт, я забыл принести свои графики.
    0x2C29B, // Я решаю поиграть с собой в игру-напивашку. Каждый раз, как Кендзи упоминает «заговор женщин», я делаю глоток.
    0x2C361, // Четыре или пять часов, а может, несколько дней спустя {w}(я сбился со счёта)...
    0x2C3EA, // Не кисни, чувак! Расслабься нахрен! Не, ну правда!
    0x2C443, // Я расслаблен, мать твою!
    0x2C46F, // Говорю, что вижу!
    0x2C48E, // Подумай об этом. Когда начали дорожать земля и дома? Когда женщины начали появляться в качестве рабочей силы, потому что это создало ядрёные двухдоходные семьи.
    0x2C5B4, // Я, конечно, забыл свои графики, но, поверь мне на слово, женщины стоят за разложением всего общества.
    0x2C66A, // Ну да. В это сложно поверить.
    0x2C69E, // Хоть я так и говорю, однако то, что говорит Кендзи, начинает потихоньку приобретать смысл.
    0x2C742, // Всё начинает сходиться, но я не могу понять: то ли Кендзи объясняет лучше, когда пьяный, то ли я, выпив, мыслю яснее.
    0x2C812, // Нет, чувак, думай. Думай! Подумай о глубоких подоплёках!
    0x2C877, // Люди теперь могут сказать что-то типа: «А, ну раз в семье сейчас приносят деньги два человека против одного, то они точно могут позволить себе платить за собственность больше».
    0x2C9B8, // Я понял, о чём ты. Но земля в Японии всегда была дорогой.
    0x2CA1D, // …И цена на землю идёт вверх в основном тогда, когда в стране начинается индустриализация. …Но нет! Это из-за женщин! Корреляция сама за себя говорит.
    0x2CB2D, // А мне-то казалось, что подобные рассуждения – логическая ошибка. Ну ладно, пофиг, может, ты и прав.
    0x2CBDF, // Я всегда прав. Да-а, могу поспорить, женщины придумали индустриализацию, чтобы прикрыть свои следы.
    0x2CC94, // Дьявольски умный план.
    0x2CCBE, // Так что да, все могут идти на хрен!
    0x2CCFC, // Он встаёт, впечатляя меня, потому что я почти уверен, что не смог бы этого сделать, даже если бы и захотел. Его крик такой громкий, словно у Кендзи сорвало переключатель мощности. Я дёргаюсь, испытывая желание зажать уши.
    0x2CE8B, // А-а-ах, как здорово было б оказаться сейчас там, внизу… Но нет. Видишь ли, такие мысли – это ловушка: тебе кажется, что ты что-то упускаешь, но в конце этого пути нет ничего, кроме отчаяния…
    0x2CFE0, // Кендзи выхватывает у меня бутылку и запрокидывает голову, собираясь влить выпивку себе в рот, но в итоге лишь проливает её на себя.
    0x2D0CF, // Вот чёрт! Гляди, я сбил прицел! И, что самое поганое в выпивке, – он сбивается всё сильней, чем больше ты пьёшь.
    0x2D196, // Сегодня день отчаяния.
    0x2D1C0, // Его голос разом опускается до шёпота, но он начинает тараторить, слегка коверкая слова из-за выпитого.
    0x2D27B, // Толкая речь, он размахивает бутылкой, расплёскивая её содержимое там и сям.
    0x2D305, // Да, знаешь, какое было самое ужасное событие в моей жизни?
    0x2D36E, // Я смутно припоминаю, как он рассказывал мне о своём втором-самом-ужасном-событии-в-жизни, а именно – когда птичка нагадила ему на голову.
    0x2D468, // Я не особо много жду от его ответа, но всё равно киваю, чтоб он продолжал.
    0x2D4EC, // Не поверишь, но у меня когда-то была девушка, вроде бы в прошлом году.
    0x2D569, // Эге, я сейчас сорвал тебе крышу, а? Понимаешь, я никому раньше этого не говорил.
    0x2D5F8, // И правда, крышу у меня от этой мысли сносит серьёзно. Мне вдруг начинает хотеться выпить. Я отбираю у Кендзи бутылку и заливаю в себя столько виски, сколько могу.
    0x2D71D, // Я был тогда более невинен и думал, что она в своём уме, в отличие от большинства женщин. Но однажды мы… переспали.
    0x2D7EB, // Вышло вполне себе здорово, но сразу после случилось такое, ты не поверишь, странное и пугающее одновременно.
    0x2D8B1, // Он шарахается к забору, прислоняясь к нему и щуря глаза.
    0x2D917, // Я почувствовал себя ужасно усталым и сонным! Это ненормально, чувак! Что за хрень?
    0x2D9AC, // В смысле, это же должен быть пиковый, адреналиновый момент жизни любого чела, но вся моя энергия словно сливалась в унитаз!
    0x2DA8C, // Тут было замешано что-то зловещее, я это чувствовал.
    0x2DAEB, // И тогда я понял… Женщины опасны, они высасывают жизнь из всех мужчин средством, которое доступно практически им одним!
    0x2DBC5, // Омерзительно.
    0x2DBDF, // Да, братан, тебе стоило бы поостеречься этого…
    0x2DC35, // Кендзи прав, сегодня и впрямь день отчаяния. Я опрокидываю ещё, чтобы избежать раздумий над только что сказанным им.
    0x2DD09, // Теперь я последний разумный человек в безумном мире… Когда другие это поймут, случится война, великая война между мужчинами и силами феминизма.
    0x2DE12, // Но подвох в том, что не все мужики будут сражаться на моей стороне… что хреново. Я мог бы опустить планку до минимума, принимать в свои ряды любого мужика. Но только не тех, кого воспитывала мамочка или сестра, это точно.
    0x2DFA1, // И не тех, кому нравятся членодевки.
    0x2DFE1, // Ха… Я думаю, это вряд ли случится, типа вряд ли, типа… вероятность очень низкая.
    0x2E073, // Похоже, сказывается выпитое.
    0x2E0A8, // Но мне всё равно горько находиться сейчас здесь.
    0x2E101, // По правде говоря, я не ждал фестиваля с той же радостью и предвкушением, как остальные в школе, но тем не менее.
    0x2E1CA, // Было бы здорово с кем-нибудь пойти на него. Глядя отсюда кажется, что все весело проводят время. Наверное, я многое упускаю.
    0x2E2AA, // Просто так вышло, что мне оказалось не с кем пойти.
    0x2E306, // Может, кто-то и был. Если вспомнить, то было столько возможностей, но я их все прохлопал.
    0x2E3A5, // Чёрт, это и есть истинное отчаяние… Самое худшее, что я иногда чувствую, что мне не предоставлено никакого выбора в жизни, понимаешь?
    0x2E498, // Как будто у меня и не было шанса принять решение, вся херня просто шла своим чередом.
    0x2E532, // Как будто всё заранее запрограммировано. Похоже на судьбу… или что-то вроде того. Как будто у меня нет права голоса в определении своих поступков.
    0x2E63E, // Скорее, задай мне вопрос!
    0x2E66C, // Быстро!
    0x2E67A, // Я что-то не совсем…
    0x2E69E, // Видишь? Вот ещё один пример! Чёрт! Дерьмо! Чёрт! Видишь, да? Я сейчас пытаюсь пойти против судьбы и взять управление своей жизнью в свои руки, но у меня даже нет возможности.
    0x2E7D5, // Блин, чувак, ты меня обломал. Обломал меня в последний раз. Гад.
    0x2E847, // Он падает на колени, затем валится набок, растягиваясь на гравии крыши.
    0x2E8C9, // Эй, ты в порядке?
    0x2E8E7, // Нет, я не в порядке, не видишь – я в отчаянии?
    0x2E938, // Отвечает он мне язвительно.
    0x2E96B, // Внезапно Кендзи садится, неловко отряхивается и протягивает ко мне руку за бутылкой. Я передаю ему остатки.
    0x2EA30, // Что за чёрт? Блин, ты прикончил почти целую бутылку. Видишь, это как моя жизнь – никаких альтернатив…
    0x2EAE9, // Так и будет теперь всё время?
    0x2EB1E, // Ну, я вполне уверен, что всё время так не будет.
    0x2EB73, // О чём бы он ни толковал. У меня кружится голова. Я встаю и прислоняюсь к ограде, надеясь, что это поможет мне немного собраться.
    0x2EC59, // Да-а, я знаю. Надо превозмогать, сражаться всем, что имеем. Только так и можно жить.
    0x2ECEE, // Ты неплохой парень.
    0x2ED12, // Наша братская связь – то, что поддерживает меня в эти тёмные времена.
    0x2ED91, // Айда троллить женщин.
    0x2EDB9, // Тралить женщин? Чего?
    0x2EDE0, // Троллить женщин. Троллить за женщин. Но нам надо начинать сейчас, пока я не потерял пьяную храбрость.
    0x2EE98, // Он дико размахивает руками. Безумно даже.
    0x2EEE4, // Я отступаю назад.
    0x2EF04, // Он шагает вперёд.
    0x2EF24, // Что с тобой? Не в настроении для любви?
    0x2EF6A, // Если честно… нет.
    0x2EF8B, // Я делаю ещё шаг назад.
    0x2EFB3, // Он делает ещё шаг вперёд.
    0x2EFE1, // Он чересчур близко наклоняется ко мне.
    0x2F028, // Что за чёрт, перестань ко мне прижиматься, мне это не нравится.
    0x2F09A, // Как прижиматься? Эй, не стоит так опираться на ограду, это небезопасно.
    0x2F11B, // Я стараюсь отодвинуться от Кендзи, но моё равновесие меня подводит.
    0x2F197, // Пошатываясь от головокружения, я хватаюсь за столбик ограды, но он поддаётся, как только я наваливаюсь на него своим весом.
    0x2F278, // …Нехорошо это. Хотя мой пропитанный алкоголем мозг не может дать ответ почему.
    0x2F309, // Хотя лицо Кендзи, кажется, становится меньше – хоть какое-то облегчение.
    0x2F38E, // Вообще-то намного меньше. И с такой скоростью.
    0x2F3E2, // И, похоже, начинает дуть ветер. Из-за этого я почему-то кажусь себе почти невесомым.
    0x2F479, // Я в ступоре, будто мой разум полностью опустел.
    0x2F4CF, // Я… падаю?
    0x2F4E1, // Я перевожу взгляд на ночное небо. Бутылка выпадает из моих пальцев и бесследно исчезает, пока я лечу.
    0x2F599, // Я понимаю, что это подходящий конец для плохого, по-настоящему плохого дня.
    0x2F622, // Не знаю. Я голодный, так что подумывал раздобыть еды и сходить на аттракционы.
    0x2F6B0, // У твоего класса вроде крутой проект, и я тоже помогал, так что хочу посмотреть хотя бы его, и ещё поболтать с Лилли, наверное.
    0x2F792, // Кстати, у тебя разве нет обязательств, связанных с проектом?
    0x2F800, // Ты с ума сошёл?
    0x2F81B, // От этой слепой бабы ничего хорошего ждать не следует, печёнкой чую, чувак. Её присутствие – словно мрачная тень на пути моего великого взора.
    0x2F91D, // Чего и можно ожидать от слепых.
    0x2F956, // Чё?
    0x2F95C, // Кроме того, я думал, что ты тоже…
    0x2F998, // Он поднимает руку, прерывая меня.
    0x2F9D5, // Нет, у меня просто проблемы со зрением.
    0x2FA1C, // Метафорически же я вижу дальше, чем кто бы то ни было до меня.
    0x2FA8B, // В подтверждение своих слов Кендзи устремляет взор в мнимую даль, выставив вперёд подбородок, чтобы выглядеть более мужественно. Вообще-то всего в паре метров находится стена коридора, но это не меняет сути.
    0x2FC05, // Я вижу будущее человечества, которое будет мрачным, если не подавить угрозу женщин.
    0x2FC9E, // Они повсюду.
    0x2FCB5, // Он начинает теребить пальцами шарф, всё быстрее и быстрее, будто пытается добыть огонь, затем постепенно успокаивается, пока не проходит приступ паники.
    0x2FDCD, // Мне придётся найти надёжное укрытие, чтобы спрятаться. А потом завалюсь спать, чтобы этот жуткий день обошёл меня стороной.
    0x2FEAF, // У меня для этого есть отличное средство. Пора готовиться.
    0x2FF18, // Не ходи на фестиваль.
    0x2FF3F, // Хорошо.
    0x2FF4D, // Увидимся, чувак.
    0x2FF6B, // Дверь с низким скрипом закрывается, и я даже не знаю, что и думать о словах Кендзи.
    0x30000, // Я покупаю пластиковую тарелку такояки в киоске соседнего с нашим класса, сажусь в школьном сквере и принимаюсь глядеть на прохожих, неуверенно ковыряя по кусочку довольно безвкусную еду.
    0x30158, // Полагаю, жаловаться не стоит. Всё же лучше, чем ничего, и стоит недорого.
    0x301DB, // Я гляжу на школу – созерцание приходящих и уходящих людей оказывается удивительно неплохим способом скоротать время во время еды.
    0x302CC, // Маленькие дети в сопровождении родителей или бабушек-дедушек шумно носятся от одного развлечения к другому; одной рукой они цепляются за сопровождающего, а в другой держат красочную сладкую вату непомерной величины.
    0x3045B, // Кажется, преобладают люди пожилого возраста. Это я заметил, ещё когда гулял по городу.
    0x304F8, // Должно быть, это один из тех городков, где остались только коренные жители, решительно отказывающиеся его покидать, а также те, кто хочет прожить остаток своих дней в одном из спокойных мест, которых остаётся всё меньше.
    0x30689, // Думаю, это заодно и объясняет, откуда взялась такая консервативность в обычаях школы «Ямаку».
    0x30735, // Я не против. Мне, в общем, нравится спокойствие «Ямаку» и окрестностей.
    0x307B6, // А вот жара – совсем другое дело. Так долго просидев на солнцепёке, я теперь могу думать только о всё усиливающемся зное.
    0x30891, // Мне лучше двигать отсюда, если я—{w=.5}{nw}
    0x308D9, // Гхе!
    0x308E1, // Колокольный звон застаёт меня врасплох, пока я поднимаюсь со скамьи, – то же случается и с несколькими проходящими мимо людьми.
    0x309CB, // Вслед за окончанием перезвона с треском пробуждается к жизни система вещания. О её возрасте можно судить по едва разборчивому объявлению директора, который говорит об открытии и без того идущего полным ходом праздника.
    0x30B5E, // Довольно примечателен контраст между довольными улыбками стариков и, напротив, скучающими и кислыми гримасами людей помоложе. Что же до учеников, то им попросту наплевать.
    0x30C9A, // Тем не менее, когда обращение заканчивается, все дружно, пусть и без особого энтузиазма, хлопают и возвращаются к своим делам.
    0x30D80, // Сунув руки в карманы, чтобы смотреться как можно более расслабленным, я мимоходом оглядываюсь по сторонам.
    0x30E44, // …Особо далеко не посмотришь: кругом люди.
    0x30E91, // Я решаю положиться на проверенное правило: идти туда, куда идут все. Прямо сейчас народ направляется в сторону школьного двора и его окрестностей.
    0x30F9D, // Выбросив тарелку в бак для мусора, я иду к главному зданию.
    0x31008, // Я удивляюсь, увидев, сколько здесь расставлено киосков. Должно быть, немало классов скооперировалось, чтобы выставить их сразу по несколько штук.
    0x31113, // Решая, какой посетить первым, я замечаю знакомый плакат с синей узорчатой окантовкой и красным текстом.
    0x311D1, // Вполне можно начать обход с киоска Лилли. Мне любопытно узнать, как у неё идут дела после всех потраченных на его устройство усилий.
    0x312C2, // Подойдя ближе, я начинаю понимать, почему её классу так долго пришлось возиться, чтобы всё обустроить.
    0x3137D, // Он как минимум вдвое шире большинства других киосков, и повсюду вокруг него расставлено кухонное оборудование, так что он скорее ближе к ресторану на открытом воздухе, чем к фестивальному проекту.
    0x314E6, // Ученик впереди меня берёт миску лапши и отходит, а я приближаюсь к прилавку.
    0x31571, // Девушка за ним кажется довольно сердитой и велит мне подождать, а затем исчезает под прилавком.
    0x31620, // Улучив момент, я быстренько оглядываюсь по сторонам.
    0x31681, // Пар поднимается как будто отовсюду: из медленно кипящих кастрюль, из небольших котелков. Наиболее плохо видящие ученики под присмотром, вероятно, классного руководителя, распаковывают продукты.
    0x317E7, // Вскоре я замечаю Лилли, которая разговаривает с учительницей, ловко пересчитывая пальцами коробки и пакеты.
    0x318AE, // Судя по её выражению и тому, что она, равно как и учитель, находится в состоянии лёгкого замешательства, очевидно у них некие проблемы со снабжением.
    0x319BD, // Из-под прилавка, закрывая мне обзор, возникает девушка и тут же оборачивается назад с вопросом, где запасная коробка со сдачей.
    0x31AA5, // Лилли на миг замирает, затем они с девушкой меняются местами за прилавком, а учительница быстро куда-то уходит.
    0x31B70, // Простите, у нас небольшие проблемы. Что вы хотели?
    0x31BCB, // Мне требуется несколько секунд, чтобы вспомнить, зачем я здесь. Я поспешно перевожу взгляд на выставленное на прилавке меню.
    0x31CAF, // Хм, ну, я думаю, немного… мисо-супа?
    0x31CEF, // А, это ты, Хисао?
    0x31D0C, // Ага. Похоже, вы неслабо заняты.
    0x31D44, // Сбросив личину официантки, она всем своим видом выражает полнейшее согласие.
    0x31DD2, // Где-то в цепочке доставки наш заказ оказался перепутан. Мы сейчас стараемся всё поправить, но похоже, что у нас есть лишь половина необходимого.
    0x31ED9, // Порции поменьше не решат вашу проблему?
    0x31F22, // Видимо, нам так и придётся поступить, хотя я предпочла бы этого избежать. В том, что добрая половина нашего класса куда-то запропастилась, хорошего тоже мало.
    0x32041, // Я заглядываю ей за спину, чтобы оценить, сколько людей работает в киоске.
    0x320C6, // Их максимум восемь.
    0x320EA, // Могу поспорить, учитель ушла именно поэтому?
    0x3213C, // Да, верно. Она рассчитывает пойти и пригнать на помощь ещё несколько наших одноклассников.
    0x321E2, // Заслышав позади себя звуки шагов, я украдкой бросаю взгляд назад, обнаруживая позади себя пожилую пару, занимающую место в очереди. Полагаю, мне стоит перестать мешкать и прекратить болтовню.
    0x32341, // Вот деньги за суп.
    0x32362, // Суп… А, да, минуточку.
    0x3238A, // Лилли поворачивается и просит чашу мисо-супа, а я тем временем отдаю ей деньги.
    0x3241A, // Вложив монеты в её ладонь, я непроизвольно замечаю, как сноровисто она пересчитывает их своими длинными бледными пальчиками. Обрадовавшись тому, что я дал ей точную сумму без сдачи, она кладёт её в маленький металлический лоток.
    0x325BC, // Спустя всего пару минут суп оказывается готов и бережно вложен в её руки, после чего она разворачивается и без промедления передаёт его мне.
    0x326BD, // Спасибо. Я зайду снова и верну плошку.
    0x32702, // Спасибо тебе, Хисао. О, и ещё кое-что. Ты не видел Ханако?
    0x32767, // Ханако… Нет, сегодня не видел. А что?
    0x327AA, // Она вздыхает со смиренным разочарованием.
    0x327F8, // Да ничего. Мне просто было любопытно, пойдёт ли она на фестиваль.
    0x3286E, // Значит, ты зайдёшь, когда закончишь?
    0x328B0, // Конечно. И я посмотрю, не попадётся ли мне Ханако.
    0x3290A, // Спасибо, Хисао.
    0x32926, // Я отхожу от киоска и присаживаюсь, бережно держа обеими руками исходящую паром деревянную плошку.
    0x329DA, // По сравнению с такояки, которые я брал до этого, совсем неплохо. Холоднее, чем должен быть суп, но запах восхитительный.
    0x32AB3, // Пока я ем, не могу избавиться от смутного чувства вины за то, что не принимаю такого активного участия в обустройстве фестиваля, как остальные ученики.
    0x32BC7, // Ничего не поделаешь, ведь меня занесло в эту школу всего лишь неделю назад, но всё равно мне как-то совестно.
    0x32C8C, // К тому же некоторые ученики явно проводят время на фестивале не настолько весело, как посетители.
    0x32D3F, // Так или иначе, я доедаю и отправляюсь к киоску, чтобы вернуть плошку.
    0x32DBC, // Приняв во внимание, что очереди почти нет, я возвращаюсь не спеша.
    0x32E34, // Видимо, миссия учителя завершилась успешно: я вижу более чем дюжину прилежно работающих учеников и большая часть распаковки уже выполнена.
    0x32F34, // Несмотря на то что большинство спокойно делают свою работу, Лилли, кажется, чем-то расстроена.
};

#endif // KS_SCRIPT_A1_SUNDAY_RU_TL_INDEX