#ifndef KS_SCRIPT_A1_FRIDAY_RU_TL_INDEX
#define KS_SCRIPT_A1_FRIDAY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int script_a1_friday_ru_intl[] = {
    0x0000, // Мой будильник выключается, и я ещё немного праздно валяюсь в кровати, пока вдруг не вспоминаю, что решил дать утренним пробежкам второй шанс.
    0x0102, // Не уверен, что это лучшая из моих идей, но я полон решимости продолжать.
    0x0184, // Речь идёт о моём здоровье, в конце концов.
    0x01D0, // Конечно, в последнее время мне пришлось несладко, но существование не стало от этого настолько невыносимым, чтобы не попытаться сделать всё от меня зависящее, чтобы оставаться в хорошей форме.
    0x0331, // Кроме того, так я докажу, что обладаю каким-никаким самоконтролем, верно?
    0x03B6, // Ведь если я смогу это, то… смогу всё что угодно.
    0x040D, // По крайней мере, я себя в этом постоянно убеждаю.
    0x0466, // Снова оказывается, что я не один на беговой дорожке.
    0x04C5, // Эми, видимо, находится здесь уже какое-то время.
    0x051C, // Похоже, она уже изрядно выложилась.
    0x055D, // Во сколько же она, чёрт возьми, сюда приходит?
    0x05B0, // О, это ты!
    0x05C1, // Не ожидала тебя снова тут увидеть!
    0x0600, // Это почему же?
    0x061A, // Ну, немногие способны вернуться ради второй попытки.
    0x067B, // Она хмурится, по-видимому раздражённая мимолётной мыслью.
    0x06E6, // Как все остальные в команде по бегу, например.
    0x073A, // Но всё это было на добровольной основе, так что ничего удивительного.
    0x07B9, // И время, думаю, слишком раннее…
    0x07F3, // Она пожимает плечами и вдруг будто забывает, о чём только что говорила.
    0x0875, // Хмурый взгляд исчезает без следа, и она возвращается к предыдущей цепочке мыслей.
    0x090B, // Итак! Давай начнём!
    0x092E, // Что?
    0x0936, // Ты ведь пришёл, чтобы снова бегать, так?
    0x097E, // Ну, да.
    0x098A, // Так давай!
    0x099D, // И вот меня хватают и волокут на беговую дорожку.
    0x09F5, // Пробежка проходит по вчерашнему сценарию.
    0x0A43, // Я изо всех сил стараюсь бежать правильно, а Эми двигается с лёгкостью, которой можно только позавидовать.
    0x0B04, // Меня невероятно раздражает то, что я так быстро выдыхаюсь.
    0x0B6F, // Знаю, надо быть терпеливым, двигаться к цели постепенно, но…
    0x0BDE, // Сложно сохранять позитивный настрой.
    0x0C23, // Мы заканчиваем первый круг и выходим на второй.
    0x0C7A, // Эми, кажется, надоело под меня подстраиваться, и она начинает отрываться.
    0x0D00, // Вот на этом месте я вчера и сдался.
    0x0D3F, // Первое, что я вижу по возвращении в комнату, – знакомый ряд лекарств на тумбочке, и он, как обычно, вгоняет меня в тоску.
    0x0E18, // Это напрягает. Я думал, будет нормально. Я думал, что свыкся с этим, пересилил себя.
    0x0EAE, // Но на самом деле… я позволил себе забыть о том, что у меня проблема. Нахождение здесь возвращает меня к реальности, а попытки бороться с ней только ранят.
    0x0FC6, // А размышления не особенно-то помогают. Я подобным уже занимался, месяцами. Видимо, пора двигаться дальше.
    0x1086, // Если я позволю себе забыть о том, что моя жизнь не будет столь же длинной, как у других, я ни к чему не приду.
    0x1148, // Быть может, моя жизнь и не такая, как у остальных, но она всё ещё продолжается.
    0x11D5, // Вот в таком ключе и буду мыслить.
    0x1211, // Я глотаю привычную пригоршню таблеток, пытаясь прогнать внезапно нахлынувшее уныние. Затем собираюсь, чтобы добраться до класса, как обычно пораньше.
    0x1325, // Выйдя в коридор, я замечаю, как Кендзи, крадучись, словно ниндзя, с большой сумкой наперевес, почти беззвучно прокрадывается мимо меня к дверям своей комнаты. В последний момент я его окликаю.
    0x1482, // Здорова.
    0x1492, // Он вздрагивает от неожиданности.
    0x14CF, // А, привет, чувак. Я тебя и не заметил. Очень устал.
    0x1528, // Думаю, он меня даже не увидел, но это неважно.
    0x157A, // Куда ты ходил так рано? За покупками?
    0x15BD, // Не, не за покупками. Иногда мне нужно ходить к… учителю математики. Да, я подумал, что хорошо было бы узнать, когда следующий экзамен, ведь он говорит заранее, если спросить.
    0x16F7, // Тогда что в сумке?
    0x1718, // Думал заодно сходить за покупками, раз уж выбрался на улицу. Мне нужны припасы, чтобы продолжать борьбу против великого феминистского заговора.
    0x1820, // А, понятно.
    0x1834, // Я думал, ты не выходишь наружу.
    0x186C, // Я теперь ношу шляпу.
    0x1891, // Лучше не говорить ему, что на нём нет шляпы.
    0x18E0, // Между нами воцаряется неловкое молчание, и Кендзи нарушает его, начав медленно открывать дверь, скрип которой только придаёт моменту ещё больше неловкости. Он ставит сумку в комнату и закрывает дверь.
    0x1A50, // Ты меня удивляешь: изменил свой обычный распорядок, чтобы разузнать дату экзамена. Ты прямо-таки проявляешь себя прилежным учеником: стараешься ухватиться за любую возможность подготовиться получше.
    0x1BC0, // Я не готовлюсь к экзаменам.
    0x1BF2, // А…
    0x1BF8, // Я просто хотел знать дату. Я на него, конечно, схожу. Мне нужно знать, в какой день нельзя пропускать урок. Он обычно по телефону о подобной фигне сообщает, так что пришлось мне самому идти и спрашивать.
    0x1D65, // А зачем тебе выходить, если ты можешь узнать по телефону?
    0x1DCD, // Я не ношу телефон.
    0x1DEE, // Что ты имеешь в виду? Ты оставляешь его дома?
    0x1E3F, // Не, я не пользуюсь телефонами. У меня нет телефона. Телефоны… Нет у меня его.
    0x1ECA, // Почему у тебя нет телефона? Как у тебя может не быть телефона? Совсем нет? Нет телефона?
    0x1F68, // Мне просто не нравятся телефоны. На самом деле я их боюсь. Не знаю почему. Наверное, это какая-то подавленная травма.
    0x203B, // Ну, короче говоря, когда я слышу, как звонит телефон, начинаю нервничать. Это моя самая страшная тайна.
    0x20F5, // У меня на этот счёт две теории: либо я боюсь получить какой-нибудь неясный, зловещий, судьбоносный и роковой звонок, либо меня когда-то избили телефоном. Так сильно, что я не могу этого вспомнить.
    0x2257, // Причём били по голове.
    0x2280, // Ну а куда ещё меня могли бить так, что я теперь не могу вспомнить? По заднице?
    0x230B, // Неожиданно логично. Я чувствую себя подавленным. Понимая, что разговор более или менее подошёл к концу, Кендзи открывает дверь и собирается войти.
    0x2417, // Ладно, пойду я спать, чувак. Хорошего дня.
    0x2462, // Урок начнётся уже минут через двадцать.
    0x24AB, // Я сегодня уже кое-что сделал. Слишком устал, чтобы идти на занятия.
    0x2524, // Эй, тебе нужен бальзам для губ? Я случайно купил два; думал, что они начали продавать пальчиковые батарейки поштучно.
    0x25F9, // Спасибо, не надо.
    0x2618, // Дверь в конце коридора со скрежетом распахивается и со всего маху бьёт о стену. За грохотом следует взрыв смеха, и я сразу понимаю, кто это.
    0x2715, // В тот момент, когда Сидзунэ и Миша входят в коридор, Кендзи, словно ниндзя, исчезает в своей комнате и захлопывает за собой дверь. Сидзунэ идёт небольшими чёткими шагами, а Миша немного виляет от стены к стене.
    0x2891, // Я пытаюсь последовать примеру Кендзи, но уже слишком поздно. Миша ставит ногу в дверной проём, чтобы я не смог закрыть дверь, так что у меня не остаётся иного выбора, кроме как впустить их.
    0x29E6, // …
    0x29EA, // Привет, Хиттян~! Привет-привет~!
    0x2A23, // Привет.
    0x2A31, // Что вы здесь делаете?
    0x2A58, // Достаточно ли длительной была пауза между этими двумя предложениями, чтобы быть вежливой?
    0x2AFE, // Хиттян, это грубо~! Мы пришли забрать тебя!
    0x2B4B, // Ты подумал, что мы решили, что ты собирался сбежать, и пришли, чтобы не позволить тебе этого? Конечно же нет, Хиттян~!
    0x2C1D, // Эй, я не говорил, что вы здесь для этого.
    0x2C65, // Но теперь я знаю, что они здесь именно по этой причине.
    0x2CC8, // Пришло время для работы в Совете, да-да~!
    0x2D11, // Ты разве не счастлив, Хиттян, что сможешь помочь це~лой школе~? Ты прямо как герой~! Грядущие поколения будут слагать легенды об этом дне!
    0x2E09, // Интересно. Не думал, что вступление в Школьный совет будет подвигом, достойным Геракла.
    0x2EA9, // Ну… Раз я пообещал, то…
    0x2ED5, // Сидзунэ, которую я только сейчас замечаю краем глаза, заглядывает мне через плечо, чтобы осмотреть мою комнату. Её цепкий взгляд мечется от предмета к предмету…
    0x2FFC, // В душу закрадывается неприятное чувство беззащитности из-за такого бесцеремонного вторжения. К счастью, на полу нет грязного белья или чего-нибудь в этом роде.
    0x3121, // М? Что такое, Ситтян?
    0x3146, // Да, это комната Хиттяна~! И правда, мы же её раньше не видели!
    0x31B3, // Выглядит скучновато, но у Хиттяна просто не было времени, чтобы её украсить, да~?
    0x3245, // А это что?
    0x3257, // Она указывает на коллекцию лекарств на тумбочке.
    0x32B1, // Когда я иду к своему месту, за мной продолжают пристально следить только двое.
    0x3340, // Я усаживаюсь на своё место, но не проходит и пятнадцати секунд, как в меня через рубашку впивается ноготь Миши, что меня нисколько не удивляет.
    0x3444, // Пс-с! Где ты был?
    0x3461, // Не твоё дело.
    0x3479, // Я знаю, что это худший ответ, годный только на то, чтобы сильнее возбудить их любопытство, но у меня нет сил придумывать замысловатые истории.
    0x357B, // Как ни странно, Миша отстаёт. Сегодня она сдаётся удивительно быстро.
    0x35FA, // Через минуту она снова тыкает в меня пальцем.
    0x364D, // Ну давай, расскажи! Ситтян тоже очень интересно!
    0x36A5, // Ага, как же, сдаётся она. Размечтался. Она просто обсуждала с Сидзунэ наиболее верный способ, как меня расколоть.
    0x3772, // Нет.
    0x377A, // Она снова отступает для переговоров.
    0x37BE, // Оказавшись в кабинете Совета, я оглядываюсь по сторонам и вижу, что он пуст.
    0x3848, // Значит, работы осталось немного, да? Раз никого больше нет, и вообще.
    0x38C4, // Здесь всегда так, Хиттян~!
    0x38F3, // Это подтверждает мои догадки, которые мне доселе нечем было подкрепить: Сидзунэ и Миша – это и есть Школьный совет. Весь, целиком.
    0x39E0, // Проклятье! Значит, это правда. В Школьном совете действительно только вы двое.
    0x3A6F, // Сидзунэ выглядит так, будто не может определиться: устыдиться или взорваться от злости, а Миша в той же степени разрывается между смехом и попытками остановить Сидзунэ.
    0x3BA4, // Что ж, Хиттян, ты будешь рад узнать, что поскольку нас всего трое, то работы для нас полно! Полно~! Полно~ полно~ полно~…
    0x3C7A, // Это меня не радует.
    0x3C9D, // Но, похоже, очень радует Сидзунэ.
    0x3CD9, // Ва-ха-ха~!
    0x3CEA, // Шучу-шучу!
    0x3CFD, // На самом деле не так уж много, Хиттян~. Поэтому~, можно сначала позволить себе небольшой ланч.
    0x3DA6, // Ха-ха-ха~!
    0x3DB7, // У обеих будто из воздуха появляются пластиковые контейнеры.
    0x3E26, // Хм~ хм~… Тут куриные отбивные с помидорами и ростками соевых бобов~! Разве не аппетитно звучит, Хиттян?
    0x3EE1, // Приготовлено только сегодня утром, и всё ещё тёплое, так что ешь-ешь-ешь~!
    0x3F66, // Я беру один из контейнеров и открываю его. Выглядит симпатично и пахнет приятно. То, что я очень голоден, только усиливает эффект.
    0x4052, // Ого, выглядит здорово. Где вы это достали?
    0x409E, // Это неважно, Хиттян!
    0x40C3, // Предполагалось сделать киоск, продающий бэнто, но девушка, которая собиралась им заведовать, вдруг сказала, что не сможет. Ситтян сказала: «Какое расточительство, ведь так сложно было заманить Хиттяна сколотить его~»—
    0x4253, // Эй, какого лешего…
    0x4276, // …Так что~! Ситтян решила попробовать свои силы в этом, но потом решила, что не стоит, да, Ситтян~?
    0x4324, // Сидзунэ сердито дуется, сверля Мишу недовольным взглядом. Кажется, эта история не предназначалась для моих ушей.
    0x43F3, // Это ваши пробники?
    0x4415, // Я тоже это ем, Хиттян~!
    0x443D, // И Ситтян тоже~!
    0x4458, // Это не ответ на мой вопрос!
    0x4489, // И всё же я разламываю пару палочек, которые протягивает мне Сидзунэ, подцепляю кусок отбивной и засовываю его в рот.
    0x455D, // На удивление вкусно. Не ожидал, что Сидзунэ так хорошо готовит.
    0x45D0, // Сидзунэ кладёт палочки, чтобы резко прожестикулировать Мише, которая с трудом заглатывает свою отбивную, чтобы озвучить её слова.
    0x46BF, // Хиттян~! Не говори с набитым ртом~!
    0x46FD, // Не очень-то мне это и нравится. А вот ты излучаешь просто материнскую заботу…
    0x478B, // Ты даже есть правильно не можешь, Хиттян~! Вот и всё~!
    0x47EA, // Это тупик. Я не могу есть, чтобы говорить с Сидзунэ, которая не может есть, чтобы критиковать меня за неумение есть. Миша оказывается втянутой в ту же ситуацию и выглядит из-за этого наиболее несчастной.
    0x495A, // К тому же наша еда остывает с каждой секундой, а она изначально не была такой уж горячей. Как только мы осознаём это, тут же возвращаемся к трапезе.
    0x4A65, // Вскоре звонит колокол, но Миша даже не пытается сообщить об этом Сидзунэ, из чего я делаю вывод, что они собираются пропустить уроки и снова провести здесь остаток дня.
    0x4B97, // Хиттян, у тебя есть какие-нибудь планы на фестиваль?
    0x4BF6, // Нет, не особо. В конце концов, я здесь всего неделю, какие планы я мог построить за это время?
    0x4C9D, // Ва-ха-ха~! Хиттян, ты ведь нам так здорово помог, не будь о себе такого плохого мнения!
    0x4D37, // Хорошо.
    0x4D45, // Мы серьёзно~!
    0x4D5D, // Хорошо!
    0x4D6B, // Они возмущаются по самым невероятным поводам.
    0x4DC0, // Но ты же пойдёшь, да, Хиттян? Ты должен хотя бы посмотреть на то, что мы о—существили?.. Все должны иметь возможность увидеть результаты своих трудов, так они могут в полной мере насладиться сделанным, я так считаю~! И ты не исключение!
    0x4F68, // Хиттян, ты обязательно должен пойти~! Если у тебя нет никаких планов, то мы даже можем пойти вместе~!
    0x501D, // Вам не хватает рук? Если вам понадобится помощь, я буду не прочь её оказать.
    0x50A6, // Я чувствую себя гораздо более непринуждённо, чем раньше; все мои беспокойства и страхи без следа испарились. Веселясь вот так с Сидзунэ, до этого момента я и не вспоминал об эксцессе, случившемся утром.
    0x5216, // Веселясь с Сидзунэ… Сама мысль об этом кажется странной, но, если взглянуть со стороны, я, несмотря ни на что, действительно наслаждаюсь тем временем, что провожу вместе с Сидзунэ и Мишей в последние несколько дней.
    0x539E, // Если мы пойдём вместе, то я, наверное, могу себе позволить ещё немного побыть с ними. И я полагаю, что это лучше, чем сидеть на уроке.
    0x548C, // Правда, Хиттян? Отлично~! Мы будем считать, что так ты с нами рассчитываешься за бесплатный ланч~!
    0x553C, // Здорово, это здорово, очень~ очень~ здорово~! Ситтян всё равно собиралась позже это предложить! А-ха-ха-ха~! Ва-ха-ха-ха-ха-ха~!
    0x561C, // Это вовсе не бесплатный ланч. В другой ситуации я бы из-за такого разозлился или как минимум немного расстроился, но моё настроение значительно поднялось, поэтому я не обращаю на это внимания.
    0x577B, // Оказалось, что помощь состоит в основном в проштамповывании форм и изготовлении здоровенных стопок копий каждого из пятидесяти бюджетных отчётов.
    0x588A, // Это не сложно, но ужасно скучно и, по словам Миши, является простейшей из стоящих перед ними задач.
    0x593D, // Я чувствую, что устаю всё сильнее и сильнее, и вместе с тем всё меньше горю желанием вернуться на урок. Это особенно плохо, потому что чем дольше я нахожусь за пределами класса, тем сложнее, кажется, встать и вернуться.
    0x5AC8, // Эти двое оказывают ужасное влияние. Они подают никудышный пример. Не сказать, что меня это так уж сильно волнует, и я уверен, что никто не воспринимает их как образцы для подражания, но всё же…
    0x5C26, // Готово~!
    0x5C35, // Ого, быстро. Думаю, я до конца этого урока тоже закончу.
    0x5C99, // Нет, нет, Хиттян, всё готово. Значит, ты тоже заканчиваешь~!
    0x5D03, // Чушь какая-то! Вы что, утверждаете, что делать это было не обязательно и вы держали меня тут просто шутки ради?
    0x5DCB, // Нет~…
    0x5DD6, // Но мы продержали тебя достаточно долго~! Тебе нужно вернуться на урок, Хиттян~! На большую его часть ты ещё успеешь!
    0x5EA7, // А как же вы?
    0x5EBC, // Конечно, мы тоже пойдём, само собой. Прямо за тобой!
    0x5F19, // Успокоившись, я направляюсь обратно в класс. Но прошла уже почти половина урока, так что на полпути я решаю, что это бессмысленно, и коротаю время до следующего урока, попивая сок в коридоре.
    0x6073, // Я поглядываю на дверь кабинета Совета, но она не открывается. Что они там копаются? Доделывают мою часть работы? Ну, это не должно занять много времени, если только там нет ещё работы и они просто хотели, чтобы я ушёл.
    0x61FB, // Чем дольше я об этом думаю, тем больше в этом уверяюсь.
    0x625E, // Сидзунэ… далеко не глупа, но она определённо не способна говорить о таких вещах прямо.
    0x62FD, // Возможно, это потому, что она не может говорить и для неё это труднее. У неё есть Миша, но, в общем, несмотря на напускную лёгкость, между языком жестов и обычной речью есть разница.
    0x6443, // Я собираюсь вернуться и посмотреть, что они там делают, но раздаётся звонок и мне приходится идти в класс.
    0x6504, // Они тоже приходят через несколько минут, и мои былые мысли растворяются в рутине школьной жизни.
    0x65B5, // А к тому моменту, как я вспоминаю о них, школьный день заканчивается и накопившаяся усталость не оставляет мне иного выбора, кроме как пойти к себе в комнату, сделать уроки и лечь спать.
    0x6706, // Лестница на крышу выглядит заброшенной, но её явно недавно использовали.
    0x678C, // Она ведёт к двери, на которой отсутствует замок.
    0x67E4, // Интересно, что за храбрец снял замок?
    0x6828, // Эми толкает дверь и бодро выходит на залитую солнцем крышу.
    0x6895, // Внезапно словно из ниоткуда перед нами возникает высокая тёмная фигура незнакомца. Эми отступает назад, едва не падая с лестницы.
    0x6983, // Ух! Ты меня напугала, Рин!
    0x69B1, // Постой, а это, случайно, не…
    0x69E4, // Заметив, что Рин обращается ко мне, Эми с любопытством на меня смотрит.
    0x6A65, // Вы знакомы?
    0x6A7A, // Я смущённо гляжу на Эми.
    0x6AA6, // Это она – твоя подруга?
    0x6AD1, // Рин переключает взгляд на облака, проплывающие в небе над школой.
    0x6B49, // Не знала, что ты знакома с этим человеком, Эми.
    0x6B9D, // Неловкое молчание длится всего пару секунд, а затем Эми хихикает, словно подобное совпадение – сущая мелочь.
    0x6C65, // Я пригласила Хисао на ланч. Если ты его знаешь, это даже к лучшему.
    0x6CDD, // А. Значит, мне еды не достанется? Или ты его пригласила на ланч без ланча?
    0x6D61, // Эм… ни то, ни другое – у меня еды на троих.
    0x6DAE, // Предусмотрительно.
    0x6DD2, // Пока я стою под башней с часами и проникаюсь здешней атмосферой, девушки отходят на противоположный конец крыши.
    0x6EA1, // Кроме нас, тут никого нет. Думаю, в этой школе крыша не так популярна, как в остальных.
    0x6F3C, // По краям расставлено несколько обветшалых скамеек и столиков. Вероятно, кто-то сделал попытку придать этому месту не такой заброшенный вид.
    0x703D, // Мелкий гравий, покрывающий крышу, шуршит под ногами.
    0x709D, // Я бросаю взгляд на школьный двор и окрестности школы через сетчатое заграждение.
    0x7132, // По двору и перед столовой прогуливаются парочки и группки учеников.
    0x71AF, // На территорию продуктового магазина, расположенного неподалёку, заезжает несколько грузовиков.
    0x7261, // Откуда-то доносится лай сторожевой собаки.
    0x72B0, // Когда я гляжу на панораму, на меня почему-то накатывает почти осязаемое ощущение нахождения в маленьком городке.
    0x737F, // Суматошная жизнь больших городов кажется здесь чужой и далёкой, никому не приходится мчаться, чтобы успеть на автобус, будто это вопрос жизни и смерти, или терпеть мерцание неоновых ламп и дорожные пробки.
    0x74F7, // Я гляжу на новый родной город, даже если он останется таковым только на какой-то год, и при мысли об этой новой жизни на меня накатывает волна оптимизма.
    0x760C, // Внезапная болезнь и вынужденный переезд свалились на меня словно снег на голову, так что у меня не было времени подумать, как я к этому отношусь.
    0x7714, // Выходя из тени башни, я спиной чувствую тёплое прикосновение солнечных лучей.
    0x77A3, // На чистом лазурном небосводе ярко светит солнце.
    0x77FD, // Прохладный порыв ветра заставляет меня поёжиться, но лишь на миг.
    0x7875, // Он несёт ароматы деревьев и цветов, а не смог и выхлопные газы, как было ещё пару недель назад.
    0x7920, // Эми с Рин садятся на скамейку, и Эми достаёт из портфеля три контейнера: один большой и два поменьше.
    0x79D7, // Давай же, Хисао! Чего ты ждёшь?
    0x7A0E, // Двигаясь, чтобы освободить немного места на маленькой скамеечке, она приглашает меня присоединиться.
    0x7AC9, // Я сажусь с самого края, чтобы не стеснять остальных. На такой крохотной лавке каким-то чудом мы умещаемся втроём.
    0x7B97, // Впечатляющий вид.
    0x7BB8, // Подавляя смешок, Эми ставит одну коробку с едой перед Рин, а вторую протягивает мне.
    0x7C51, // Вот! Ланч, как и обещала!
    0x7C7D, // Ничего себе, домашнего приготовления. Я впечатлён.
    0x7CDA, // Ого. Выглядит просто здорово.
    0x7D10, // Спасибо! Я сама их готовлю, когда есть время.
    0x7D61, // Разговор затухает, когда я принимаюсь жевать.
    0x7DB5, // Съев пару кусков, я поднимаю взгляд и вижу, как Рин, ловко открыв коробку, суёт в рот вилку с едой, орудуя только ногами.
    0x7E8D, // Для меня это уже не в диковинку, но я всё равно поражаюсь той ловкости, с которой она всё это делает.
    0x7F42, // Это лишний раз напоминает мне о том, где я нахожусь.
    0x7FA0, // Привыкну ли я когда-нибудь к подобным зрелищам?
    0x7FF7, // Я вообще не уверен, хорошо или плохо привыкать к такому.
    0x805D, // Не будет ли это означать для меня полную потерю надежды на возврат к обычной жизни?
    0x80F5, // Или только то, что я стану лучше понимать окружающих?
    0x8156, // От этих мыслей меня отвлекает вид Эми, которая набрасывается на еду так, словно та оскорбила её предков.
    0x8214, // Похоже, ты голодная.
    0x8239, // Она поднимает взгляд, энергично при этом жуя, затем проглатывает и кивает.
    0x82C1, // Утренние пробежки всегда пробуждают аппетит.
    0x8315, // И это здорово: благодаря ему еда усваивается быстрее.
    0x8377, // Это помогает мне поддерживать стройную девичью фигуру.
    0x83DD, // А что случится, если ты её потеряешь? Станешь мужиком?
    0x843F, // Мне каким-то чудом удаётся не подавиться, сдерживая смех.
    0x84A8, // Это фигура речи.
    0x84C6, // А твоей фигуре тоже приходится бегать по утрам?
    0x851D, // Вы всегда так разговариваете?
    0x8554, // Вот и ответ на мой вопрос.
    0x8583, // А, неважно.
    0x8597, // Так, э…
    0x85A5, // Мне трудно придумать тему для беседы, и я решаю задать очевидный вопрос.
    0x8629, // Как вы познакомились?
    0x8651, // Похоже, Рин не против, чтобы об этом рассказала Эми.
    0x86AF, // Кто-то в жилищном отделе решил, что мы прекрасно друг друга дополним, и поселил нас в соседние комнаты.
    0x876A, // Дополните друг друга?
    0x8792, // Как костюм и туфли.
    0x87B5, // А?
    0x87B9, // Видя моё замешательство, Эми весело хихикает.
    0x880D, // Вместе у нас полный комплект конечностей, понимаешь?
    0x886E, // Так что я начала помогать Рин собираться по утрам – вот и познакомились!
    0x88F3, // В смысле, нельзя ведь помогать кому-то каждое утро одеваться и при этом не подружиться.
    0x8992, // Понятно.
    0x89A2, // Рин, воспользовавшись моментом, вставляет слово.
    0x89FC, // У меня проблема с рубашками.
    0x8A30, // Да, это… скажем, очевидно.
    0x8A60, // Правда?
    0x8A6E, // Типа того…
    0x8A83, // До Рин никак не доходит, но Эми вся эта сцена, очевидно, веселит.
    0x8AF7, // В сочетании с искренним недоумением Рин, это помогает мне говорить более свободно, но в то же время сбивает с толку.
    0x8BCA, // Понимаешь, у тебя же нет рук.
    0x8BFE, // Так что, эм, одевание рубашки попадает в категорию вещей, которые тебе… трудновато делать.
    0x8CA4, // Знаете что? Лучше мне заткнуться прямо сейчас.
    0x8CF9, // Это убережёт меня от кучи проблем в дальнейшем.
    0x8D50, // Рин с серьёзным видом кивает, словно изображая мудреца.
    0x8DB6, // Я снова переключаюсь на еду, и разговор затухает.
    0x8E10, // Ланч действительно очень вкусный.
    0x8E4F, // Эми доедает первой и с довольным видом вздыхает.
    0x8EA8, // Ох, вкуснятина какая.
    0x8ECF, // Пока она убирает за собой, Рин обращается к ней.
    0x8F26, // Я хочу пить.
    0x8F3C, // Ой! Я чуть не забыла! Извини…
    0x8F71, // Она торжественно вытягивает из портфеля три пакета сока.
    0x8FDA, // Бросает мне клюквенный, Рин даёт вроде бы клубничный, а себе оставляет розовый пакет с каким-то ещё.
    0x9090, // Рин ловко протыкает пакет соломинкой и начинает пить.
    0x90F3, // И вновь я дивлюсь её гибкости и ловкости, но в этот раз воздерживаюсь от комментария.
    0x918E, // Мне почему-то кажется, что Эми и Рин особенно не задумываются над тем, как они обходят ограничения, накладываемые их инвалидностями.
    0x9280, // Особенно Рин.
    0x9299, // В самом деле, она создаёт впечатление, будто ей и вовсе невдомёк, что у неё отсутствуют какие-либо конечности.
    0x9361, // Другой вопрос – сознательно ли она решила игнорировать этот факт или нет.
    0x93E9, // Я, честно говоря, не знаю.
    0x9417, // Ну так что, Хисао, нравится тебе здесь?
    0x945D, // Хм?
    0x9463, // Да, тут довольно мило. Люблю высокие места за открывающийся вид.
    0x94D8, // Спасибо, что пригласила меня сюда.
    0x9517, // И за еду спасибо.
    0x9536, // Эми улыбается яркой, как тысяча лампочек, улыбкой, явно довольная моим ответом.
    0x95C7, // Всегда пожалуйста!
    0x95EA, // Если захочешь, приходи с нами поесть и в следующий раз, ладно?
    0x965A, // Ланч я тебе не приготовлю, но ты можешь принести свой.
    0x96BC, // Еды не будет? Ну, тогда не знаю…
    0x96F6, // Эми изображает обиду.
    0x971E, // Пытаешься воспользоваться моей добротой?
    0x976B, // Какая наглость!
    0x9788, // Она хихикает.
    0x97A1, // Ну, если таков твой ответ, то, думаю, мы с Рин продолжим есть в одиночестве…
    0x982A, // Меня внезапно атакует самый душераздирающий щенячий взгляд, который я только видел.
    0x98C5, // Шутка! Я пошутил!
    0x98E4, // Я бы с радостью ещё тут поел.
    0x9918, // Хорошее место, да и компания – ничего.
    0x995E, // Эми немного хмурится на моё «ничего», но кажется довольной тем, что я принял её приглашение.
    0x9A06, // Полагаю, мы теперь друзья.
    0x9A36, // Или хотя бы приятели.
    0x9A5D, // Звенит колокол, призывающий спускаться обратно.
    0x9AB6, // Рин, ты опять не доела!
    0x9ADF, // Я не сильно проголодалась.
    0x9B10, // Если ты не будешь есть больше, то скоро совсем исчезнешь!
    0x9B78, // Рин пожимает плечами, показывая тем самым, что готова пойти на такой риск.
    0x9BFF, // Давайте, пора уже идти.
    0x9C29, // Мы втроём спускаемся по лестнице.
    0x9C67, // Дневные уроки заканчиваются. У меня снова нет никаких планов, поэтому я направляюсь в библиотеку, чтобы вернуть пару прочитанных книг.
    0x9D5E, // Войдя, я замечаю, что сегодня здесь так же мало учеников, как и во вторник, что подчёркивает практически абсолютная тишина, царящая в помещении.
    0x9E64, // Когда я отправляю книги в лоток для возврата, вделанный в прилавок, из-за него внезапно выскакивает Юко, испуганная раздавшимся грохотом книг, упавших в тележку рядом с ней.
    0x9FA0, // О, прости, Юко. Я не хотел тебя напугать.
    0x9FE8, // Нет-нет. Всё в порядке. Такое случается… часто. Я уже привыкла.
    0xA05A, // М, чем я могу помочь?
    0xA07F, // Всё нормально, я думаю, что уже знаю, где тут что. Но спасибо.
    0xA0EC, // Стоит, наверное, прихватить ещё пару книжек, раз уж я здесь. Делать особо больше нечего, да и после того, как я так много прочитал, пока лежал в больнице, чтение стало трудноискоренимой привычкой.
    0xA24E, // Я дохожу до отдела с художественной литературой в противоположном конце библиотеки, осматривая полки на предмет чего-нибудь интересного.
    0xA34C, // По дороге я заглядываю за угол, где в прошлый раз сидела Ханако, не ожидая, однако, кого-нибудь там увидеть.
    0xA40E, // …Тем не менее, к моему удивлению, она находится там, полностью поглощённая чтением довольно толстой книги. Я решаю ей не мешать, как в прошлый раз, а продолжить поиски чтива.
    0xA54A, // Поизучав какое-то время полки, я наконец останавливаю свой выбор на парочке книг и забираю их с собой.
    0xA604, // Я торопливо подхожу к прилавку, оформляю книги, убираю их в портфель и отправляюсь восвояси.
    0xA6AD, // Покидая здание, я замечаю, что приближается закат. В школе ещё остаются ученики, но большинство уже разошлось по домам или общежитиям.
    0xA7A2, // Думаю, надо сходить за продуктами. Я не могу постоянно обходиться едой из столовой и из забегаловок.
    0xA859, // Когда я выхожу к воротам, несколько раз шумно потягиваюсь в попытке сбросить с себя накопившуюся за неделю усталость.
    0xA931, // Выйдя за ворота и завернув за угол, я замечаю одинокую фигуру, спускающуюся с холма по направлению к городу. Цвет её волос и постукивания тростью ни с чем не спутаешь.
    0xAA60, // Я поспешно догоняю её, что, кажется, привлекает её внимание без всяких слов.
    0xAAEA, // Привет, Лилли.
    0xAB04, // Она немного поворачивает голову, чтобы уловить источник голоса и распознать человека, которому он принадлежит.
    0xABD1, // …Хисао?
    0xABE0, // Ага, это я.
    0xABF3, // У неё хорошая память на голоса. То, что она запомнила мой, оказывается приятным сюрпризом.
    0xAC97, // Добрый вечер. Что тебя сюда привело?
    0xACD9, // Она снова отвешивает лёгкий вежливый поклон. А я снова отвечаю ей тем же, не успевая сообразить, что это не обязательно.
    0xADB3, // Просто иду в город. А ты?
    0xADDF, // Боже, боже, какое совпадение.
    0xAE14, // Идёшь туда же, да?
    0xAE34, // М-м. Я всегда хожу в магазин по пятницам.
    0xAE7D, // Некоторое время она молчит и вдруг обретает потерянный вид.
    0xAEEB, // И обычно Ханако ходит в город со мной…
    0xAF32, // А… Не потерянный – просто взволнованный. Они ведь вроде бы довольно близки. Удивляет, что Ханако может вот так забыть о Лилли.
    0xB019, // Я видел, как она читала в библиотеке. Может, её просто увлекла книга?
    0xB095, // Она облегчённо вздыхает.
    0xB0C3, // Спасибо. У неё есть такая привычка.
    0xB103, // Заядлая читательница?
    0xB12C, // Верно. Она не любит бывать среди людей, и чтение вдали ото всех её немного расслабляет.
    0xB1CA, // Хоть в намерения Лилли наверняка не входило напоминать об этом, мне не удаётся удержаться от того, чтобы сделать кислую мину, вспоминая свою первую встречу с Ханако.
    0xB2F8, // Не горя желанием поднимать эту тему, я продолжаю молчать, пока мы шагаем по тихой дороге.
    0xB39A, // Тук, тук. Тук, тук.
    0xB3BA, // Благодаря отсутствию на дороге машин и тому, что ученики «Ямаку» остаются всё дальше и дальше позади нас, сейчас слышен только тихий шелест листвы и размеренное постукивание трости Лилли по тротуару.
    0xB529, // Что просто здорово, особенно если сравнить эту тишину с толкотнёй и суетой города, в котором я жил раньше.
    0xB5EA, // Это настолько умиротворяет, что я ненароком широко и громко зеваю.
    0xB664, // Устал?
    0xB670, // Да уж, в последнее время совсем с ног сбился.
    0xB6C1, // Это мягко говоря. Переход в новую школу сам по себе труден, а тут ещё такое…
    0xB74B, // Ну, будем надеяться, что всё скоро устроится. Из-за фестиваля все сейчас как белки в колесе, и ты угодил прямо в гущу событий.
    0xB82D, // Я немного колеблюсь, но, учитывая то, как она любит открытость, решаю поделиться с ней своими мыслями относительно всего.
    0xB90A, // Наверное. Однако в «Ямаку» всё по-другому. То есть формальности на каждом шагу, изолированное расположение школы… Не говоря уже о самом очевидном отличии.
    0xBA26, // Здесь у всех совсем другой образ мышления. Но думаю, что со временем я привыкну.
    0xBAB7, // Она утвердительно кивает, видимо довольная моим ответом. Кажется, она сейчас включила меня в паству, состоящую из учеников, о которых заботится, включающую класс 3-2 и Ханако.
    0xBBF4, // Я не возражаю. В любом случае приятно свалить с плеч гору мыслей.
    0xBC6A, // Есть и положительный момент: можно воспринять это как шанс начать всё заново. Тебе стоит ценить возможность завести новых друзей.
    0xBD58, // Оптимистично. Думаю, что иметь такой позитивный настрой – это замечательно.
    0xBDE4, // Верно подмечено.
    0xBE03, // Продолжая идти по дороге, она, кажется, начинает волноваться. Прежде чем я успеваю поинтересоваться, в чём дело, она вновь принимает уверенный вид и меняет тему.
    0xBF28, // А куда ты конкретно собирался пойти в городе?
    0xBF7B, // Вопрос на самом деле неплохой. Хорошо бы пойти купить еды, но я до сих пор абсолютно незнаком с городом.
    0xC037, // Я намеревался просто побродить по округе и найти какой-нибудь магазинчик, но, поскольку закат близится и вскоре стемнеет, это не самое мудрое решение.
    0xC14A, // Придётся мне спросить у неё дорогу. Опять.
    0xC197, // Я собирался купить еды… но, когда ты спросила, вдруг понял, что не знаю, куда мне идти.
    0xC233, // В таком случае это большая удача. Я тоже как раз собиралась идти в продуктовый магазин.
    0xC2D2, // Кажется, тебе снова придётся взять меня под крыло. Спасибо.
    0xC33E, // И мы вместе отправляемся в магазин. Я замедляюсь, чтобы держаться рядом. По сравнению с моей обычной походкой, её шаги заметно медленнее. Тому есть причина, конечно.
    0xC46A, // Через несколько минут ходьбы я примечаю нашу цель. Городок действительно маленький.
    0xC505, // Мы без лишних проволочек проходим внутрь под приветствие кассира.
    0xC57F, // Ты не против, если я увяжусь за тобой? Обычно Ханако мне помогает, но поскольку её сейчас нет…
    0xC62A, // Я не сразу осознаю, о чём она.
    0xC65F, // Учитывая, что она не в состоянии прочитать ни одной этикетки, поход за покупками без помощи окажется для неё сущей мукой.
    0xC73C, // К тому же меня не покидает ощущение, что она задумала это сразу же, как только я сказал, что направляюсь сюда.
    0xC802, // Конечно. Буду рад.
    0xC823, // Я беру из стопки у входа пару красных видавших виды корзинок и протягиваю одну из них Лилли.
    0xC8CB, // Опустив корзинку на пол, Лилли кладёт в неё портфель, складывает трость, отправляет её туда же и берёт корзинку в правую руку.
    0xC9B0, // Стоп, если она будет без трости…
    0xC9EC, // Не успеваю я закончить мысль, как она своими тонкими пальцами берёт меня за манжету формы.
    0xCA91, // Ты не возражаешь?
    0xCAB1, // А, нет, конечно.
    0xCACD, // У меня нет причин отказываться. Есть вещи и похуже, чем ходить по магазину с симпатичной девушкой, держащейся за меня, пусть даже и из необходимости.
    0xCBDC, // Мы передвигаемся меж рядов, и никто из случайно проходящих мимо покупателей и бровью не ведёт при виде нас.
    0xCCA0, // Учитывая то, как близко находится «Ямаку», для местных жителей наверняка является обычным делом видеть учеников оттуда.
    0xCD7D, // Каждый раз, когда мы подходим к очередному ряду, я выясняю у Лилли, что ей нужно. Я беру это, а также и то, что нужно мне, и раскладываю продукты по корзинкам.
    0xCE97, // Наверное, для них с Ханако всё это обычное дело.
    0xCEEE, // Так, мне осталось только хлеб купить. Тебе ещё что-нибудь нужно, Лилли?
    0xCF6E, // Нет, это всё.
    0xCF85, // Ну, тогда на выход.
    0xCFA7, // Быстренько заглянув в хлебный отдел, мы направляемся к кассам.
    0xD01A, // Очереди, к счастью, почти нет. Вскоре мы, расплатившись, выходим за дверь.
    0xD09F, // Пока Лилли достаёт и раскладывает свою трость, я, держа обе наши сумки, поднимаю взгляд в ночное небо.
    0xD158, // Я пытаюсь выпустить изо рта облачко пара, но летняя жара не хочет мне в этом содействовать.
    0xD1FE, // Наконец Лилли выпрямляется, быстро потягивается и берёт у меня свою сумку.
    0xD287, // Ты тоже устала?
    0xD2A3, // Подготовка к фестивалю – сущий хаос. И то, что Сидзунэ дышит мне в затылок, не очень-то помогает.
    0xD352, // Эй, она всего лишь старается всё организовать. Лучше сейчас, чем когда будет поздно, верно?
    0xD3F7, // Думаю, да. Завтра я буду расслабляться в городе, это уж точно.
    0xD466, // Наверное, подготовка к фестивалю сказывается на них обеих.
    0xD4D2, // Мы шагаем по тихой улице с сумками, полными покупок, беседуя между собой.
    0xD557, // …Постойте-ка, а это что?
    0xD583, // Я замечаю довольно необычную фигуру, приближающуюся к нам в свете уличных фонарей.
    0xD61B, // Сначала кажется, что это мальчик из моего класса, но, как только он, а точнее она, подходит поближе, я сразу её узнаю.
    0xD6ED, // Рин? Что ты тут делаешь так поздно?
    0xD72C, // Рин?
    0xD734, // Лилли поднимает голову, прислушиваясь. Я вдруг осознаю, что, наверное, мне стоит описать для неё происходящее.
    0xD7FD, // Это Рин… по фамилии вроде бы Тедзука. Из нашей школы.
    0xD85E, // Услышав имя, она напрягается и её лицо обретает сложное выражение: нечто вроде сочетания натянутой улыбки и мученической боли.
    0xD947, // А. Понятно.
    0xD95B, // Думаю, Лилли тоже знает Рин.
    0xD98E, // Рин поворачивается к нам. Кажется, она абсолютно не в себе. Я не могу понять: она не узнаёт нас или всё же узнаёт, но не подаёт виду?
    0xDA7A, // Она выглядит как зомби. Или как статуя. Статуя зомби.
    0xDADA, // Но мало-помалу в её тёмных глазах начинают появляться признаки зарождающегося света понимания: она должна как-то отреагировать на мои слова.
    0xDBDD, // Рин моргает. Очень медленно.
    0xDC11, // Наступает неловкая пауза; каждый из нас ждёт, пока кто-нибудь что-нибудь скажет.
    0xDCA3, // Что ты делаешь здесь в такой поздний час?
    0xDCEE, // Я…
    0xDCF4, // Я тоже задала себе этот вопрос. Только что.
    0xDD42, // Кто-то из прохожих спрашивал об этом совсем недавно. Полагаю, их интересовало то же самое.
    0xDDE6, // Я не знала. И они не знали. Я спрашивала. Поэтому я и задаюсь этим вопросом.
    0xDE6D, // Вот и вся история. Это убийственная загадка, только без убийства.
    0xDEE4, // Они направлялись в ту сторону.
    0xDF1C, // Она поворачивается вправо, демонстрируя направление, в котором ушли прохожие, будто это имеет значение, потом – обратно, как механическая кукла на замысловатых часах.
    0xE04F, // Для замкнутого человека Рин использует слишком много слов для описания довольно второстепенных вещей.
    0xE10D, // Не будучи уверенным в том, что она закончила, я продолжаю молчать. Как и Лилли, у которой, похоже, пропал дар речи.
    0xE1DA, // Видимо, мы просто боимся, что ответ может спровоцировать продолжение истории.
    0xE269, // Отсутствие реакции с нашей стороны совсем не волнует Рин. Она меряет нас выжидающим взглядом, лицо её практически ничего не выражает, кроме спокойствия.
    0xE381, // Такой она, похоже, человек. Всегда расслаблена.
    0xE3D7, // Как будто по её венам вместо крови течёт лошадиная доза успокоительного.
    0xE45D, // У тебя амнезия? Хотя я не припоминаю у тебя ничего подобного…
    0xE4CE, // Нет, думаю, что дело не в этом.
    0xE504, // Но те прохожие, видимо, волновались. Ты действительно выглядишь потерянной, стоя вот так посреди улицы.
    0xE5C1, // Может быть, в таком случае мне следовало принять какую-нибудь другую позу?
    0xE649, // Я размышляю, стоит ли мне распространяться на эту тему дальше или сдаться ради сохранения остатков собственного рассудка.
    0xE72A, // В итоге склоняюсь ко второму варианту.
    0xE771, // Похоже, не стоит слишком уж вслушиваться в болтовню Рин.
    0xE7D8, // Разговор с Рин похож на игру в шахматы с суперкомпьютером, который делает случайные ходы, будто насмехаясь надо всеми шахматными правилами. Здесь то же самое, только взаимодействие идёт с человеком.
    0xE944, // И даже победа в таком случае имеет привкус поражения.
    0xE9A6, // Чёрт, это напоминает речь Кендзи. Даже когда я выигрываю, то проигрываю. Это особая способность девушек из «Ямаку»?
    0xEA78, // Я отбрасываю эту мысль как опасную для дальнейшего обдумывания. Наверное, это просто антиженская пропаганда Кендзи оказывает на меня такое воздействие в минуты слабости.
    0xEBB2, // Да, может быть, если бы ты приняла другую позу, это бы сработало.
    0xEC26, // Так что, у тебя нет мыслей насчёт того, что ты здесь делаешь?
    0xEC93, // Она хмурится, явно очень недовольная то ли моим вопросом, то ли его последствиями, то ли ответом, который она собирается дать.
    0xED78, // У меня есть. Кое-какая мысль. Только не могу сказать, что за мысль.
    0xEDEF, // Ну, хоть какой-то прогресс.
    0xEE20, // Слова Лилли звучат так, будто она обнаружила возможность вывести разговор в нормальное русло. Не могу сказать, что я разделяю её оптимизм.
    0xEF1D, // Да, какая-то есть. Определённо. Остальные придут попозже.
    0xEF85, // Я в этом уверена. У меня всегда есть… причины.
    0xEFD9, // Последовавшее молчание буквально стирает с лица Лилли остатки надежды. Недолго музыка играла.
    0xF087, // Не принимая во внимание беспочвенные, насколько я могу судить, заверения Рин… как лучше в такой ситуации поступить?
    0xF15C, // Мы можем оставить её наедине с её затеями, какими бы они ни были… но время позднее и я не думаю, что нас по головке погладят, если найдут Рин, стоящую здесь среди ночи.
    0xF28A, // А она ведь и будет стоять, если только не вспомнит, зачем сюда пришла.
    0xF308, // Как по мне, так шансы угадать, что происходило у неё в голове, когда она решила отправиться навстречу этому приключению, равны шансам выиграть в лотерею.
    0xF41F, // Несколько раз подряд.
    0xF447, // Лилли тоже необычайно молчалива. В этом разговоре я был бы рад помощи со стороны, тем более раз Лилли знакома с Рин ближе, чем я.
    0xF52F, // Но ничего не поделаешь. Похоже, причина её нерешительности кроется именно в том, что она слишком хорошо с ней знакома.
    0xF606, // Ну, я предполагаю, что ты куда-то шла, только не в школу… есть догадки куда?
    0xF68E, // Она в шоке округляет глаза и отшатывается столь неестественно, что кажется, будто это движение было специально отрепетировано для подобных ситуаций.
    0xF7A1, // Ты экстрасенс? Это и есть твоя инвалидность? Оригинально!
    0xF80A, // Нет… Что? С чего ты взяла?
    0xF839, // Ты понял, что я делала.
    0xF862, // Ну, я основывался на фактах. Мы недавно шли по этой же улице в обратном направлении, в магазин.
    0xF90D, // Если бы ты шла в школу, наши пути бы не пересеклись.
    0xF96A, // Она выглядит слегка разочарованной.
    0xF9AD, // Как и Кендзи, Рин, похоже, скора на абсурдные умозаключения.
    0xFA1A, // Может быть, что-то не так с местной водой? Я делаю мысленную заметку на будущее: запастись напитками.
    0xFAD1, // Знаешь, меня уже второй раз на этой неделе спрашивают, не экстрасенс ли я.
    0xFB57, // Я действительно произвожу такое впечатление?
    0xFBAB, // Рин только пожимает плечами в ответ.
    0xFBEE, // Знаешь—{w=0.3}{nw}
    0xFC09, // Может быть, вернёшься вместе с нами в школу?
    0xFC59, // Лилли вмешивается как раз в тот момент, как я собираюсь развенчать миф о своих сверхспособностях. Она кажется весьма обеспокоенной, и вымученная улыбка это плохо скрывает.
    0xFD94, // Возможно, она пришла к тому же выводу, что и я. Ради всеобщего блага я бросаю бессмысленную тему про экстрасенсов.
    0xFE63, // Да, Лилли права. Если ты не можешь вспомнить, то нет смысла здесь оставаться.
    0xFEEE, // Рин раздумывает над этим довольно простым выводом, а затем кивает.
    0xFF68, // Мы снова направляемся к школе, потратив из-за этой сцены куда больше времени, чем следовало.
    0x10010, // Рин идёт по краю тротуара своей неровной походкой, похожая на помесь лунатика с канатоходцем, а Лилли держит одну руку на моём плече, постукивая по земле тростью.
    0x10138, // Тук, шарк-шарк, тук-тук, шарк-шарк-шарк.
    0x1017E, // Не считая этого и отрывочных вступлений в беседу, нас окутывает молчание. При этом тишина не такая умиротворяющая, как та, что была по дороге в город.
    0x1028E, // Ну что, как продвигается фреска?
    0x102C9, // Нас настигнет невезение. Никогда не говори о незаконченных работах.
    0x10346, // Я уверена, она будет превосходна.
    0x10383, // Невезение.
    0x10397, // Тук, шаг, тук, шаг. Она не любит говорить об этом. А вежливость Лилли впервые оказывается не к месту. Шарк, шарк, шарк.
    0x10469, // Холм, на вершине которого расположен интернат «Ямаку», в этом месте довольно крутой. Мы замедляем шаг, но я всё равно чувствую, как учащается мой пульс, а дыхание становится всё тяжелее.
    0x105BB, // Почти пришли, уже видны ворота.
    0x105F4, // Помимо этого, однако, я замечаю, что пальцы Лилли немного крепче сжимаются на моём плече. Восприняв это как знак того, что она хочет о чём-то спросить, я подаю голос.
    0x1071E, // Что-то не так, Лилли?
    0x10743, // При этом я еле сдерживаюсь, чтобы не добавить: «Не считая нашего попутчика?»
    0x107CE, // Она, кажется, колеблется несколько секунд, сомневаясь, стоит ли ей вообще заводить этот разговор, но всё же начинает его.
    0x108AA, // Всё… в порядке?
    0x108C7, // В порядке? О чём ты?
    0x108EA, // Моя неспособность понять её невероятно расплывчатый вопрос на мгновение ставит её в тупик.
    0x10992, // Просто… похоже, что ты очень устал.
    0x109D3, // При этих её словах я замечаю, что моё дыхание стало невероятно тяжёлым. Прогулка в гору меня здорово вымотала.
    0x10A9C, // Урок тянется очень неторопливо. Думаю, я начинаю входить в ритм школьной жизни.
    0x10B2D, // Я перестаю конспектировать всё подряд и проявлять чрезмерную внимательность. В первые дни на уроках я был довольно нервным.
    0x10C11, // Муто заканчивает свою лекцию об электричестве чуть раньше и сразу же переходит к теме фестиваля.
    0x10CC3, // Как вы знаете, фестиваль состоится послезавтра. Надеюсь, все ваши проекты будут в этом году иметь успех.
    0x10D81, // Желаю всем приятно провести время, но, пожалуйста, не забывайте истинного значения фестиваля…
    0x10E2F, // Игры и жареная еда!
    0x10E52, // Класс взрывается смехом, и я тоже.
    0x10E90, // Да, спасибо, Микадо.
    0x10EB4, // Но я имел в виду—{w=.5}{nw}
    0x10EDE, // Конец предложения тонет в звоне колокола, возвещающего большую перемену, и все начинают собираться.
    0x10F96, // Муто некоторое время размышляет, стоит ли продолжать, но, поскольку его уже никто не слушает, сдаётся и садится за стол.
    0x11070, // В коридоре людно… настолько, насколько обычно бывает людно в коридорах этой школы. Большинство учеников направляется в столовую.
    0x1115F, // Миша и, соответственно, Сидзунэ, не беспокоили меня целое утро.
    0x111D2, // Когда начинается перерыв, я выхожу из класса, даже не посмотрев на них.
    0x11253, // Что же это я?
    0x1126A, // Неужели я собираюсь сдаться и позволить Эми выбиться вперёд?
    0x112DA, // Я ускоряюсь.
    0x112F1, // Быстро пролетает второй круг, и, даже не обратив на это внимания, я продолжаю бежать.
    0x1138B, // Эми оборачивается через плечо и ухмыляется.
    0x113DC, // Всё бежишь?
    0x113F1, // Не хочу, чтоб… уф… ты подумала, что я… уф… не в форме… уф…
    0x1145E, // Не сбавляя ходу, Эми смеётся. Мало того – она ещё ускоряется.
    0x114CD, // Что ж, если у нас теперь такие правила…
    0x11515, // Я тоже разгоняюсь.
    0x11537, // Я чувствую, как горят мои лёгкие, а ноги вопрошают, что же, чёрт побери, я делаю.
    0x115C6, // Молочная кислота в мышцах возражает против этой гонки, но я не обращаю на это внимания.
    0x11665, // Я не могу позволить себе сбавить темп, потому что это будет равносильно поражению.
    0x116FC, // Голос разума в голове осторожно интересуется, когда это мы начали играть в игру.
    0x1178F, // Я бы ему ответил, но думать сейчас сложновато.
    0x117E3, // Она такая {b}быстрая{/b}.
    0x1180C, // Как, чёрт возьми, ей удаётся—{w=.5}{nw}
    0x1184C, // В груди как будто потянули за струну, появляется душащее чувство тесноты и боль.
    0x118DF, // Я успеваю подумать лишь «вот дерьмо», и тут дорожка уходит у меня из-под ног.
    0x1196A, // Я спотыкаюсь, одной рукой хватаюсь за грудь, а другой защищаю лицо от удара о беговую дорожку.
    0x11A15, // Эми оборачивается, её глаза округляются.
    0x11A60, // Хисао!
    0x11A6C, // Кричит она, бросаясь ко мне с другого конца стадиона.
    0x11ACD, // Что случилось?
    0x11AE8, // Н-н-н… Ничего, просто…
    0x11B12, // Дыши ровно.
    0x11B27, // Успокойся. Не паникуй.
    0x11B50, // Не паникуй.
    0x11B65, // Позвать фельдшера?
    0x11B88, // Я закрываю глаза, отгораживаясь от окружающего мира.
    0x11BE9, // Сердце изо всех сил пытается выровнять ритм.
    0x11C3B, // Боль в груди начинает медленно отступать.
    0x11C88, // Вскоре она проходит, будто ничего и не было.
    0x11CD8, // Ничего… страшного не случилось? Нет, что-то всё-таки произошло.
    0x11D4C, // Я открываю глаза и поднимаю взгляд на взволнованную Эми.
    0x11DB4, // Думаю, я в порядке.
    0x11DD6, // Мой голос даже мне кажется неестественным: он странно ровный и сухой. Это заставляет Эми нахмуриться.
    0x11E90, // А я так не думаю.
    0x11EAE, // Будто приняв решение, она кивает сама себе.
    0x11EFD, // Да. Ты пойдёшь со мной.
    0x11F26, // Тебе нужно показаться фельдшеру.
    0x11F63, // Эми берёт меня за руку и тащит за собой. Меня слегка покачивает, но от предложенного Эми для поддержки плеча я отказываюсь.
    0x12043, // Если честно, я немного стыжусь собственной слабости.
    0x120A4, // Я не хотел, чтобы Эми обо мне беспокоилась, но, кажется, уже слишком поздно.
    0x1212C, // Чёрт, лучше бы вообще никому не было дела до моей болезни, хотя для этого теперь тоже уже слишком поздно.
    0x121EA, // Я бы предпочёл разбираться со всем этим сам, не становясь ни для кого обузой.
    0x12276, // А если уж и желать чего-то, так лучше бы у меня вообще не было этой болезни.
    0x122FD, // Фельдшер!
    0x1230F, // Эми врывается в его кабинет без стука, но его это ничуть не беспокоит.
    0x1238E, // Доброе утро, солнышко. Что случилось?
    0x123D2, // «Солнышко»? Ладно, неважно. Он спокойно прихлёбывает кофе, но, проследив за взглядом Эми, устремлённым на мою мнущуюся в дверях персону, ставит чашку на стол.
    0x124F1, // Хисао? Какими судьбами?
    0x1251C, // Мы бегали, а он споткнулся и схватился за грудь, и я подумала, что нужно сгонять за вами, оставив его там, но он сказал, что всё в порядке. Но я решила, что вам всё же нужно его осмотреть, и—{w=1.5}{nw}
    0x12679, // Подожди, Эми. Успокойся.
    0x126A5, // Что случилось, Хисао?
    0x126CC, // Я не знаю. Мы бежали, а потом у меня заболело в груди, как в прошлый раз, но через несколько секунд всё прошло.
    0x12791, // Это было всего лишь трепетание или типа того.
    0x127E4, // Фельдшер хмурится, будто сочетание «всего лишь трепетание» противоречит само себе.
    0x1287E, // Я не совсем это имел в виду, когда рекомендовал делать какие-то упражнения. Тебе нужно быть осторожнее, Хисао.
    0x12946, // Я был осторожен, просто…
    0x12974, // Если подумать, то «я просто ввязался в гонку с членом команды по бегу» не настолько хорошее оправдание, как я предполагал.
    0x12A53, // Что – «просто»?
    0x12A70, // Э… в общем…
    0x12A87, // Я гнался за Эми.
    0x12AA4, // Эми, это правда?
    0x12AC1, // Эми начинает беспокойно ёрзать на месте, всем видом выражая умильное раскаяние.
    0x12B54, // Эм, ну…
    0x12B62, // В конце концов, так и не сумев сознаться вслух, она просто кивает.
    0x12BD9, // Фельдшер вздыхает и устало трёт рукой лоб.
    0x12C27, // Эми, тебе надо быть более внимательной к пределам возможностей других людей!
    0x12CB4, // Я не знаю, говорил ли он тебе, но у Хисао больное сердце, и заставлять его гнаться за собой было крайне безответственно.
    0x12D8D, // Эм, на самом деле это я начал.
    0x12DC2, // Фельдшер ошеломлён моим заявлением.
    0x12E05, // ЧТО?
    0x12E0D, // Мы просто бежали, потом Эми начала отрываться и я… подбавил, чтоб догнать её.
    0x12E9A, // Фельдшер возводит очи горе, бормоча молитвы о терпении какому-то из богов, затем снова опускает глаза на нас.
    0x12F61, // Значит, вы {b}оба{/b} тупицы.
    0x12F90, // Думаю, это послужит вам утешением.
    0x12FCF, // Теперь давай, Хисао. Надо убедиться, что сердце у тебя не собирается взорваться или что-нибудь в этом роде.
    0x13091, // Я покорно подчиняюсь и следую за ним в соседнюю комнату, где он убеждается, что я действительно не собираюсь упасть замертво.
    0x13176, // Как ощущения?
    0x1318F, // Я не знаю. Ничего особенного. Устал, но это, наверное, просто от пробежки.
    0x13213, // Тебе придётся остаться здесь на несколько часов и отдохнуть, а потом посмотрим, как ты себя будешь чувствовать.
    0x132DF, // Я не собираюсь возражать и просто ложусь на кушетку.
    0x1333F, // После выговора, полученного от фельдшера в соседней комнате, заходит чудовищно несчастная Эми.
    0x133EE, // Сквозь закрытую дверь я не слышал, что он ей говорил, но уверен, что не любезности.
    0x13483, // Слушай, мне очень, очень жаль.
    0x134B9, // Мне следовало быть осторожнее.
    0x134F2, // Эй, ты же не знала. Ты не виновата.
    0x1352F, // Она выглядит ужасно расстроенной и огорчённой, даже мои заверения не помогают ей взбодриться.
    0x135DC, // Я хочу как-нибудь загладить вину.
    0x13619, // Она снова решительно кивает.
    0x1364E, // Так что мы с тобой обязательно перекусим вместе.
    0x136A7, // Я тебе принесу, ладно? Что-нибудь очень-очень вкусное!
    0x13709, // Я начинаю тянуть «тебе вовсе не обязательно…», но затем затыкаюсь и молча киваю, глянув на её лицо.
    0x137BE, // Отлично!
    0x137CE, // Мы встречаемся на крыше.
    0x137FB, // «Мы»?
    0x13805, // Угу! Погода прекрасная, и крыша – замечательное место для ланча.
    0x1387B, // Ты ведь придёшь, да?
    0x1389F, // Не лишишь меня возможности загладить вину?
    0x138EE, // Конечно нет.
    0x13905, // Здорово! Тогда увидимся!
    0x13932, // Я болтаюсь где-то между сном и бодрствованием, чувствуя себя совершенно измождённым.
    0x139CE, // Не только моё тело – весь я ослаб и обезволен, кроме моих чувств.
    0x13A44, // С трудом сглотнув, я решаю лежать настолько спокойно, насколько могу, что в таком состоянии вовсе не сложно.
    0x13B09, // Фельдшер суетится по ту сторону занавесок. Я вижу его тень, двигающуюся в солнечном свете.
    0x13BAE, // Он открыл в кабинете окна. На улице ветрено.
    0x13BFE, // Чистые белые занавески развеваются на лёгком ветерке, тяжело и медленно покачиваясь, словно волны. Свет вяло проникает сквозь них, наполовину поглощаясь тканью.
    0x13D26, // Я закрываю глаза. Бриз на лице – как мягкая ткань занавесок.
    0x13D94, // Я, затаив дыхание, прислушиваюсь к биению сердца, пытаясь игнорировать звук клавиш компьютера, на котором печатает фельдшер.
    0x13E79, // Сердце бьётся ровно.
    0x13E9F, // Блин, и недели не прошло, как я снова оказался в таком положении. На этот раз я сильно облажался. Надо было головой думать, а не изображать из себя недоделанную звезду спорта в присутствии настоящей.
    0x14008, // И с чего я так храбрился, изображая, что сердечное трепетание – ерунда, хотя на самом деле оно довольно опасно?
    0x140D2, // Это был просто рефлекс – отбросить мысли о болезни, удержать всё в себе.
    0x14156, // Я не хотел, чтобы это случилось.
    0x14190, // Не хотел, чтобы Эми это увидела.
    0x141CA, // А-а-а!..
    0x141D6, // Болванболванболван.
    0x141FC, // Мне нужно быть осторожнее, иначе снова окажусь в больнице, а то и чего похуже.
    0x14289, // После этой мысли я уступаю усталости.
    0x142CE, // Я уснул. Как долго я спал? Сколько сейчас времени?
    0x14328, // У меня немного кружится голова, и я никак не могу перестать моргать.
    0x143A4, // Отдёрнув занавеску, я щурюсь от льющегося из окна солнечного света. Занавески на ощупь совсем не такие, каким был ветер на лице.
    0x1448D, // Фельдшер, сидя на том же месте, что и раньше, отрывает глаза от работы.
    0x1450C, // Как самочувствие?
    0x1452D, // Не могу точно определиться, как я себя чувствую, поэтому ничего не отвечаю. Мне несколько не по себе из-за того, что уснул в такое необычное время. Надеюсь, я не выгляжу слишком странно.
    0x1467C, // Который час?
    0x14693, // Хриплым голосом задаю я вопрос, надеясь немного сориентироваться. Фельдшер, прежде чем ответить, бросает взгляд на наручные часы.
    0x14781, // Всё происходит будто в замедленной съёмке.
    0x147D0, // Пятнадцать минут одиннадцатого.
    0x1480C, // Я пытаюсь понять, что это значит, но не слишком успешно.
    0x14871, // Ты не ответил на мой вопрос, Хисао.
    0x148B0, // А. Хорошо.
    0x148C2, // Тогда слезай с кровати, посмотрим, как ты. И не…
    0x14919, // Я пытаюсь встать, но из-за резкого движения перед глазами всё плывёт и я чуть не падаю. Фельдшер подхватывает меня под руку и вздыхает.
    0x14A0E, // «…не вставай слишком быстро», – вот что я собирался сказать. Просто посиди, я измерю давление.
    0x14ABB, // Да уж, хотел как лучше, а получилось как всегда. Смутившись, я умолкаю, пока фельдшер возится с моей рукой и старомодным устройством. Через пару минут он убирает его с лицом, не выражающим ни удовлетворения, ни недовольства.
    0x14C51, // Ты в порядке. Голова перестала кружиться?
    0x14C9D, // Ага.
    0x14CA5, // Хорошо. А как внутри?
    0x14CCB, // Ты сегодня поступил неблагоразумно, Хисао.
    0x14D1A, // Я воздерживаюсь от резкого ответа, который так и хочется выпалить. У меня и у самого в голове такие мысли крутились, но, услышав их от кого-то другого, хочется что-нибудь возразить.
    0x14E61, // Не слишком приятно слушать то, что он говорит. Но от этого он не становится неправ.
    0x14EF7, // Неблагоразумно.
    0x14F15, // Он кивает со всё тем же нейтральным выражением лица.
    0x14F75, // Было бы легче злиться на него, если б он сказал что-нибудь вроде «а я ведь предупреждал», но он этого не делает.
    0x1503E, // Я могу стараться помочь тебе поддерживать здоровье, но без соответствующих шагов с твоей стороны это бесполезно. Надеюсь, сегодняшнее событие послужит тебе уроком.
    0x1516C, // Вот записка для учителя. Чтобы не было лишних вопросов.
    0x151D1, // Поскольку мне больше нечего сказать, да и не хочется, я беру протянутую им бумажку и поворачиваюсь к выходу.
    0x15296, // Не делай глупостей, ясно? В этот раз ты отделался лёгким испугом, но в следующий раз всё может обернуться иначе.
    0x15361, // Мне всё ясно.
    0x15379, // Существует какой-то способ добраться из административный корпуса в школу не выходя на улицу, но я не горю желанием искать его и, возможно, потеряться, так что отправляюсь тем путём, который точно знаю.
    0x154E7, // Я останавливаюсь на ступеньках, размышляя: сходить ли мне за учебниками в общежитие или отправиться сразу на урок.
    0x155B9, // Солнце ярко светит мне в глаза, и я направляюсь к общежитию.
    0x15626, // Я позволяю Эми бежать как ей нравится – и она беспощадна: мгновенно уходит вперёд на полкруга.
    0x156D3, // Я её не виню.
    0x156EA, // В смысле, я ведь тут ни с кем не соревнуюсь, да?
    0x1573E, // Наоборот, я просто бегу в ровном темпе, что я и должен делать, верно?
    0x157B9, // На данном этапе нет нужды пытаться выйти за пределы своих возможностей.
    0x1583D, // Боже, это хотя бы того стоит?
    0x15871, // Когда мы заканчиваем второй круг, я снова останавливаюсь.
    0x158DB, // Эми продолжает бежать, и мне кажется, что она разочарована.
    0x15947, // Ну, это глупо.
    0x15960, // Я не обязан ничего ей доказывать, а если уж на то пошло, то и себе я ничего доказывать не обязан.
    0x15A0D, // Мне и так хорошо.
    0x15A2C, // И я вовсе не бегун.
    0x15A4E, // Наверное, это было плохой идеей.
    0x15A89, // Может, вместо этого можно делать что-то другое?
    0x15ADF, // Всё равно так рано вставать не по мне. Должен быть какой-то другой способ поддерживать себя в форме.
    0x15B95, // Прогулки, например. Приятные дневные прогулки.
    0x15BEB, // Да, звучит отлично. Ну его, этот бег.
    0x15C2C, // Я машу Эми рукой и возвращаюсь обратно в свою комнату.
    0x15C8F, // Потом что-нибудь придумаю.
    0x15CC0, // Ничего.
    0x15CCE, // Я быстро встаю перед ними, чтобы загородить обзор. Сидзунэ с подозрительным видом отступает, но на её лице написана и обеспокоенность.
    0x15DC4, // Надеюсь, если я уклонюсь от темы, она поймёт, что я не хочу, чтобы она продолжала допытываться.
    0x15E6F, // Правда~? Что ты там прячешь, Хиттян~?
    0x15EB0, // Ну я же сказал, ничего.
    0x15ED9, // Вот как~?
    0x15EE9, // Похоже, я не смогу выкрутиться. Они по природе своей любопытные, и если я буду продолжать что-либо скрывать, то это только распалит их интерес.
    0x15FEC, // Ну ладно, это {b}кое-что{/b}, но я не хочу об этом говорить, ладно? Пока… не хочу.
    0x16077, // Можем мы отложить это на потом?
    0x160B0, // Пока Миша переводит, Сидзунэ смотрит на меня поверх очков тяжёлым и, как всегда, пристальным взглядом.
    0x1616B, // Она задумчиво складывает пальцы, будто взвешивая целесообразность оказания дальнейшего давления на меня и оскорбительность пренебрежения моей просьбой.
    0x16288, // В конце концов она слабо улыбается и начинает что-то жестикулировать Мише.
    0x16311, // Хорошо~! Тогда мы будем ждать. Сдружимся крепче, и однажды, когда ты сам захочешь, сможешь нам об этом рассказать~!
    0x163DF, // Они обе мне широко улыбаются, а я чувствую себя потрясённо и немного глупо из-за того, что так себя повёл.
    0x1649E, // Они не глупы и уже, возможно, на пути к разгадке моих проблем со здоровьем. И…
    0x1652B, // Такие простые и добрые слова. Я чувствую облегчение, что они не стали обо мне худшего мнения, несмотря на то что я вот такой. Даже если я не похожу на остальных здесь. Несмотря на то что я так напрягаюсь по этому поводу.
    0x166B6, // Похоже, что за завесой надоедливых, озорных девушек скрываются очень добрые и хорошие люди. Я так думаю.
    0x16774, // Спасибо.
    0x16784, // Значит, хотите, чтобы я вам сегодня помог? Потому что я теперь один из вас?
    0x1680A, // Угу~!
    0x16813, // После уроков?
    0x1682C, // Нет-нет-нет~! Сейчас!
    0x16851, // Сейчас? А как же уроки? Собираетесь опять пропустить?
    0x168B2, // Ха-ха-ха~! Это же для общего блага, поэтому мы приносим в жертву математику и, возможно, обществознание~!
    0x1696E, // Я не против.
    0x16984, // Прекрасно, Хиттян~! Запомни, ты сказал, что не против помочь, и запомни хорошенько.
    0x16A19, // Этот тон… Я уже сожалею, что ляпнул это.
    0x16A62, // Отлично~! Значит, ты готов идти? Мы можем пойти вместе~!
    0x16AC5, // Нет. Вы, наверное, меня заставите нести все ваши вещи или что-нибудь в этом роде.
    0x16B56, // Не глупи, Хиттян.
    0x16B75, // Мы никогда не ходили в школу вместе, Хиттян~.
    0x16BC6, // Я собираюсь спросить, зачем нам это делать, но тут до меня доходит: они считают меня своим другом, как Миша ранее и сказала. И они хотят стать со мной ещё более близкими друзьями.
    0x16D08, // Странно, я никогда не думал о них в таком ключе. Или о ком-либо ещё, встреченном за последнюю неделю. Это действительно так просто?
    0x16DF4, // Настолько легко…
    0x16E15, // Ладно, тогда идём.
    0x16E36, // Сидзунэ хитро улыбается и убирает руки за спину.
    0x16E8F, // Ха-ха-ха~! Это здорово, Хиттян~! Ладно, ладно, но сначала~! Ты подал отличную идею, Ситтян она очень понравилась… Так что~! время сыграть в игру!
    0x16F8F, // О нет.
    0x16F9A, // У Ситтян в одной руке купюра в тысячу иен, Хиттян~! Если угадаешь в какой, то заберёшь себе! А если нет…
    0x17054, // То понесёшь все наши книжки до школы~! Верно, Ситтян~? Верно~!
    0x170C1, // Они с Сидзунэ обмениваются кивками.
    0x17103, // Ладно, Хиттян~! Приготовься~!
    0x17137, // Таща три портфеля вместо одного, я размышляю о том, что за день ждёт меня. Ждёт нас.
    0x171CD, // Я вижу суетящихся на школьном дворе учеников, возможно занятых подготовкой своих проектов.
    0x17275, // Фестиваль уже на носу. Это значит, что могут быть только две причины, по которым им может понадобиться моя помощь.
    0x17344, // Либо осталось совсем немного работы и им просто нужна помощь, чтобы закончить стандартные проверки, которые они обязаны провести.
    0x17433, // Либо осталась гора работы и Сидзунэ не показывает вида, в то время как лавина нагромождавшейся отложенной работы угрожает всех нас смести.
    0x17532, // Да уж, на этот раз они переступили черту. Пронырливые надоеды.
    0x175A3, // Правда~, Хиттян? А по мне, так не похоже, что «ничего».
    0x17603, // Такой длинный ряд бутылок, правда~? Правда~! Что это такое, Хиттян?
    0x1767A, // Просто кое-какие вещи.
    0x176A3, // Похоже, что это больше, чем «просто кое-какие вещи»…
    0x17703, // Я не могу винить их за такое поведение. Миша просто говорит за Сидзунэ, а Сидзунэ просто по природе своей любопытна. И всё же я предпочёл бы, чтобы они перестали уже копать под меня и поняли намёк. Но Миша его не улавливает, а Сидзунэ – не слышит.
    0x178BF, // Поэтому они продолжают напирать.
    0x178FC, // Это вас совершенно не касается.
    0x17936, // Вам разве не пора идти? Моя комната – моё личное пространство, знаете ли.
    0x179BB, // Сидзунэ, похоже, воспринимает это как вызов.
    0x17A0C, // Что это значит, Хиттян? Когда кто-то видит что-то интересное, первое желание – спросить, что это, это ведь очевидно. Что в этом плохого?
    0x17B00, // Я ведь уже сказал, здесь не на что смотреть.
    0x17B4F, // Хиттян, я думаю, Ситтян просто беспокоится.
    0x17B9E, // То, что находится в моей комнате, – абсолютно не ваше дело, вот и всё.
    0x17C1B, // Но…
    0x17C23, // Чёрт возьми! Иногда мне хочется, чтоб вы просто перестали дурачиться. Это не всегда весело, вам это известно?
    0x17CE9, // Я говорю это намного более резко, чем хотел, почти крича Мише прямо в лицо. Она вздрагивает и останавливается на полужесте, и даже Сидзунэ реагирует на это, хоть и не слышит меня.
    0x17E2C, // Полагаю, моё злобное лицо говорит само за себя.
    0x17E82, // После того как Миша медленно заканчивает перевод, девушки с сожалением смотрят друг на друга.
    0x17F2E, // Ладно, Хиттян, мы оставим тебя в покое.
    0x17F74, // Впервые я слышу, как Миша говорит без своей привычной скачущей интонации. Это так странно, что у меня возникает желание извиниться, но они уже повернулись к выходу.
    0x1809F, // Когда наступает тишина, я начинаю всё больше и больше жалеть о своих словах.
    0x1812A, // Девушки молча уходят, и, постояв в своей комнате ещё немного, я одеваюсь и отправляюсь вслед за ними.
    0x181E1, // Чёрт возьми. Она совершенно не знает, когда остановиться.
    0x1824A, // Ладно, ладно. Расскажу. Я прекрасно провёл время.
    0x182A3, // Поутру у меня случился сердечный приступ и я несколько часов тусовался с фельдшером.
    0x1833F, // Надо сказать, лучшее утро в моей жизни.
    0x18386, // Грубо говорю я, пытаясь сымитировать её скачущую интонацию, только шёпотом, чтобы никто другой не услышал. Мои слова довольно резкие.
    0x1847A, // Что-что с тобой случилось? Хиттян, ты серьёзно?
    0x184CF, // Перестань. Всё-то ты прекрасно слышала.
    0x18517, // Но, Хиттян, это серьёзно!
    0x18544, // Нет, правда. Отвяжись. Мы, кстати, на уроке.
    0x18591, // Но, Хиттян!..
    0x185A7, // Миша, кажется, обеспокоена, возможно даже в панике. Интересно, осознаёт ли она, что быть такой назойливой – не лучшая идея?
    0x18686, // Прежде чем ответить, я даю ей повариться немного в собственном соку. Сидзунэ этого не передать, но мне это безразлично.
    0x1875F, // Отвали, Миша.
    0x18777, // И Сидзунэ скажи то же самое.
    0x187AA, // Я тут же жалею о том, что только что сказал. Но, как говорится, слово не воробей…
    0x1883B, // Как ни странно, Миша действительно затыкается, хоть я и не проверяю, передала она моё послание Сидзунэ или нет. Это и неважно.
    0x1891F, // Муто завершает урок какой-то общей речью о том, что фестиваль уже через два дня.
    0x189B0, // Я не скажу, смирись.
    0x189D4, // На мгновение она задумывается.
    0x18A0D, // Это жестоко, Хиттян~!
    0x18A33, // По её расстроенному и подавленному голосу я понимаю, что она дуется.
    0x18AB0, // Она снова отступает на некоторое время, чтобы посовещаться с мозговитой половиной их энергичного дуэта, после чего возвращается.
    0x18B9E, // Думаю, надо вместе перекусить и побеседовать на эту тему… говорит Ситтян.
    0x18C26, // За наш счёт.
    0x18C3C, // Кроме того, тебе нужно возместить утреннее отсутствие и нам нужна помощь в работе~!
    0x18CD4, // Остальные ученики начинают поглядывать на нас, возможно из-за того, что Миша так сильно перегнулась через парту, что почти касается моей головы своей. Её кудрявые волосы щекочут мне шею.
    0x18E28, // Они пахнут шампунем и ещё чем-то, чем она, похоже, пользовалась, чтобы завить их.
    0x18EB9, // Сидящая впереди девушка, кажется, пытается подслушивать. Надеюсь, окружающие не поймут нас неправильно, хотя я не представляю, как можно эту ситуацию понять правильно.
    0x18FEC, // К счастью, Муто не обращает на нас внимания или нарочно игнорирует Мишу. Пока что.
    0x19081, // Мне никак не выкрутиться, не так ли?
    0x190C2, // Извини, я не могу. Я уже кое-кому обещал перекусить вместе.
    0x1912C, // А? Кому? Это девушка~?
    0x19152, // Да…
    0x1915A, // Её смешок вынуждает меня быстро что-то добавить, чтобы она не поняла меня превратно.
    0x191F4, // Это не то, что ты думаешь! Ситуация… немного запутанная.
    0x1925B, // Запутанная… да, такая у меня жизнь, несмотря на то что я уже влился в повседневную школьную рутину.
    0x19310, // Теперь всё предстаёт в свете этой второй жизни, пересматривается с точки зрения нового меня.
    0x193BA, // Меня со сломанным сердцем.
    0x193EB, // И ещё, я не знаю, смогу ли приходить в Совет.
    0x1943A, // По крайней мере, пока. Просто есть на чём сконцентрироваться в первую очередь.
    0x194C9, // Именно. Нужно заново расставить приоритеты. Вот что крутилось у меня в голове после разговора с фельдшером. Я не могу позволить себе притворяться, что абсолютно здоров.
    0x195FD, // Я удивлён, что могу так отрешённо анализировать свою жизнь, однако пока пусть всё идёт своим чередом.
    0x196B6, // Обещаю, я потом нормально объясню, но не сейчас, ладно? Пожалуйста, скажи Сидзунэ, что мне жаль, что я её подвёл.
    0x1977F, // Как скажешь, Хиттян.
    0x197A4, // Голос у неё удивлённый и серьёзный, такого я никогда раньше не слышал.
    0x19824, // К счастью, Миша понимает, что я говорю на полном серьёзе, и мне очень повезло, что я смог выразить свои мысли так чётко, что даже она меня поняла. Она отворачивается, чтобы перевести мои слова Сидзунэ.
    0x1998E, // Ни одна из них после этого не произносит ни слова в мой адрес.
    0x199FE, // Хорошо, я пойду с вами, только отстаньте от меня до конца урока, ладно?
    0x19A7D, // Договорились, Хиттян~!
    0x19AA6, // По дороге в кабинет Совета я вижу суетящихся на школьном дворе учеников, возможно занятых подготовкой своих проектов.
    0x19B7F, // Всё в порядке, надо только перевести дух. Последнее время я не в лучшей форме.
    0x19C0C, // Это что-то… связанное с твоим переводом сюда? То есть…
    0x19C71, // Она довольно резко себя обрывает, возможно поняв, что проявила назойливость. Но у неё чуткая интуиция, и, хоть я и не люблю говорить на эту тему, врать вовсе ни к чему.
    0x19D9E, // Думаю, я не против, если об этом спрашивает Лилли.
    0x19DF8, // Просто я в последнее время немного ослабел.
    0x19E48, // Ханако сказала, что ты выглядишь довольно… здоровым, так что я подумала…
    0x19ECF, // Лилли снова прерывает себя на середине предложения, с долей беспокойства оставляя эту тему.
    0x19F78, // Её нахмуренный лоб заставляет меня сказать ещё что-то, чтобы её успокоить.
    0x1A000, // Удивительно, что она так деликатна, учитывая её прямое и открытое отношение к собственной слепоте. Она, видимо, понимает, что не всем комфортно говорить о таких вещах.
    0x1A130, // Нет, всё в порядке.
    0x1A152, // У меня… думаю, лучше всего сказать, что сердце моё… барахлит. Аритмия.
    0x1A1D3, // Не так давно у меня случился сердечный приступ, и я провёл большую часть весны в больнице. Угодил в «Ямаку» по распоряжению врача.
    0x1A2C0, // Она молча кивает.
    0x1A2E0, // Однако мой ответ заставляет Лилли нахмурить лоб ещё сильнее. Похоже, она не знает, как реагировать, учитывая, что мы не так уж близко знакомы.
    0x1A3E1, // Я не могу её за это винить, у меня у самого такая же реакция.
    0x1A44D, // Хоть мне и хочется унять её беспокойство, говорить об этом желания тоже нет.
    0x1A4D8, // Не беспокойся об этом.
    0x1A501, // Я пытаюсь обнадёживающе улыбнуться, но осознаю бесполезность этого действия. Не зная об этом, Лилли успокаивающе улыбается мне и ничего больше не произносит.
    0x1A623, // Когда мы подходим к общежитиям, Рин останавливается перед своей фреской как громом поражённая. Она была так тиха на протяжении всей обратной дороги, что я почти забыл о её присутствии.
    0x1A774, // Сегодня ведь пятница, да?
    0x1A7A2, // Да… пятница, восьмое июня.
    0x1A7D3, // Плохо дело.
    0x1A7E8, // Плохо? Почему?
    0x1A802, // Кажется, я сейчас приму позу зародыша и проблююсь. Возможно, в обратном порядке.
    0x1A894, // Что-то случилось?
    0x1A8B4, // Нет. Ничего не случилось. Сегодня пятница, и пока ничего не случилось. Фреска, её надо закончить к воскресенью. Значит, всё в порядке.
    0x1A9A5, // У вас есть наркотики? Или машина времени?
    0x1A9F0, // Это нехорошо. Нехорошо.
    0x1AA1B, // Значит, она отстаёт от графика. Вспомнив недовольство Сидзунэ беззаботным отношением Рин к проекту несколько дней назад, я не знаю, что и думать.
    0x1AB24, // Она напросится на «тебе же говорили», если не справится со всем к воскресному утру.
    0x1ABBC, // Рин продолжает смотреть на свою фреску с невероятно подавленным видом.
    0x1AC3F, // Оставьте меня. Мне нужно немного поработать.
    0x1AC91, // Я смотрю на Лилли, ожидая, что она обменяется со мной скептическими взглядами и я закачу глаза, но потом осознаю, что она этого не сделает.
    0x1AD8C, // Оставьте меня.
    0x1ADA7, // Мы, конечно, так и делаем, чтобы не раздражать её ещё сильнее.
    0x1AE16, // В животе у меня начинает шевелиться нехорошее чувство. У Рин определённо талант заставлять людей волноваться о ней.
    0x1AEEB, // Она похожа на человека, которого нельзя оставлять одного.
    0x1AF55, // Может, нам следует кого-нибудь позвать? Голос у неё был такой, будто она вот-вот впадёт в истерику или вроде того.
    0x1B022, // Уверена, с ней всё будет в порядке. Просто она… э… как бы сказать…
    0x1B09C, // Лилли немного запрокидывает голову, пытаясь придумать вежливый способ назвать Рин сумасшедшей, не называя её сумасшедшей.
    0x1B17E, // Своеобразная?
    0x1B198, // Да, весьма своеобразная личность.
    0x1B1D6, // Наверное, можно и так сказать.
    0x1B20D, // Она мелодично хихикает, кивая в знак согласия.
    0x1B262, // Извини, что не поддержала твою беседу с ней. Я… не совсем её понимаю, поэтому держусь подальше.
    0x1B30F, // Значит, я был прав. Лилли чуть виновато улыбается, будто бы сожалея о том, что её несовершенство не позволило ей сблизиться с Рин.
    0x1B3FA, // Я не могу её винить. Совсем.
    0x1B42C, // Лилли глубоко вздыхает, возможно скрывая таким образом зевок. Наверняка она так же измотана, как и я.
    0x1B4E4, // Я, наверное, пойду, отдам продукты Ханако. Спасибо за компанию, Хисао.
    0x1B562, // Она очаровательно улыбается мне. Как-то иначе, чем обычно, несмотря на то, что улыбается она часто.
    0x1B615, // Не могу точно понять, в чём именно заключается разница. Просто по-другому.
    0x1B69C, // Я бы сказал, расслабленно, но, возможно, это просто облегчение, оттого что удалось избавиться от Рин. Наверное.
    0x1B765, // Угу… спокойной ночи. Передавай привет Ханако.
    0x1B7BA, // Передам. Спокойной ночи.
    0x1B7E7, // Я… я в порядке.
    0x1B803, // Беспокоиться не о чем, просто холм слишком крутой, вам так не кажется?
    0x1B882, // И вообще, мне непонятно, зачем строить школу так высоко? У нас ведь учатся инвалиды-колясочники и прочие.
    0x1B941, // Да, действительно.
    0x1B963, // Лилли беспокойно хмурит лоб, но мне бы не хотелось, чтобы у неё из-за меня появлялось такое выражение лица. Мы друг друга едва знаем.
    0x1BA53, // Вот-вот, я о том же! Не то чтобы, конечно, таких мест было много, но всё равно неясно, о чём они думали.
    0x1BB08, // Мой голос звучит чересчур спокойно, даже мне его слышать странно, к тому же я тараторю. Меня посещает мысль о том, что Лилли, наверное, многое может понять по одному только голосу.
    0x1BC4D, // М-м-м…
    0x1BC59, // Пойдём, мы уже почти пришли.
    0x1BC8C, // Остаток пути до школы проходит в молчании.
    0x1BCDA, // Поднажать.
    0x1BCEE, // Не переусердствовать.
    0x1BD17, // Попытаться уйти от темы.
    0x1BD44, // Выгнать их из комнаты.
    0x1BD6D, // Как член Школьного совета, ты обязан нам рассказать, почему пропускаешь уроки! Особенно если это что-нибудь очень-очень весёлое~!
    0x1BE59, // Да, я очень-очень повеселился в медкабинете.
    0x1BEAA, // Я не хочу об этом говорить, ясно?
    0x1BEE5, // Прости, просто я не в лучшей форме.
    0x1BF24, // Мне не очень хочется об этом говорить.
    0x1BF6A, // Я пойду на ланч с Эми и её подругой.
    0x1BFAA, // Пойду с Сидзунэ, я ведь, в конце концов, теперь в Совете.
    0x1C00F, // Я просыпаюсь и принимаю горячий душ.
    0x1C052, // Как хочешь, чувак.
    0x1C073, // Он поспешно скрывается в своём логове, наконец-то позволив мне пойти на урок.
    0x1C100, // В коридорах так же тихо, как и во дворе, – естественно, все ведь на уроках. Я легонько стучу в дверь класса 3-3 и, когда Муто отзывается, открываю её.
    0x1C209, // Извините за опоздание.
    0x1C233, // Ко мне поворачиваются пятнадцать пар глаз.
    0x1C282, // Доброе утро, Накай.
    0x1C2A5, // Муто, кажется, немного сбит с толку моим поздним приходом, будто я прервал ход его мыслей.
    0x1C348, // Судя по тому, какими бессистемными бывают его лекции, дело, скорее всего, именно в этом.
    0x1C3E7, // Я протягиваю ему записку от фельдшера. Муто кивает, берёт её и пробегает по ней глазами.
    0x1C487, // Он поднимает брови и окидывает меня строгим взглядом, но ничего не говорит, а только снова важно кивает.
    0x1C545, // Я пожимаю плечами, и он жестом указывает мне садиться, что я, естественно, и делаю.
    0x1C5DA, // Вопреки обычаю, я прихожу на утренний урок далеко не одним из первых.
    0x1C658, // Напротив, почти все, кажется, уже здесь. Большинство одноклассников я уже знаю в лицо, хотя их имена всё ещё ускользают из памяти.
    0x1C743, // Работой оказывается сортировка и перепроверка внушительного количества бумаг, необходимых для проведения школьного фестиваля.
    0x1C830, // Мозг сломаешь со всей этой бюрократией.
    0x1C879, // Но мы успеваем всё закончить как раз к большой перемене.
    0x1C8E0, // Отлично~, теперь можно и немного отдохнуть! Но не очень долго, после полудня нас ждёт ещё больше работы~!
    0x1C99D, // У неё такое забавное выражение лица, что я с трудом сдерживаю смех.
    0x1CA17, // Эми хихикает то ли над собой, то ли над чем-то ещё, то ли и вовсе без причины. Мне нравится её смех.
    0x1CAC7, // Жизнерадостный, бойкий характер Эми помогает отвлечься от засевшей в подсознании ссоры с Сидзунэ и Мишей.
    0x1CB8A, // Я выбрасываю из головы мысли об этом и позволяю себе впервые за сегодняшний день улыбнуться.
    0x1CC34, // В обычный день я присоединился бы к этому потоку и сам взял бы себе ланч, но сегодня всё иначе.
    0x1CCDF, // Сегодня я приглашён на ланч на крыше.
    0x1CD23, // Странное место, но мне сказали пойти именно туда.
    0x1CD7D, // К счастью, мне удаётся найти укрытие от бури возле приоткрытой двери в класс.
    0x1CE0A, // Наконец поток редеет и я осторожно выхожу в коридор.
    0x1CE6A, // И тотчас встречаю Эми, несущуюся по коридору, словно пушечное ядро.
    0x1CEE5, // Эй! Привет, Хисао! Как удачно мы повстречались!
    0x1CF3A, // У меня сегодня с собой суперский дополнительный ланч, как я и обещала! Пойдём наверх!
    0x1CFD5, // Только сегодня я собираюсь предложить тебе супер-эксклюзивный ланч!
    0x1D053, // Ланч от Эми и привилегия насладиться им в приватной обстановке в компании двух сногсшибательных красоток!
    0x1D117, // Её игривое приглашение эхом раскатывается по коридору, даже несмотря на то, что он полон народу.
    0x1D1C7, // Эми принимает уверенную позу и, будто пытаясь обыграть свой забавный внешний вид, выпячивает довольно скромную грудь, показывая пальцами знак победы – «V».
    0x1D2E5, // Звучит заманчиво. Чему обязан чести быть приглашённым?
    0x1D34A, // Ты стоял здесь с таким одиноким и печальным видом, что я подумала, что компания тебе не помешает.
    0x1D3FA, // Самая удручающая из причин, которую только можно представить.
    0x1D46C, // Ну так как? Ты, наверное, действительно одинок и иначе всё равно пойдёшь в столовую есть эту жуткую еду в полном одиночестве.
    0x1D54F, // Э-э-э…
    0x1D55B, // Я шучу, шучу!
    0x1D572, // Конечно, я приму твоё предложение. С удовольствием.
    0x1D5D0, // Пойдём на крышу!
    0x1D5EE, // На крышу?
    0x1D5FF, // Почему на крышу?
    0x1D61D, // Потому что там мы едим!
    0x1D647, // И если я туда не поднимусь, то она, вероятно, уйдёт и, я уверена, останется голодной, потому что никогда не приносит еду с собой!
    0x1D72D, // Ты о ком?
    0x1D73D, // Пойдём!
    0x1D74B, // Так и не ответив на мой вопрос и не дождавшись ответа от меня, она хватает меня за руку и тащит по коридорам.
    0x1D80F, // По дороге я пытаюсь завести разговор.
    0x1D854, // Откуда у тебя лишний ланч?
    0x1D884, // Эми виновато улыбается.
    0x1D8B0, // На самом деле это вчерашний.
    0x1D8E4, // На перемене я пошла бегать и забыла его съесть.
    0x1D93A, // Вот оно как.
    0x1D950, // Чувствуя себя в крайней степени измотанным, я направляюсь в свою комнату, чтобы почитать взятые книги. Для одного дня событий и волнений мне уже достаточно.
    0x1DA6E, // Первой я достаю «Алису в Стране Чудес». Я, конечно же, знаю эту историю, но не читал саму книгу.
    0x1DB19, // Она оказывается такой же психоделической, как и история, насколько я её помню: с чокнутыми персонажами и абсурдным сюжетом.
    0x1DBFB, // Я и себя представляю в виде своего рода Алисы, беспомощно падающей через кроличью нору в эту Страну Калек.
    0x1DCBD, // …Нет, это я, конечно, загнул. Но всё равно, уединённое местоположение и то, как умело все в школе приспосабливаются абсолютно ко всему, поражает воображение. Здесь словно совсем иной мир.
    0x1DE11, // Непонятно, почему же меня никак не покидает ощущение того, что я здесь чужой, как и Алиса, несмотря на то, что большинство окружающих приветливы и дружелюбны со мной?
    0x1DF3E, // Когда я переворачиваю ещё одну страницу, мысли начинают уплывать от сюжета книги всё дальше. В комнате так тихо, что я слышу, как бьётся моё сердце под рубашкой.
    0x1E062, // Мне от этого почему-то становится очень плохо, как в тот раз, когда я был с Иванако в лесу. Как будто я заперт в одной клетке с чем-то мерзким и страшным.
    0x1E174, // Я откладываю книгу и принимаюсь смотреть в потолок, ожидая, когда это чувство пройдёт.
    0x1E212, // Двумястами страницами спустя я засыпаю.
    0x1E25C, // К моему удивлению, её лицо вдруг озаряет понимание.
    0x1E2BA, // Постой… так, значит, в тот раз, когда вы с Эми столкнулись в коридоре?..
    0x1E33A, // Я криво усмехаюсь. Не думал, что она способна настолько быстро складывать детали в общую картину.
    0x1E3EC, // Да. Наверное, я прямо-таки ходячая книжная иллюстрация к тому, зачем существуют правила насчёт бега по коридорам.
    0x1E4BB, // Мои слова звучат куда холоднее, чем я рассчитывал. Из-за них у Лилли явно пропадает желание развивать тему.
};

#endif // KS_SCRIPT_A1_FRIDAY_RU_TL_INDEX