#ifndef KS_SCRIPT_A1_THURSDAY_RU_TL_INDEX
#define KS_SCRIPT_A1_THURSDAY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int script_a1_thursday_ru_intl[] = {
    0x0000, // Назойливый звонок будильника вырывает меня из объятий сладкого утреннего сна.
    0x0091, // Я лежу, пытаясь найти в себе силы выбраться из-под одеяла и выдумывая оправдания, почему же я всё ещё этого не сделал.
    0x0166, // Я бы не прочь проваляться так весь день. После полугода в больнице школьные будни сильно выматывают, да и освоиться в столь необычном месте чрезвычайно трудно.
    0x028A, // Но, хоть и кажется, что пропустить пару уроков тут проще простого, начинать новую школьную жизнь с прогулов не самая лучшая идея.
    0x0375, // И фельдшер снова станет докучать нотациями о необходимости зарядки.
    0x03F3, // С этой мыслью я наконец поднимаюсь с кровати и, проглотив утреннюю горсть таблеток, принимаюсь натягивать свой старый спортивный костюм.
    0x04EF, // Я сейчас освобождён от физкультуры по состоянию здоровья, так что новую форму брать не стал.
    0x0598, // Ничто не мешает попросить её выдать, но одежда, в которой я раньше пинал мячик с друзьями, навевает приятные воспоминания.
    0x0677, // Играть в футбол я в ней уже не смогу, но, может, так она получит второй шанс. Почти как я.
    0x0715, // Удивительно, что даже в такую рань на стадионе кто-то есть.
    0x0780, // Более того – знакомое лицо.
    0x07B3, // Девочка с ногами-протезами, которая вчера налетела на меня в коридоре. Она бежит по дорожке с необычной грацией механической газели.
    0x08A6, // У неё ещё какое-то короткое имя… Не могу вспомнить.
    0x0904, // Она бежит слегка вприпрыжку, а металлические протезы ритмично звякают о землю.
    0x0995, // И что она тут забыла в такую рань? Неужели фельдшер и эту бедняжку заставил носиться тут с самого утра?
    0x0A50, // Если б не его настырность, ну и не моё здоровье, конечно ноги бы моей здесь не было.
    0x0AE6, // Я пришёл сюда пораньше, только чтобы побыстрее разделаться с новой обязанностью.
    0x0B7B, // Было бы лучше, если бы никто не увидел мои жалкие потуги.
    0x0BE2, // Я бы ушёл, но на очередном повороте она, кажется, замечает меня.
    0x0C55, // Не сбавляя темпа, она бежит в мою сторону, радостно махая ручкой.
    0x0CCB, // Доброе утро! Ты ведь Хисао, да?
    0x0D02, // Она улыбается, видимо довольная тем, что запомнила моё имя.
    0x0D6E, // Ты меня, наверное, не помнишь?
    0x0DA4, // Эми! Мы столкнулись вчера в коридоре.
    0x0DE8, // Как я мог забыть столь, э… резкое знакомство?
    0x0E3B, // Эми виновато смотрит на меня исподлобья, но лишь для виду, и, не сдержавшись, начинает хихикать.
    0x0EE9, // Угу, извини за тот случай. Ещё раз.
    0x0F27, // Ничего страшного, лишь бы такое приветствие не вошло у тебя в привычку.
    0x0FA9, // Вот и здорово!
    0x0FC3, // Не уверен, что она поняла мою шутку.
    0x1004, // Значит, «шпион», о котором говорил фельдшер, – это ты?
    0x1066, // Верно!
    0x1072, // О…
    0x1078, // Честно говоря, я ожидал, что это будет кто-то из медперсонала.
    0x10E8, // Хочешь сказать, я не подхожу на роль шпиона?
    0x1138, // Нет, просто я рад, что это именно ты. Я боялся, что он отправит кого-нибудь следить за каждым моим шагом.
    0x11F3, // Ты ведь здесь не за этим?
    0x1220, // Не-а, я тут сама по себе. Фельдшер просто спрашивал, не встречала ли я на стадионе «взъерошенного парня, шатающегося всюду с потерянным видом».
    0x1324, // Так что же тебя сюда привело?
    0x1359, // Эми принимает театральную позу.
    0x1394, // Тренировка!
    0x13AA, // Какая?
    0x13B6, // Бег!
    0x13BE, // А… То есть ты состоишь в кружке лёгкой атлетики?
    0x1417, // Эми энергично кивает.
    0x143F, // Угу! Я самая лучшая бегунья!
    0x1472, // Да ещё и самая скромная.
    0x149E, // Эй, а ты не хочешь вступить?
    0x14D0, // Бег – лучшая зарядка!
    0x14F8, // Думаю, о таких подвижных упражнениях не может быть и речи.
    0x1562, // Боюсь, я не настолько люблю бегать.
    0x15A2, // Да и соревнования – это не по мне, знаешь ли.
    0x15F3, // Это правда, футболом я всё же не особо увлекался.
    0x164C, // Я и на поле-то выходил только потому, что там были мои друзья.
    0x16BB, // Уж точно не ради успехов на этом поприще.
    0x1706, // Эми понимающе кивает.
    0x172E, // Ясно, понятно. Не любишь, значит, соревнования и всё такое.
    0x1798, // Но, раз ты всё равно здесь, побегаем вместе?
    0x17E7, // Э… Конечно, давай.
    0x1809, // Эми, кажется, довольна.
    0x1833, // Разомнёшься сперва?
    0x1858, // Настоящим мужчинам разминка не нужна.
    0x189E, // Глупый! Всегда нужно начинать с разминки!
    0x18EA, // Сердито отчитывает она меня, но затем улыбается и наклоняется поближе.
    0x196C, // Я тоже ненавижу разминку.
    0x199B, // После чего ни с того ни с сего она заливается смехом.
    0x19FB, // Чёрт, да мне ведь при этом даже растяжку ног делать не приходится!
    0x1A73, // Она пару раз подпрыгивает на протезах, которые оказываются упругими, словно пружины.
    0x1B0F, // Побежали!
    0x1B21, // Итак, мы пускаемся бежать, и я тут же понимаю, что она вовсе не хвастала насчёт своих успехов.
    0x1BCA, // Эми двигается уверенно и сосредоточенно, всецело отдаваясь бегу.
    0x1C42, // В то время как я стараюсь всё внимание уделять технике.
    0x1CA7, // Больше чем на пару кругов меня сегодня не хватает, и я довольно скоро перехожу на шаг.
    0x1D43, // Эми замечает, что я остановился, лишь обогнав меня на целый круг.
    0x1DB9, // Она встаёт возле меня. Её плечи двигаются равномерно и ритмично, я же едва дышу.
    0x1E4A, // Ты уже всё?
    0x1E5E, // Я наклоняюсь, схватившись за колени.
    0x1EA1, // Уф… Да.
    0x1EAF, // Я сейчас не в лучшей форме.
    0x1EE0, // Эми кивает и задорно улыбается.
    0x1F1A, // Она вообще часто улыбается.
    0x1F4D, // Главное – начать, правда же?
    0x1F81, // Завтра постараешься пробежать чуть больше, а послезавтра – ещё больше, а потом ещё и ещё, и всё будет здорово!
    0x2049, // Буду иметь в виду.
    0x206A, // А сейчас я, пожалуй, пойду готовиться к урокам.
    0x20BF, // Кстати, разве тебе не надо?
    0x20F0, // Эми беспечно пожимает плечами.
    0x2129, // Так времени ещё полно.
    0x2152, // Я отмечаю про себя, что при ней нет часов.
    0x219D, // Ты уверена?
    0x21B2, // Она снова беззаботно пожимает плечами.
    0x21FA, // Не совсем, но… Мне ведь надо пробежать хотя бы столько же, сколько обычно.
    0x2281, // До встречи, Хисао!
    0x22A2, // Угу, увидимся.
    0x22BC, // Я отправляюсь в общежитие, чтобы помыться и сменить одежду.
    0x2329, // Меня одолевает соблазн принять по-настоящему долгий горячий душ – эта беготня всерьёз меня утомила, – но мне хочется попасть в класс до того, как в коридорах начнётся утренняя суматоха.
    0x247E, // …И всё же в итоге торчу в душе дольше, чем собирался. Вытершись полотенцем, я выхожу из душевой кабинки.
    0x253B, // Сквозь густую пелену пара ко мне приближается знакомый силуэт, пробуждая во мне наихудшие предчувствия.
    0x25FB, // Как оно?
    0x260A, // Эй, хватит меня так пугать! Что ты тут забыл?
    0x265A, // Это я у тебя должен спросить. Чувак, я тебя повсюду искал.
    0x26C2, // Где это – «повсюду»?
    0x26E8, // Я решаю не уточнять, не искал ли он меня прямо так, в чём мать родила.
    0x2764, // Вспомнив, что я всё ещё не одет, я поспешно прикрываюсь рубашкой, но Кендзи, кажется, всё равно ничего не видит.
    0x282D, // Его очки напрочь запотели. Но почему он их не протирает? Неужели у него настолько плохое зрение, что буквально всё видится как в плотном тумане?
    0x2933, // Ну, знаешь, в твоей комнате… и, в общем-то, всё. Но ради этого мне, как видишь, пришлось встать с постели. Ладно, ближе к делу. Одолжишь мне немного денег?
    0x2A45, // Он рассеянно водит взглядом по сторонам, стараясь выглядеть как можно более буднично. Но это бесполезно, потому что его намерения столь же прозрачны, как и его огромные очки.
    0x2B83, // Мне довольно неловко оттого, что я веду беседу как ни в чём не бывало, стоя перед ним нагишом.
    0x2C2C, // И ещё больше смущает то, что он этого не видит. Да к тому же он и сам без одежды.
    0x2CBA, // Я пытаюсь отогнать это неловкое чувство, но безуспешно.
    0x2D20, // Денег? Запросто.
    0x2D3E, // Супер.
    0x2D4A, // Постой-ка, а зачем они тебе?
    0x2D7C, // Э…
    0x2D82, // Можешь одолжить их мне просто потому, что я был так любезен и не стал шарить по твоим карманам, пока ты был в душе? Я мог, но проявил выдержку. Поэтому мои помыслы, как видишь, чисты. Так что будь другом.
    0x2EED, // Помыслы человека, который с трудом сдерживает в себе желание обшарить чужие карманы, вряд ли можно назвать чистыми. Да и скрытность Кендзи напрочь отбивает желание помогать ему. Прямо так я ему и говорю.
    0x3060, // Ты меня серьёзно обидел, чувак, но, думаю, мне придётся принять твои правила. Я хочу заказать пиццу, и у меня набралась почти вся сумма. Теперь мне нужна твоя финансовая поддержка.
    0x31A5, // Ты ведь поделишься, правда?
    0x31D7, // Нет.
    0x31DF, // Ты серьёзно?
    0x31F6, // Ага. Я бы поделился, но у тебя уроки и нет времени на пиццу.
    0x3260, // А у тебя?!
    0x3271, // А я не пойду. Мне надо дождаться пиццу и заплатить курьеру. А потом съесть её. Это непросто. Нужно забирать пиццу украдкой, иначе все тебя увидят. Тебя и пиццу. И каждый попросит поделиться.
    0x33C7, // Там, снаружи, жестокий мир, в котором каждый норовит отхватить кусок. И ты рискуешь остаться один, без пиццы, в этом суровом и равнодушном мире. Поверь, знаю по своему опыту.
    0x3500, // Каждый день я мечтаю о возмездии. Этим подлецам не удастся уйти от правосудия. Когда они осмелятся заказать пиццу, я буду рядом!
    0x35E9, // Кендзи грозно поднимает руку, будто собирается начать вершить правосудие прямо здесь и сейчас.
    0x3698, // Но сейчас мне нужно всего-то четыреста иен. Пожалуйста! Ты моя единственная надежда! Чтобы купить пиццу в магазине, придётся идти слишком далеко!
    0x37A1, // Я стараюсь не покидать комнату без крайней необходимости. Сейчас я расскажу тебе, что случилось, когда я в последний раз вышел, забыв принять все меры предосторожности.
    0x38D5, // Я был снаружи. Не помню, что я там делал. Что-то. Наверное, стоял. Может быть, размышляя при этом, как я там оказался.
    0x39A4, // И вдруг, ни с того ни с сего, на меня свалилась эта напасть.
    0x3A0E, // Словно вспышка молнии, рассёкшая небо, словно нож, стремительно разрезавший пополам сэндвич, пролетавшая мимо птица осквернила мою макушку своим дерьмом.
    0x3B2A, // Это был второй раз за мою жизнь, когда я испытал столь ужасное потрясение.
    0x3BB1, // А какой был первый?
    0x3BD4, // Но он продолжает толкать свою речь дальше, не обращая на меня никакого внимания. Мне хочется его встряхнуть. Он что, боится потерять нить рассказа? Буду считать так, хотя, скорее всего, он просто не услышал моего вопроса.
    0x3D64, // Это было словно в опенинге какого-нибудь аниме, когда главный чувак сражается со своим соперником и они в полёте скрещивают мечи, а всё вокруг пылает и взрывается, и всё это в самых пафосных ракурсах.
    0x3ED0, // Вот всё было точно так же, только с помётом.
    0x3F1F, // Ясно.
    0x3F29, // Поэтому мне нужны деньги. Тысячи иен должно хватить. Пожалуйста, чувак, не бросай меня в беде!
    0x3FD3, // Ты же говорил, что нужно четыреста.
    0x4013, // …Ладно.
    0x4022, // Что?
    0x402A, // Ладно, я тебе их верну. Клянусь.
    0x4063, // Естественно, ведь это и значит «брать в долг».
    0x40B7, // Но я точно не знаю, когда смогу их вернуть.
    0x4104, // У тебя неделя.
    0x411E, // А-а-ар-р-р-г-г-г-х-х-х!…
    0x4145, // Кендзи вздрагивает всем телом и воет, как умирающая корова, при этом его достоинство свободно болтается, ничем не прикрытое, что ужасает ещё больше.
    0x4254, // Не жмись ты так насчёт денег, мы ведь братья по оружию, чувак. Мужикам и так живётся несладко. Ты знаешь, что мужчины-порнозвёзды зарабатывают в два раза меньше, чем женщины-порнозвёзды?
    0x43A5, // Ну и что, ты же не порнозвезда.
    0x43DC, // А что, если я на стороне подрабатываю порнозвездой, пытаясь свести концы с концами, параллельно ведя борьбу с заговором феминисток? А ты, гад, со мной и крохами не можешь поделиться. Никто меня не понимает. Никто.
    0x455D, // Разве феминистки не выступают против порнографии?
    0x45BA, // Опять ты про этот заговор?
    0x45EA, // Это очень важно. Тебе, может, и пофиг, но, чувак, это действительно серьёзно. Феминистки – самый опасный враг, с которым сталкивалось человечество. Если будешь неосторожен, однажды – бац! – проснёшься с ножом в горле.
    0x4774, // Как же ты проснёшься, если тебя во сне закололи?
    0x47CB, // Женщины не особо умеют закалывать.
    0x480B, // Ты же говорил, что их нельзя недооценивать.
    0x485A, // Ну, я имел в виду, нельзя недооценивать их в целом. Поодиночке они не опасны, но, если бы началась война, где с одной стороны оказались бы мужчины, а с другой – феминистки, вот тогда начались бы неприятности.
    0x49D0, // Грядёт день, когда все феминистки мира выйдут из своей сверхсекретной центральной международной штаб-квартиры и скажут: «Началось, ублюдки!»
    0x4AD4, // Это нелепо. Где, по-твоему, на планете можно спрятать крепость, которая вместила бы разом всех феминисток мира?
    0x4B9E, // А кто сказал, что она на нашей планете?
    0x4BE4, // Я отворачиваюсь к зеркалу и начинаю строить гримасы, пытаясь найти ту, что наиболее точно выражала бы моё отношение ко всему этому бреду. Всё равно Кендзи меня не видит.
    0x4D18, // Это, увы, также означает, что он продолжает нести всякую околесицу.
    0x4D92, // Да, идёт война. Великая война, о которой пока знают лишь немногие, но скоро она захлестнёт весь мир! И тогда наступит черёд выбирать сторону. Мы должны будем выстоять. На самом деле это уже происходит.
    0x4EFD, // Представь себе эту кровавую баню. Бесконечную битву без чести и жалости.
    0x4F82, // И я был близок к тому, чтобы сдаться, когда подумал, что моё дело безнадёжно… Когда устал от ежедневной борьбы… Когда я спутал отключение электричества с нашествием феминисток и решил, что конец близок…
    0x50F7, // Но потом понял, что если я сдамся, то всё будет кончено, и я такой: «Ого!» – и решил, что нужно взяться за дело всерьёз. Потому что я – последний здравомыслящий человек в безумном мире. Выстоять – мой долг.
    0x5269, // Хреновое, должно быть, сопротивление, раз оно целиком и полностью зависит от одного парня, голышом разглагольствующего посреди душевой о коварных заговорах мирового масштаба.
    0x53AC, // Так ты одолжишь мне денег?
    0x53DC, // Он продолжает загораживать выход. Мне остаётся лишь согласиться, потому что уже становится прохладно и я хочу побыстрее пойти в класс.
    0x54D3, // Зашибись! Спасибо, чувак. Нам как-нибудь надо будет сходить с тобой в боулинг.
    0x5560, // Боулинг?
    0x5570, // Да, это величайший вид спорта. Знаешь почему? Женщин-боулеров практически не существует. Боулинг – лишь для настоящих мужчин.
    0x5656, // Как думаешь, какую из рубашек для боулинга мне лучше надеть: розовую, к которой у меня есть обувь в цвет, или светло-зелёную с цветочными узорами?
    0x575E, // У тебя есть специальные рубашки для боулинга?
    0x57B2, // Возможно.
    0x57C4, // Ладно. В общем, не забудь вернуть деньги.
    0x580E, // Я ведь могу расплатиться натурой, так?
    0x5854, // Мне некогда уточнять, что он имеет в виду.
    0x58A0, // Не знаю. Мне пора на урок, а ты мешаешь мне пройти.
    0x58FA, // А. Прости. Не буду задерживать, у самого дел по горло. Час пробил!
    0x596F, // Какой час?
    0x5982, // Мне ужасно нравится эта фраза, люблю говорить её по любому поводу.
    0x59FB, // Но сейчас тот самый час и в самом деле пробил.
    0x5A4E, // Да какой час-то?
    0x5A6B, // Мне нужно пописать. Выметайся.
    0x5AA3, // Что я и собирался сделать. И вообще, к чему ты это? Душевая-то большая.
    0x5B21, // И что? Мне надо быть одному, иначе я не смогу сходить. Начинаю нервничать в присутствии других…
    0x5BCF, // Ясно. Но что, если кто-нибудь зайдёт?
    0x5C11, // …
    0x5C15, // Я что-нибудь придумаю.
    0x5C3E, // Я корчу одну из гримас, которые практиковал перед зеркалом, но, отражённая в его очках, она выглядит глупо. Впрочем, он, как всегда, ничего не замечает, поэтому я одеваюсь и поспешно возвращаюсь в комнату, чувствуя себя так, будто с момента моего пробуждения прошла целая вечность.
    0x5E3B, // Потраченное на него время уже не вернуть. Я ему как-нибудь отплачу за это.
    0x5EC1, // Но сейчас надо спешить на урок.
    0x5EFA, // Сегодня я вхожу в класс первым и понимаю, что пришёл слишком рано. Но всё же сидеть здесь одному двадцать минут куда лучше, чем мучиться, проводя их с Кендзи.
    0x6017, // От утомлённости в сочетании с разочарованием и скукой я чувствую себя смертельно уставшим.
    0x60BF, // Отключившись на секунду, я просыпаюсь от удара головой о парту. Потирая лоб, я понимаю, что сейчас не стоит засыпать, а в будущем – приходить в класс так рано.
    0x61DE, // Наконец я слышу постукивание в коридоре и в дверном проёме появляется высокая фигура Лилли. Должно быть, она ищет Ханако.
    0x62BC, // Лилли нерешительно замирает в дверях, будто вампир, который не может войти, если его не пригласить. Думаю, надо позвать её, так как она, стоя там, выглядит покинутой.
    0x63E7, // Однако она входит по собственной воле, после того как расправляет юбку и поправляет воротник, как будто важно выглядеть опрятно, когда входишь в наш класс.
    0x6503, // Извините.
    0x6515, // Она пробует учтивым голосом обратиться к тихой комнате. Я догадываюсь, что из-за слепоты тишина её, возможно, тревожит, и поэтому нарушаю молчание.
    0x6621, // Доброе утро, Лилли.
    0x6644, // Хисао? Доброе утро. Я не слышала, как ты вошёл.
    0x6697, // Интересно, ей кажется подозрительным, что я не сказал ничего раньше? Вероятно. Если я теперь скажу что-то неправдоподобное, это меня потопит.
    0x6798, // Ну, я уже был здесь, просто спал.
    0x67D2, // Понятно. А ты сегодня, случайно, не видел Ханако?
    0x682A, // Нет, она обычно приходит перед самым звонком… Или после. Я могу ей что-нибудь передать.
    0x68C9, // В этом нет необходимости. Странно, но мне кажется, что мы сейчас с тобой одни в школе: я никого не слышала, пока шла сюда.
    0x69A2, // Наверное, не стоило мне сегодня так рано вставать.
    0x69FE, // Ты себя ругаешь за то, что не помешало бы делать другим? Пунктуальность – хорошая черта. По крайней мере, я так считаю.
    0x6AD5, // Сегодня суетливое утро. Близится фестиваль, а сегодня – последний срок регистрации мероприятий, сдачи бюджетных отчётов и прочих официальных бумаг.
    0x6BE7, // Такое ощущение, что все пытаются заполнить формы в последнюю минуту. Может быть, поэтому сегодня так тихо.
    0x6CA9, // Привет-привет~!
    0x6CC5, // В комнату, как по сигналу суфлёра, входят Сидзунэ и Миша. Последняя кричит своё приветствие так громко, что Лилли заметно вздрагивает.
    0x6DBA, // Привет, Хиттян~!
    0x6DD7, // Привет.
    0x6DE5, // Посмотрите, это же староста~! Здрасьте~!
    0x6E2D, // Лилли улыбается, видимо позабавленная словом «посмотрите» от Миши (или Сидзунэ).
    0x6EC1, // Доброе утро.
    0x6ED8, // Ты, конечно, староста не этого класса, верно, верно~?
    0x6F36, // Не этого.
    0x6F47, // Во время разговора с Сидзунэ Лилли подбирает слова гораздо тщательнее, чем на днях в разговоре со мной. Думаю, они совсем не ладят.
    0x7035, // Затем до меня доходит, что Лилли может в действительности не знать, здесь ли Сидзунэ, и пытается определить это, чтобы понять, с кем именно разговаривает.
    0x714D, // Всё, что она знает, – это то, что говорит с Мишей. Но, поскольку всем известно, что они с Сидзунэ практически неразлучны, Лилли, скорее всего, подозревает, что на самом деле «говорит» именно Сидзунэ.
    0x72B3, // Чёрт, как всё сложно. Я решаю помочь Лилли, скорее для собственного спокойствия.
    0x7345, // Ты сегодня рано, Сидзунэ.
    0x7373, // Да ты ещё раньше нас пришёл!
    0x73A6, // Миша злобно надувает щёки. Почему она злится? Ей передаются эмоции Сидзунэ?
    0x7430, // Однако неудивительно, что Сидзунэ не нравится моя реплика. Действительно, я пришёл раньше них, так что подобную мою фразу можно истолковать как угодно.
    0x7545, // Тем более Сидзунэ не может определить смысл по тону.
    0x75A5, // Пока я оцениваю, следует ли мне извиниться, Сидзунэ продолжает.
    0x7619, // Староста~! Хорошо, что ты здесь~! Нам надо поговорить.
    0x7679, // Фестиваль уже через три дня, так? Остальные классы уже сдали свои отчёты по бюджету! Даже первоклашки! Все, кроме тебя~!
    0x7751, // Ва-ха-ха~!
    0x7762, // Ведь ещё есть время, чтобы сдать, верно?
    0x77AA, // Сегодня! Сегодня – последний срок! Ты как-то не торопишься, да? Если бы всё было по-моему, я бы уже давно собрала все нужные бумаги, но кое-кто~! решил попросить: «Пожалуйста, отодвиньте сроки~!»
    0x7906, // Да, это была я. Планировать что-то такого масштаба – нелёгкая задача, и недели слишком мало, чтобы ожидать от целого класса полного её решения.
    0x7A0A, // Хочешь знать, что труднее, чем распределять бюджет для одного класса? Решать тот же вопрос для каждого класса в школе и ещё многое другое~! Тот, кто это делает, – я!
    0x7B32, // Миша, выпрямившись, упирает руки в боки. Ух, как вжилась в роль. Однако Лилли совсем не до смеха.
    0x7BDF, // Эй, Сидзунэ, не слишком ли ты с ней сурова? Ещё ведь есть целый день.
    0x7C59, // Не надо, Хисао. Всё в порядке.
    0x7C8E, // Лилли, кажется, рада, что я принял её сторону, но, видимо, смущена мыслью о том, что я могу подумать, будто она сама за себя не может постоять.
    0x7D8B, // Если ты говоришь о бюджетной отчётности, то меня печалит, что ты думаешь, будто я о ней забыла. Я понимаю, как она важна.
    0x7E63, // Тогда~! Прошу, передай её мне.
    0x7E98, // Сидзунэ, у Лилли может не быть её с собой.
    0x7EE3, // Она сейчас не здесь. Я попросила двух учеников с ней разобраться. Учеников из моего класса.
    0x7F89, // Последнее предложение она, к моему удивлению, выделяет особо. Она знает о попытках Сидзунэ и Миши затащить меня в Школьный совет?
    0x8075, // Наверное, разошлись слухи и теперь она использует меня в качестве оружия против Сидзунэ. Становится всё интереснее…
    0x814C, // Это было твоей обязанностью~! Бюджетную отчётность нельзя просто переложить на кого-то; держать всё под контролем – твоя работа как старосты! Подобное пренебрежение порядками – просто ужас~!
    0x82AB, // Они были способны его завершить и сделали это, но недавно заболели, поэтому не могли прийти в школу, чтобы вернуть его мне. Если хочешь, я от их имени извинюсь перед тобой за болезнь.
    0x83F5, // Давай~!
    0x8402, // Хотя Миша и не понимает небольшую подколку Лилли, Сидзунэ всё ясно, и она, кажется, разрывается между тем, чтобы оскорбиться, и тем, чтобы возрадоваться возможности начать перепалку.
    0x854E, // Лилли, они разве не возле школы живут? Это всего пять минут пешком~.
    0x85C8, // Что у них есть такого важного, что не даёт им выкроить и пяти минут из своего «плотного графика»… ради того, чтобы занести вещь, которая повлияет на веселье для всего их класса?
    0x870A, // Лилли открывает рот, чтобы что-то сказать, но Сидзунэ подходит к Лилли и начинает яростно жестикулировать, размахивая руками, как дирижёр.
    0x8807, // Миша пытается изо всех сил передать ту же страсть, но не может избавиться от своего обычного весёлого тона. Результат получается интересным и в чём-то сюрреалистичным.
    0x893A, // И что это вообще за позиция~? Я говорила, что это не то, что можно переложить на других; ты староста класса или нет?
    0x8A08, // Назови мне имена тех двоих: им нужно занять твоё место, раз ты не можешь справиться даже с такой простой задачей.
    0x8AD5, // Мои обязанности не ограничиваются заполнением одной-единственной формы.
    0x8B5C, // Тон Лилли становится немного нетерпеливым, но она хорошо скрывает от Сидзунэ своё волнение. Она не раскрывает свои карты.
    0x8C3B, // Зато Сидзунэ с улыбкой придерживает пальцами очки, зная, что Лилли не может ни видеть, ни слышать того, как она возбуждена.
    0x8D1A, // О, конечно, ты так занята, староста~! Быть тобой наверняка так трудно~!
    0x8D98, // Лилли сжимает губы в ответ на слова Миши, ясно понимая их цель, хотя Миша и передала их даже без намёка на сарказм.
    0x8E67, // Сидзунэ и Лилли друг друга не любят, это ясно, но это уже слишком. Терпение Лилли, похоже, лопается, и она готовится нанести ответный удар.
    0x8F61, // Перед тем как ты пришла, я как раз обсуждала бюджетную отчётность. Ты, наверное, очень одарённая, раз смогла закончить все свои дела в Совете так быстро, что можешь теперь выслеживать меня, дабы убедиться, что я не забуду о своих.
    0x9100, // Ты обвиняешь меня в безделье? Похоже, ты путаешь меня с собой~!
    0x9171, // Не думаю. Для меня это было бы сложновато – сравнивать себя с тобой.
    0x91ED, // Ты права, мы с тобой – как рай и ад.
    0x922C, // И нетрудно догадаться, что именно олицетворяешь ты.
    0x928B, // Воздух между ними дрожит от жара их неприязни. Ну, не в прямом смысле, конечно. Но всё равно они не могут её больше скрывать. Даже Миша, кажется, начинает понимать истинную суть этого разговора.
    0x93E9, // Хиттян~! Ты тоже не сачкуй~!
    0x941A, // О чём ты?
    0x942A, // Разве ты не идёшь на фестиваль, Хиттян? Ведь идёшь же? Тогда~! Надеюсь, ты постараешься на его благо лучше, чем она~!
    0x94F9, // Ханако не появляется на первом уроке, и её место на заднем ряду выглядит пустым и одиноким.
    0x959F, // Если встречу её позже, надо будет сказать ей, что Лилли её искала.
    0x9616, // По сравнению с утренними событиями урок невероятно скучный. Я лениво переворачиваю страницы учебника.
    0x96D3, // Каждый день мы проходим одинаковое число страниц, поэтому, читая наперёд, я могу получить представление о завтрашнем уроке.
    0x97B6, // Часы над доской тикают невыносимо громко. Учитель ничего не говорит целых семь минут, вместо этого покрывая доску рядами формул, переписанных прямо из учебника.
    0x98DD, // Мел постукивает по доске в такт тиканью часов.
    0x9932, // Я начинаю переписывать формулы, просто чтобы убить время, не замечая, что Миша заглядывает мне через плечо, пока она не оказывается чуть ли не верхом на мне.
    0x9A4F, // Что ты делаешь?
    0x9A6B, // Я пытаюсь говорить достаточно тихо, чтобы не привлечь к себе внимание учителя, но достаточно громко, чтобы привлечь её внимание.
    0x9B56, // А ты что делаешь, Хиттян~?
    0x9B84, // На меня накатывает паника, когда Миша начинает говорить во весь голос, и я поспешно шепчу ей в ответ, несмотря на то что она только что порушила все надежды на то, что наш разговор останется незамеченным учителем.
    0x9D07, // Формулы переписываю, а ты что творишь? Чего ты кричишь?
    0x9D6B, // А~, серьёзно? Но это же всё из книги… Поэтому больше никто и не переписывает~!
    0x9DF7, // Я знаю, ну и чего ты так разоралась?
    0x9E37, // А почему ты еле шепчешь, Хиттян? Тебя почти не слышно.
    0x9E98, // Я оглядываюсь чтобы посмотреть, не услышал ли нас кто-нибудь, и совершенно очевидно, что все услышали, даже учитель.
    0x9F6B, // Сидзунэ мило улыбается, и я начинаю думать, уж не она ли подговорила Мишу на это.
    0x9FFD, // Это из-за произошедшего между ней и Лилли?
    0xA04A, // Вот что я получаю за попытки быть рассудительным? За попытки выбрать что-то среднее? Сидзунэ чересчур горделива, хотя мне уже пора привыкнуть к такому её поведению.
    0xA176, // Зачем ты это делаешь?
    0xA19D, // Чего?
    0xA1A7, // Пытаясь удержать свой учебник на одном пальце, Миша совершенно не замечает устремлённого на нас тяжёлого взгляда учителя. В какой-то момент начинает казаться, что неприятностей нам не избежать, но тут учитель отворачивается, будто решив, что дело того не стоит.
    0xA385, // Вот и хорошо. Я с облегчением откидываюсь на стуле.
    0xA3E2, // Остаток дня проходит без происшествий, чему я на этот раз рад.
    0xA453, // После звонка я ненадолго задерживаюсь, просматривая пройденный на уроке материал; я всё равно предпочитаю уходить последним, чтобы избежать столпотворения в коридоре.
    0xA588, // Сидзунэ и Миша тоже остаются, разговаривая с кем-то из другого класса.
    0xA608, // Сидзунэ так быстро жестикулирует, что её руки свистят, как мечи, рассекающие воздух.
    0xA6A2, // Миша отчаянно пытается поспеть за ней, но ясно, что даже она с трудом её понимает.
    0xA736, // Я опускаю голову. Что бы они там ни обсуждали, это, кажется, дело серьёзное. Наверное, меня оно не касается. К тому же Сидзунэ, видимо, рассержена, хотя, может, это просто обычная её строгость.
    0xA88E, // Сидзунэ жестикулирует так, что у неё хрустят запястья, а Миша пытается это всё протараторить.
    0xA939, // Иногда она запинается, будто пытаясь произнести скороговорку. Но самое главное – ей ещё приходится переводить на язык жестов всё, что говорит их собеседница.
    0xAA5B, // Похоже, это непростая работёнка.
    0xAA97, // Миша выглядит уставшей, будто вот-вот свалится в обморок.
    0xAB00, // К счастью для неё, дело вскоре решается и девушки садятся обратно на свои места.
    0xAB92, // Уа-а-ах! Я так устала!
    0xABB8, // Она с измождённым видом опускает голову на парту.
    0xAC13, // Должно быть, подготовка к фестивалю – дело утомительное.
    0xAC7C, // В самом деле, все в этой школе воспринимают фестиваль очень серьёзно. Когда встречаю бездельничающих до или после уроков учеников, они всегда обсуждают свои планы, связанные с ним.
    0xADC6, // Приятно видеть всех настолько воодушевлёнными.
    0xAE1E, // Я, наверное, единственный, кому нечего делать.
    0xAE72, // Сидзунэ начинает жестикулировать, и Миша оживляется, наблюдая за её руками немного мутными глазами.
    0xAF2A, // Она жестикулирует грубыми, тяжёлыми, театральными взмахами.
    0xAF99, // Миша преобразует её жесты в слова.
    0xAFD8, // Она очень хорошо справляется, как будто на самом деле это Сидзунэ говорит, передавая через Мишу свои мысли.
    0xB09C, // Ну, мы в Школьном совете, знаешь ли, так что довольно заняты.
    0xB109, // Сарказм?
    0xB119, // То, как Сидзунэ обращается с людьми, создаёт впечатление, что и «говорит» она надменным голосом, но Миша переводит всё как обычно, искажая первоначальный смысл своей жизнерадостностью. Это всё также сбивает с толку, и я не думаю, что когда-нибудь привыкну.
    0xB2EB, // Забей.
    0xB2F7, // Как я могу забыть, вы же по меньшей мере дважды в день пытаетесь меня туда затащить?
    0xB38F, // Ха-ха-ха~! Но, Хиттян, кто-то иной мог бы и пожаловаться, что работы слишком много.
    0xB421, // Здорово бы было, если б студенты оказывали чуть большую поддержку своему руководству, проявили немного признательности тем, кто так упорно трудится, чтобы мечту сделать явью.
    0xB562, // Например, небольшую помощь. Так много, что ли, просим? Угу~! Помощи мы были бы рады~! От учеников вроде тебя~!
    0xB623, // Если бы ученики проявляли свою сплочённость и школьный дух и предлагали бы помощь, ну, не то чтобы мне это было необходимо…
    0xB705, // Но я бы от неё, наверное, не отказалась… Так что~! здорово, если бы кто-нибудь…
    0xB793, // А? Привет~!
    0xB7A6, // Взглянув через плечо, я замечаю Ханако, которая робко заглядывает в класс, спрятавшись за дверью.
    0xB858, // Эй! Опять изображаешь хулиганку?
    0xB894, // Лицо Ханако заливается краской в ответ на откровенный укол Миши, хоть та и говорит это в шутку.
    0xB941, // Сидзунэ изучающе на неё поглядывает, заставляя Ханако опустить взгляд и попятиться, пока на виду не остаются лишь её пальцы, нервно стискивающие край двери.
    0xBA60, // Может быть, её неприязнь к Ханако вызвана неприязнью к Лилли?
    0xBAD0, // Похоже на то, и Ханако, вероятно, тоже это известно.
    0xBB2D, // Кажется, они моментально забывают, что хотели заставить меня остаться до конца дня.
    0xBBC6, // В чём дело, Ханако?
    0xBBE8, // С… Сюда приходила Лилли?
    0xBC16, // Извини, Сато здесь нет. Но она, м, утром заскакивала.
    0xBC74, // Ханако продолжает скованно смотреть на Сидзунэ, которая глядит на неё в ответ изучающим взглядом. Что она пытается сделать?
    0xBD57, // Конечно, Сидзунэ не собирается отводить взгляд. Она и без того устрашающая, так что я могу только догадываться, в каком ужасе сейчас Ханако.
    0xBE56, // Но это немного забавно – наблюдать, как реагирует Ханако на обычное поведение Сидзунэ. Похоже, вот что случается, когда встречаются две абсолютные противоположности.
    0xBF88, // Вы… вы не знаете, где она?
    0xBFB7, // Если в ней есть хоть капля здравого смысла, то она в своём классе, готовится к фестивалю. Но кто знает, где шатается эта женщина.
    0xC09F, // Может, сачкует где-нибудь~! Бесполезная женщина~!
    0xC0F8, // Ханако резко кивает и торопливо уходит, видимо во избежание дальнейших контактов с Сидзунэ. К сожалению, это вновь переключает всё их внимание на меня.
    0xC20D, // Но Хиттян не бесполезный, правда? Правда? Он сам так сказал~! Ва-ха-ха~!
    0xC28B, // Я понимаю, к чему они клонят, и после вчерашнего совсем не хочу в этом участвовать.
    0xC321, // Ну, удачи вам с подготовкой…
    0xC356, // Я начинаю собирать портфель, готовый рвануть к выходу.
    0xC3BA, // К сожалению, он находится в противоположном конце комнаты.
    0xC426, // Короткая дистанция до двери кажется мне бескрайней пустыней.
    0xC497, // Сидзунэ с Мишей не спеша выполняют манёвр, с тревожной предусмотрительностью отрезая мне путь к отступлению, как при перестрелке между кораблями.
    0xC5A4, // Думаю, Ситтян хочет сказать, что тебе следует нам помочь, Хиттян~!
    0xC61B, // Ничего себе, а я бы и не понял! Она так хорошо скрывает свои намерения.
    0xC69A, // Но~! В этом её намерение и заключается, поэтому, пожалуйста, помоги. Мы не успеваем, нам нужно собрать киоски для фестиваля, почти все из них – самим, представляешь?
    0xC7C3, // Сколачивать доски, снова и снова, часами, – это очень трудно!
    0xC832, // Я настолько привыкла к этим движениям, что махала руками так, будто держу молоток, прямо на уроке, и даже не заметила!
    0xC907, // Она демонстративно стучит по парте.
    0xC949, // Так монотонно, ненавижу! А вчера я сколотила все лежащие друг на друге доски…
    0xC9D7, // Получилась просто пачка прибитых друг к другу досок, мне пришлось их разъединять, притом все на меня ругались и смеялись надо мной~!
    0xCAC8, // Эм…
    0xCAD0, // Так что…
    0xCAE1, // Она хватает меня за плечо и ухмыляется, озорно проводя языком по зубам.
    0xCB63, // У тебя есть на сегодня планы, Хиттян?
    0xCBA6, // Хотела бы я знать~.
    0xCBC8, // Разумеется, у меня есть планы…
    0xCC01, // Правда~?
    0xCC10, // Ты собираешься нам помочь, да?
    0xCC47, // Я замечаю, что её руки постоянно двигаются.
    0xCC96, // Она переводит всё, что мы говорим, чтобы Сидзунэ могла понять.
    0xCD07, // Сидзунэ какая-то тихая. Она всё ещё злится? Ну, хоть немного – наверняка. Это по глазам видно. Но это может оказаться лишь ещё одним способом внушить мне чувство вины и заставить помочь ей.
    0xCE5D, // Надо найти какой-нибудь выход.
    0xCE95, // Эй, мне уже пора, в библиотеку. Понимаете, домашка…
    0xCEF2, // Мне надо идти, ясно? Мне надо быть прилежным, потому что я новенький и нужно произвести хорошее впечатление, верно? Да…
    0xCFCB, // В общем, увидимся!
    0xCFEC, // Я поворачиваюсь, чтобы дёрнуть к двери, но Сидзунэ преграждает мне путь со скрещенными на груди руками и безжалостным выражением на лице.
    0xD0E8, // Она грозит мне пальцем и принимается жестикулировать Мише с видом командира отряда, отдающего приказания солдатам.
    0xD1BD, // Не было похоже, чтобы ты особо торопился в библиотеку, Хиттян~!
    0xD22F, // Вот именно, Ситтян~, очень похоже, что он собирался бездельничать весь остаток дня.
    0xD2C6, // Ха-ха-ха~! Ва-ха-ха~! Ты окружён~!
    0xD2FE, // Пойдём в кабинет Школьного совета~!
    0xD33F, // Она издаёт смешок, а затем разражается хохотом.
    0xD396, // Прости, Хиттян, мне немножко стыдно, но ведь так будет лучше для всех, правда?
    0xD422, // Правильно, Ситтян! Да~, и это тоже аргумент.
    0xD470, // Да, это всем выгодно, это решает все наши проблемы.
    0xD4CC, // Да, да~!, Я тоже надеялась, что он оценит наши усилия.
    0xD52A, // Они придвигаются всё ближе друг к другу, будто собираясь наброситься.
    0xD5AA, // Эй, народ, ну ведь двое на одного – нечестно?
    0xD5FB, // Она продолжает невозмутимо смотреть на меня, а затем зловеще улыбается.
    0xD67F, // Ну давай, у нас много работы! Пойдём в кабинет Школьного совета~!
    0xD6F4, // Блин, даже не знаю…
    0xD718, // Миша смеётся.
    0xD731, // Дежавю~?
    0xD740, // Она сдавленно хихикает, прежде чем снова засмеяться.
    0xD7A1, // Ха-ха-ха, знаешь, в гороскопе было сказано, что у меня сегодня будет удачный день.
    0xD834, // И теперь, когда тебе придётся помогать—{w=.5}{nw}
    0xD888, // Сидзунэ делает несколько быстрых жестов.
    0xD8D4, // Точно~! Я имела в виду, что теперь, когда ты исключительно по собственной воле решил нам помочь, я смогу немного расслабиться! Повезло~, да?
    0xD9CF, // Я открываю рот, чтобы возразить, но понимаю, что в этом нет никакого смысла.
    0xDA58, // Я снова начинаю придумывать выход из всего этого. Нет, их действия явно спланированы, нет смысла пытаться с ними дискутировать.
    0xDB41, // Нельзя договориться с сумасшедшим. Я хмурюсь, но они даже не замечают моего недовольства, подтверждая этим мои подозрения.
    0xDC22, // Сейчас они довольно расслаблены. Наверное, думают, что уже победили, поэтому ослабили бдительность.
    0xDCD9, // Весьма самонадеянно.
    0xDD00, // Они проходят передо мной вперёд и выходят за дверь.
    0xDD5E, // А я тайком отступаю обратно в класс, в момент, когда они, шагая в коридор, поворачивают к лестнице.
    0xDE10, // Я облегчённо вздыхаю и поспешно начинаю собирать остальные вещи, чтобы сбежать.
    0xDEA3, // Дверь класса резко захлопывается.
    0xDEE2, // Не очень красиво с твоей стороны. Ха-ха-ха, но ты нас подловил. Правда, Ситтян?
    0xDF6E, // Точно, точно… …Ха-ха-ха!
    0xDF9B, // Зачем ты так? Я думала, ты сказал, что поможешь нам!
    0xDFF7, // И тут же решил слинять! Думал, тебе это так просто сойдёт с рук, да?
    0xE06F, // Негодование проходит, и она начинает истерически хохотать, успокаиваясь только после раздражённого взгляда Сидзунэ.
    0xE147, // А, ой… Да~, ты думал, что тебе это сойдёт с рук! Но преступник всегда возвращается на место преступления!
    0xE204, // Во-первых, я даже не успел выйти из класса. Нет, постойте; во-первых, я даже не соглашался помогать.
    0xE2B6, // Не слишком ты сообразительный, да, преступничек? Думал, что так просто сможешь увильнуть от обязанностей… Как низко, Хиттян~!
    0xE39B, // Я – преступник? Что я сделал? Каково обвинение? В чём я виноват?
    0xE40E, // Это суду решать, преступник! Не думаю, что мы обязаны тебе рассказывать!
    0xE491, // Кроме того, преступник тут ты, так что сам знаешь, что ты сделал!
    0xE505, // Ты читала «Процесс» Кафки?
    0xE536, // Нет, что это, Хиттян~? Какое это имеет отношение к нашему случаю?
    0xE5AA, // Я его прочитал несколько месяцев назад. Это о людях, которые устроили инсценированный суд парню, который просто хотел жить своей жизнью. Они не захотели оставить его в покое, а он не мог бороться с властью.
    0xE720, // Хиттян, к чему это вообще?
    0xE74F, // Эй~! Что это значит?
    0xE772, // Она снова поворачивается ко мне после продолжительного обмена жестами с Сидзунэ.
    0xE808, // Знаешь, мы обе в тебе разочарованы. Ты нас подвёл, Хисао.
    0xE86E, // Всю команду.
    0xE885, // Не оправдал доверия. И надежд~.
    0xE8BD, // Разве так можно обращаться с людьми? Убегать от ответственности, бросать товарищей?
    0xE957, // Мы думаем, что ты нам задолжал соблюдение своих обязательств.
    0xE9C8, // Что? Но я ни на что не подписывался~!
    0xEA09, // У меня перехватывает дух от такой несправедливости, и я тут же начинаю задыхаться.
    0xEAA0, // Это неправда, Хиттян! Ты сказал, что ты не бесполезный, ты точно так сказал, точно, точно, точно~!
    0xEB4D, // Отвечай за свои слова~! Докажи, что ты парень не бесполезный!
    0xEBBB, // Если попытаешься увильнуть, твоя честь окажется навсегда запятнана~!
    0xEC3A, // Так что весь остаток дня мы проведём вместе, втроём, и будем усердно работать!
    0xECC8, // Ты нас не обманешь!
    0xECEB, // Ты должен быть счастлив, что сослужишь своей школе отличную службу. Спрашивай не что школа может сделать для тебя…
    0xEDBE, // А что ты можешь сделать для школы!
    0xEDFC, // Ха-ха-ха!
    0xEE0C, // Ха-ха-ха-ха-ха-ха-ха!
    0xEE30, // Как угнетающе.
    0xEE4B, // Взбодрись, взбодрись, Хиттян!
    0xEE81, // Она хлопает меня по спине достаточно сильно, чтобы вышибить воздух из лёгких. Я пытаюсь перевести дух.
    0xEF3C, // К тому же разве ты не рад тому, что тебе удастся провести день с двумя прелестными девушками?
    0xEFE5, // Ха-ха-ха-ха!
    0xEFFA, // Наверное, они правы. Кто меня только за язык тянул?
    0xF056, // Смирившись с судьбой, я следую за ними в кабинет Школьного совета…
    0xF0D1, // …И забиваю последний гвоздь в киоск. Это заняло весь день, и время обеда почти прошло. Но теперь всё готово.
    0xF195, // Сидзунэ достаёт рулетку и небольшой уровень и принимается тщательно проверять его.
    0xF22F, // Она довольно улыбается и подзывает Мишу.
    0xF27A, // Она говорит, что ты молодец. Ты даже заслужил подарок.
    0xF2DC, // Ого, я тоже впечатлена. И так быстро! Ты раньше этим занимался?
    0xF34D, // Нет. Никогда.
    0xF365, // Никогда раньше.
    0xF382, // И больше никогда не буду.
    0xF3B0, // Ну, наш норматив – шесть киосков в день. Через несколько минут мы с Ситтян закончим вот этот.
    0xF459, // Значит~… ещё четыре!
    0xF47F, // Она говорит, у нас хороший темп~!
    0xF4BA, // Разве не весело?
    0xF4D8, // Я бы мог придумать для себя миллион других занятий, но полагаю, что каждый должен внести свою лепту в подготовку к фестивалю, даже я.
    0xF5C9, // Вам крупно повезло, что я вам помогаю: если бы я захотел, то с лёгкостью бы уклонился от всего этого.
    0xF67E, // Правда, Хиттян?
    0xF69A, // Ва-ха-ха~! Ситтян думает, что ты просто треплешь языком! У японцев нет рефлекса «бороться или бежать»~!
    0xF753, // Сидзунэ с хитрым видом складывает пальцы домиком.
    0xF7AF, // Точно~! Точно, точно~! Если бы ты захотел сбежать, то сделал бы это сразу~! Тем и отличаются решительно настроенные люди: у них нет сомнений, нет сожалений!
    0xF8C5, // Может, говорить тебе это было плохой идеей, поскольку теперь Хиттян знает, что делать в следующий раз~.
    0xF980, // Но уже то, что она спокойно мне это говорит, показывает, что она сомневается в моей решимости.
    0xFA2A, // Это только подзуживает меня, так как я уже жду возможности, чтобы снова взбунтоваться. Но, если это случится, она может суметь опять меня как-нибудь подловить.
    0xFB4B, // Ситтян говорит, что теперь она довольна.
    0xFB95, // Гораздо, гораздо позже этим вечером мы смотрим на шесть готовых киосков.
    0xFC1A, // Гордые проделанной работой, мы сидим и молча взираем на плоды своих трудов. Просто любуемся.
    0xFCC3, // Я понимаю, что мне сильно хочется пить.
    0xFD0A, // Эй, а в коридоре ведь есть торговый автомат? Они весь день включены, да?
    0xFD8B, // Да, и напитки очень дешёвые. В такие дни мы обычно что-нибудь берём оттуда.
    0xFE12, // Я шарю в кармане и нахожу монетку в сто иен.
    0xFE61, // Этого хватит? Меня жажда замучила.
    0xFEA0, // Сто иен? Тебе хватит на любой напиток.
    0xFEE5, // Хорошо, очень хорошо.
    0xFF0C, // А, подожди секундочку.
    0xFF35, // М-м? Что такое, Ситтян? Хочешь, чтобы он и тебе купил попить? Ха-ха-ха!
    0xFFB0, // Хиттян, ты сегодня нам очень помог, поэтому я – то есть Ситтян – тебя угощу.
    0x1003A, // Эй, а меня?
    0x1004D, // Что бы ты хотел? Я и сама пить хочу?
    0x1008C, // Я тоже!
    0x10099, // М, не знаю. Что угодно. Пусть будет газировка со вкусом дыни.
    0x10106, // Эй, погоди, Ситтян! Я тоже хочу!
    0x1013E, // Ну-у!..
    0x10149, // Знаешь, в такие моменты я думаю, что она меня просто дразнит.
    0x101B7, // Наверное, так и есть. Уверен, она и тебе что-нибудь принесёт, так?
    0x1022C, // Да, обычно приносит. Но… как знать…
    0x1026E, // Хех.
    0x10276, // Сидзунэ возвращается с двумя дынными газировками и банкой фруктового сока.
    0x10301, // Она протягивает одну газировку мне, другую – Мише.
    0x1035E, // Спасибо, Ситтян~! Я искренне верила, что ты и мне принесёшь, я знала, что могу на тебя рассчитывать! Ва-ха-ха-ха!
    0x10425, // Но как ты догадалась, что это именно то, чего я хотела? Я обычно покупаю что-нибудь другое.
    0x104C8, // Что? Ты знала, что я захочу попробовать? И что мне нравятся такие детские напитки? Ха-ха-ха-ха!
    0x10571, // Я кивком благодарю Сидзунэ, а она, улыбаясь, кивает в ответ.
    0x105DD, // Эй, Хиттян…
    0x105F3, // Мы уже провели вместе много времени. И уже успели сделать так много.
    0x1066F, // Надо уже перестать ходить вокруг да около. Я хочу сказать, что…
    0x106E3, // Звучит так, будто она собирается пригласить меня на свидание, но этого не может быть. Тем не менее сердце у меня колотится, как отбойный молоток. Чёрт, напоминает похожую сцену, произошедшую ранее в этом году.
    0x1085E, // Я пытаюсь что-то сказать, но мозг не может решить, то ли останавливать её, то ли просить продолжать.
    0x10912, // Я чувствую, что краснею до кончиков ушей.
    0x1095D, // Я пытаюсь сказать…
    0x10981, // Не хочешь ли ты вступить в Школьный совет?
    0x109CE, // Блин, вот облом.
    0x109EB, // Ха-ха-ха! Ха-ха-ха-ха! Ха-ха-ха-ха-ха! Ва-ха-ха! Ха-ха-ха-ха!
    0x10A4F, // Ты думал, она хочет пригласить тебя на свидание, Хиттян?
    0x10AB5, // Ха-ха-ха-ха! Ха-ха-ха! Ха-ха-ха! Ха-ха-ха-ха!
    0x10AFF, // Ха-ха-ха-ха-ха-ха-ха-ха!
    0x10B28, // Мне очень неловко, я чувствую, как краснею ещё больше.
    0x10B8A, // Сидзунэ тоже пытается скрыть румянец после Мишиного перевода, а потом кладёт передо мной несколько листов бумаги.
    0x10C5C, // Ну так как? Все бланки здесь.
    0x10C90, // И ты всё равно уже сидишь. И ты как дома. Напитки и всё такое~!
    0x10CFE, // Что скажешь?
    0x10D15, // Она немного успокаивается и спрашивает чуть более торжественно.
    0x10D8C, // Хиттян, каково твоё решение?
    0x10DC0, // Тебе ведь не так уж всё это не понравилось, правда?
    0x10E1C, // Я более чем удивляюсь такой внезапной смене тона. Даже не совсем понимаю, как следует реагировать.
    0x10ED0, // Прежде всего, она не орёт без соблюдения какого-либо такта.
    0x10F3C, // Прежде, я уверен, она заранее знала, что я отвечу «нет».
    0x10FA0, // В этот раз, похоже, она настроена серьёзно.
    0x10FEE, // Думаю, тебе всё же стоит вступить. Не только чтобы помогать нам, а… ты ведь всё равно с нами тусуешься.
    0x110A8, // Думаю, Ситтян тоже была бы рада, если б ты вступил. Ты ведь нас не ненавидишь, правда?
    0x11141, // Никому не станет хуже, если ты вступишь. И мне будет приятно.
    0x111AF, // Похоже, она с трудом подбирает слова, что кажется странным для обычно столь разговорчивой Миши.
    0x1125E, // По какой-то причине от этого меня охватывает чувство, близкое к тревоге.
    0x112E2, // Я перевожу взгляд на Сидзунэ, которая неуверенно на меня смотрит, рассеянно стирая грязь с ногтей.
    0x11396, // Если ты не захочешь вступать, обещаю, что больше мы не будем упрашивать, но если бы ты вступил, то мы были бы очень счастливы.
    0x11478, // И Сидзунэ, и Миша, кажется, не могут посмотреть мне прямо в глаза.
    0x114EE, // Не стану врать: я бы не смог отказаться от возможности побыть рядом с такими милыми девушками.
    0x1159A, // Не хотелось бы столько работать каждый день, но после фестиваля, я уверен, дел будет поменьше.
    0x11645, // По крайней мере, я на это надеюсь.
    0x11682, // Хорошо. Думаю, хуже не будет, так почему бы и нет?
    0x116DA, // Чудесно. Чудесно! А-ха-ха-ха~!
    0x1170E, // Сидзунэ удовлетворённо складывает пальцы домиком.
    0x1176C, // Она всё заполнит, Хиттян. Поздравляю, теперь ты официальный член Школьного совета!
    0x11803, // Здорово. Надеюсь, работы не будет много.
    0x1184C, // Честно говоря, я никогда раньше не занимался подобной деятельностью.
    0x118CB, // Но, может быть, это станет хорошим опытом?
    0x11917, // Миша начинает хлопать в ладоши, при этом неудержимо хохоча.
    0x11984, // Поздравляю, Хиттян!
    0x119A8, // Поздравляю!
    0x119BE, // Я уже понял.
    0x119D4, // Я, не сдержавшись, улыбаюсь их по-детски милому проявлению радости.
    0x11A4F, // У Школьного совета всегда дела! Но на сегодня мы закончили. До завтра, Хиттян!
    0x11ADC, // У нас ещё осталась работа, так что мы на тебя рассчитываем!
    0x11B47, // Я выхожу из комнаты, чувствуя себя выжатым как лимон. Окрестности пустынны, и школа в такое позднее время выглядит весьма зловеще. Свет горит только в окне кабинета Совета.
    0x11C81, // Такими будут будни Школьного совета? Моё тело может не выдержать.
    0x11CF9, // Если встречу её позже, надо будет сказать ей, что Лилли искала её.
    0x11D70, // По сравнению с утренними событиями, урок невероятно скучный. Я лениво переворачиваю страницы учебника.
    0x11E2E, // Несмотря на стремление не отставать по учёбе, пока я лежал в больнице, мне ещё во многом нужно нагонять школьную программу, но я совсем от этого не в восторге.
    0x11F4E, // Я начинаю переписывать формулы, просто чтобы убить время, хоть они и взяты из учебника.
    0x11FED, // После звонка заняться мне нечем и я ненадолго задерживаюсь, просматривая пройденный на уроке материал; я всё равно предпочитаю уходить последним, чтобы избежать столпотворения в коридоре.
    0x12148, // Может быть, в этом есть сдерживаемая злоба.
    0x12197, // Я опускаю голову. Что бы они там ни обсуждали, это, кажется, дело серьёзное.
    0x1221F, // Я решаю использовать эту возможность, чтобы помириться с Сидзунэ, без повторного втягивания в разговор о Школьном совете, хотя подозреваю, что теперь эта дверь для меня закрыта.
    0x12364, // Сидзунэ сперва усмехается, будто решая, проигнорировать меня или сказать колкость, но в конце концов начинает жестикулировать, не сделав ни того, ни другого.
    0x12484, // Миша оживляется, наблюдая за её руками немного мутными глазами.
    0x124F9, // Она наверняка усердно тренировалась.
    0x1253E, // Обеспечение проведения фестиваля – наша важнейшая обязанность.
    0x125B5, // Мы опозорим себя перед старшими поколениями Школьного совета, если фестиваль не удастся.
    0x12659, // Поэтому не должно быть никаких упущений, никаких… э… по-моему, это было «помех», и ничего, что могло бы нарушить безукоризненность фестиваля.
    0x1275D, // Снова так хорошо знакомая пылкая речь Сидзунэ и Мишина подача.
    0x127D0, // Лицо Ханако заливается краской в ответ на откровенный укол Миши, хоть та и сказала это в шутку.
    0x1287D, // Может быть, её неприязнь к Ханако вызвана неприязнью к Лилли.
    0x128ED, // Конечно, Сидзунэ не собирается отводить взгляд, и она и без того устрашающая, так что я могу только догадываться, в каком ужасе сейчас Ханако.
    0x129EF, // Немного неудобно наблюдать, как реагирует Ханако на обычное поведение Сидзунэ. Похоже, вот что случается, когда встречаются две абсолютные противоположности.
    0x12B13, // Тебе нужно её найти? Она искала тебя утром, но вы, наверное, разминулись.
    0x12B96, // Она немного медлит, не отвечая на простой вопрос, с таким видом, будто не уверена, стоит ли вообще отвечать.
    0x12C59, // Д… да.
    0x12C65, // Я могу с тобой сходить.
    0x12C8F, // Если ты не против.
    0x12CB0, // Ханако вся напрягается и слабо кивает, будучи всё ещё настороже. Я чувствую, что ей уютнее было бы остаться одной, но отступать уже поздно.
    0x12DAC, // На её лице застыло обычное для неё обеспокоенное выражение, из-за которого я и сам напрягаюсь. Непонятно почему.
    0x12E79, // Я, в принципе, понимаю, почему она всё время такая настороженная… или скорее почему она стала такой.
    0x12F30, // Но всё ещё понятия не имею, как себя с ней вести.
    0x12F87, // Скоро обеденный перерыв. Ты хотела пойти на обед с Лилли?
    0x12FEF, // Она еле заметно кивает.
    0x1301A, // Видимо, она пыталась попасть в столовую.
    0x13064, // Ну, и во время обеда там полно народа, почти столько же, сколько и во время ланча.
    0x130F6, // Однако не так много, потому что обед длится дольше ланча. Но я понимаю, почему Ханако не решалась пойти туда в одиночку.
    0x131CF, // Я беру портфель, и мы выходим. Ханако шагает немного вприпрыжку, чтобы поспеть за мной, так что я сбавляю ход, подстраиваясь под неё.
    0x132BF, // Вскоре мы уже шагаем по коридору с устраивающей нас обоих скоростью.
    0x1333D, // Это похоже на прогулку с девушкой, чего я никогда раньше не делал.
    0x133B5, // Однако у Ханако, похоже, сейчас нет ничего такого в мыслях. Даже несмотря на то, что мы идём наравне, она не приближается ко мне и на расстояние вытянутой руки.
    0x134D5, // Наверное, ей до сих пор неуютно в моей компании. Учитывая, какая она застенчивая, с этим ничего не поделать, во всяком случае сейчас.
    0x135C5, // К моменту, когда мы входим в столовую, толпа уже успевает рассосаться, но Лилли нигде не видно.
    0x13671, // Ханако опускает голову ещё ниже, чем обычно.
    0x136C2, // Ты искала ещё где-нибудь?
    0x136F0, // Т-только в библиотеке… Я читала…
    0x1372E, // Так она всё-таки прогуливает уроки в библиотеке.
    0x13787, // А, значит, это был не слишком тщательный поиск. Ну, если подумать, она может быть в своём классе, как и сказала Сидзунэ, правда?
    0x1386B, // П-правда.
    0x1387C, // Ханако соглашается с моими аргументами едва заметным кивком.
    0x138ED, // Господи, как же с ней трудно.
    0x13921, // Мне словно нужны перчатки из двойного слоя шёлка с набивкой, только чтобы начать с ней как-то взаимодействовать.
    0x139EF, // Беседа может помочь ей привыкнуть ко мне. Нетрудно заметить, что повисшее в воздухе молчание тяготит нас обоих.
    0x13ABB, // Так вы с Лилли время после уроков обычно проводите вместе, да?
    0x13B2C, // Д-да.
    0x13B35, // Не знаю, какого ещё от неё можно было ждать ответа и зачем я вообще задал этот вопрос. Это, в общем-то, и так было вполне очевидно.
    0x13C1E, // Она явно не из тех людей, что собирают вокруг себя толпу друзей, а потому подозреваю, что Лилли – её единственная подруга.
    0x13CFC, // Наверное, тяжело быть в разных классах.
    0x13D44, // Она резко, почти рефлекторно кивает. По сравнению с тем, как Лилли внимательно следит за своей речью и жестами, Ханако спешит давать как можно более прямые и краткие ответы.
    0x13E7F, // Но Лилли… приходит к нам в класс. Даже если занята…
    0x13EDE, // Она тихонько улыбается, произнося это, явно ценя то, что Лилли отклоняется от маршрута, чтобы помочь ей.
    0x13F9B, // Это очень мило. Больше нам сказать друг другу нечего, и разговор заканчивается.
    0x1402C, // Поднимаясь по лестнице в вестибюль, мы встречаем группу спускающихся учеников. Они похожи на косяк рыб, меняющий место кормёжки.
    0x14118, // Они общаются между собой, не обращая на нас внимания, но не успеваю я опомниться, как Ханако прячется у меня за спиной.
    0x141EF, // Эй, ты в порядке?
    0x1420D, // П-просто продолжай идти…
    0x1423C, // Ученики проходят мимо, даже не взглянув на нас, и Ханако снова занимает место рядом со мной, когда мы входим в здание, а её отступившее было смущение снова возвращается.
    0x1436F, // Она не расслабляется, даже когда мы доходим до третьего этажа.
    0x143E1, // Не то чтобы я не был знаком с застенчивыми людьми, среди которых были и девушки, но Ханако в своей боязни людей выходит далеко за рамки, которые я бы назвал «нормальными».
    0x14517, // Если бы Лилли не выступила в качестве посредника, сомневаюсь, что Ханако смогла бы вот так идти рядом со мной. Она полностью закрывается в присутствии других людей.
    0x14643, // Остаток прогулки до класса Лилли проходит в напряжённой тишине, из-за которой я сожалею о её полной неспособности общаться.
    0x14726, // Когда мы поднимаемся на нужный этаж, гул из класса Лилли становится слышен во всём коридоре. Я такого шума не ожидал.
    0x147FB, // Ну, думаю, мы её нашли…
    0x14825, // Это было несложно. Не заходила ли Ханако сначала сюда, а потом – ко мне за подкреплением?
    0x148C7, // Ну, если это так, значит она начинает мне немного доверять. Это определённо хорошо.
    0x1495E, // Наконец мы доходим до двери класса 3-2. Ханако прячется у меня за спиной, и я открываю дверь.
    0x14A03, // Внутри царит рабочая обстановка: все ученики разговаривают одновременно, работая каждый над своей задачей.
    0x14AC9, // Судя по банкам с краской, украшениям и изготавливаемым растяжкам, они готовятся к фестивалю.
    0x14B73, // Думаю, в первую очередь надо найти Лилли…
    0x14BC0, // …{w} Вот она.
    0x14BD6, // Найти её среди неразберихи оказывается удивительно просто, не в последнюю очередь из-за её внешности.
    0x14C91, // Она стоит в передней части класса с несколькими учениками, собравшимися вокруг неё, и сразу видно, что она – главная по подготовке или как минимум занята раздачей указаний.
    0x14DCD, // Осторожно ступая между учениками, сгорбленными на полу из-за недостатка места на партах, я по привычке поднимаю руку, когда мы наконец доходим до Лилли.
    0x14EE3, // Привет, Лилли.
    0x14EFD, // Она перестаёт говорить с одноклассницей, заметно уступающей ей в росте, и поднимает голову, внимательно прислушиваясь.
    0x14FD8, // Простите, кто…
    0x14FF4, // А, извини. Хисао. И Ханако со мной.
    0x15031, // П-привет.
    0x15042, // Она очень стесняется. Учитывая количество людей вокруг, нетрудно понять почему.
    0x150D5, // Лилли на секунду замолкает, чтобы оценить ситуацию, а затем опять переключается на другого ученика.
    0x1518C, // Пока попроси совета у Мории. Кендзи уже занят – рисует один из плакатов.
    0x15210, // Быстро кивнув, она уходит, осторожно скользя пальцами вдоль стены для ориентации.
    0x152A6, // Стоп… Кендзи? Тот самый Кендзи?
    0x152E0, // Я быстро оборачиваюсь, наклонившись, чтобы заглянуть за Ханако.
    0x15355, // Ошибки быть не может: в углу комнаты действительно скрючился Кендзи, разрисовывая кусок ткани. Его глаза находятся в нескольких сантиметрах от кисти, напоминая, насколько близко ему нужно подойти, чтобы различить моё лицо.
    0x154ED, // Очень жаль. У нас в классе мало учащихся с хотя бы частичным зрением, так что на них большой спрос.
    0x1559F, // Верно, ведь класс 3-2 – специальный класс для учеников с плохим зрением. Им, должно быть, тяжело готовиться к фестивалю.
    0x15677, // Нужна помощь? Я могу помочь, если нужно. И Ханако, наверное, тоже.
    0x156EC, // Если чем-то её занять, это пойдёт ей на пользу, но сомневаюсь, что у неё хватит смелости спросить напрямую. После моих слов она быстро кивает, подтверждая догадку о том, что я сделал верный ход.
    0x15849, // Лилли вздыхает с облегчением.
    0x15880, // Очень хорошо. Теперь мы, возможно, закончим до того, как все уйдут на ужин.
    0x15906, // Не могли бы вы помочь человеку, который рисует главный плакат? Там много работы, но помочь ему некому.
    0x159BF, // Кендзи? Конечно.
    0x159DD, // Она, кажется, удивлена, что я его знаю. Что и неудивительно.
    0x15A48, // Я так понимаю, вы встречались?
    0x15A7F, // Мы живём в соседних комнатах в общежитии. Очень трудно разминуться.
    0x15AFB, // Приятно видеть, что ты так быстро заводишь друзей.
    0x15B57, // Друг… Интересно, подходящее ли это для него слово?
    0x15BB4, // Молчание Ханако напоминает мне о причине, по которой я вообще вызвался помочь.
    0x15C44, // Тогда мы пойдём к нему. Он знает, что нужно делать, так ведь?
    0x15CB0, // Именно. Если будут проблемы – спрашивайте.
    0x15CFF, // Хором соглашаясь, мы с Ханако пускаемся в очередное путешествие через класс.
    0x15D8C, // Кендзи сидит на полу сгорбленный, не отрывая глаз от белого полотна перед собой.
    0x15E1F, // Привет, Кендзи.
    0x15E3B, // …Нет ответа. Он продолжает водить кистью по большому, наполовину раскрашенному иероглифу, начерченному карандашом.
    0x15F11, // Кендзи?
    0x15F1F, // А? Что? Кто это?
    0x15F3A, // Если он так общается с одноклассниками, то неудивительно, что он работает один.
    0x15FCB, // Это я. Хисао. Из—{w=.5}{nw}
    0x15FF4, // Да, да, знаю, чувак. Но что ты здесь делаешь?
    0x16042, // Его пренебрежительное отношение меня раздражает.
    0x1609E, // Наверное, он из тех, кто полностью сосредотачивается на работе и терпеть не может, когда его отвлекают.
    0x1615A, // Звук шагов Ханако, выходящей у меня из-за спины, напоминает о её присутствии.
    0x161E6, // Я собирался помочь с плакатом. Точнее, мы с Ханако.
    0x16242, // П… Привет…
    0x16258, // А. Э, привет. Никаких проблем.
    0x1628D, // Как только к нам присоединяется Ханако, его отношение меняется на совершенно противоположное. Его внезапное ложное радушие немного тревожит.
    0x16392, // А, точно. Женщины. Теперь кажется, что, возможно, это было не такой уж хорошей идеей.
    0x16429, // Мы с Ханако нехотя опускаемся с противоположной от Кендзи стороны плаката, заметив несколько небольших баночек краски на полу вокруг него.
    0x16529, // Класс 3-2… киоск с лапшой?
    0x16557, // На воскресном фестивале вы будете продавать лапшу?
    0x165B5, // Да, будет несколько киосков. Или вроде того.
    0x16605, // «Вроде того»? Его уклончивая манера вызывает у меня серьёзные подозрения. Но дело прежде всего.
    0x166B4, // Так как ты хочешь разделить работу? Мы делаем края, а ты – текст? Или хочешь поменяться и делать края?
    0x1676C, // Текст – мой. Делайте края.
    0x1679C, // Оказывается, он серьёзно к этому относится.
    0x167EC, // Я тянусь за кистью и замечаю, что Ханако уже решает, какой выбрать цвет.
    0x1686E, // К моменту, когда я притрагиваюсь кистью к материи, она уже начинает работать над сложным узором. Похоже, моя идея отвлечь её от окружающих сработала.
    0x1697E, // Мы втроём молча принимаемся наносить тёмно-синие штрихи.
    0x169E7, // Правда, сперва Кендзи наклоняется ко мне и заговорщически шепчет, пользуясь тем, что Ханако увлеклась работой.
    0x16AB2, // Ладно, чувак, зачем ты здесь?
    0x16AE6, // Ханако попросила помочь найти Лилли, вот и всё.
    0x16B3C, // Видно, что мой ответ восторга у него не вызывает.
    0x16B95, // Я понял. Похоже, я тебя недооценил.
    0x16BD4, // Ты внедряешься, да? Работаешь под прикрытием?
    0x16C27, // Следовало бы догадаться. Не сказать всей правды, возможно, будет лучше, чем откровенно лгать или злить его.
    0x16CEA, // Ты здесь именно за этим?
    0x16D16, // Ясное дело. Отстой, конечно, но нет лучшего способа получить разведданные, чем пойти в разведку самому.
    0x16DD2, // Нам надо держаться вместе, чувак. Это суровая школа, суровый мир.
    0x16E48, // Да, очень суровый.
    0x16E69, // Он не улавливает скрытого смысла в моих словах и откидывается назад, удовлетворённый моим полным согласием. Лучше приняться за работу.
    0x16F61, // Готово.
    0x16F6F, // У меня вроде тоже. Хорошая работа.
    0x16FAD, // Мы соединяем линии своих узоров; я пытался скопировать её узор как можно точнее.
    0x17040, // Я, кряхтя, поднимаюсь с пола и оглядываюсь.
    0x1708E, // Кроме нас с Ханако, в классе только Кендзи, заканчивающий надпись, а также Лилли и пара учеников, болтающих между собой.
    0x17168, // Это неудивительно, ведь, судя по часам, время уже позднее.
    0x171D1, // Тебе помочь?
    0x171E8, // Я протягиваю руку Ханако, и она поднимается, ухватившись за неё.
    0x1725D, // Я не могу удержаться от взгляда на её запястье; если шрамы простираются даже досюда, то насколько велик обожжённый участок её тела?
    0x1734D, // Но я всё же чувствую укол вины, когда она прикрывает запястье другой рукой.
    0x173D6, // Неплохо выглядит, правда?
    0x17405, // Она заметно удивляется, но потом понимает, что я говорю о плакате.
    0x1747D, // Да… Наверное.
    0x17497, // Её улыбка свидетельствует о том, что она горда результатом, как и я.
    0x17512, // Поскольку украшения сейчас убраны на парты и полки, пол стал гораздо свободнее и добраться до Лилли в противоположном конце класса оказывается легче.
    0x17626, // Мы закончили плакат. Видимо, это всё, что было нужно?
    0x17685, // Лилли признательно кивает.
    0x176B7, // Спасибо, Хисао, Ханако. Как я могу вас отблагодарить?..
    0x17719, // Не стоит. Всё лучше, чем корпеть в комнате над учебниками.
    0x17782, // Мне тоже было несложно.
    0x177AD, // Лилли кивает и вдруг вспоминает кое о ком ещё.
    0x17801, // Ой, а Кендзи ещё здесь?
    0x1782A, // Как только я открываю рот, Кендзи подаёт голос с другого конца комнаты.
    0x178AC, // Да, как раз закончил.
    0x178D2, // Он осторожно кладёт плакат на свободную полку, чтобы тот высох, и быстро проходит мимо нас за дверь.
    0x17988, // Увидимся, чувак.
    0x179A6, // Пока.
    0x179B0, // Последние два ученика прощаются с Лилли, прежде чем тоже уйти, и мы остаёмся втроём.
    0x17A49, // Ну, похоже, все ушли.
    0x17A6E, // Надеюсь, нам не придётся делать что-то подобное снова.
    0x17AD1, // Работать после уроков?
    0x17AFB, // Именно. Планы класса в этом году были амбициозны. Может, даже чересчур.
    0x17B7C, // Но киоски красивые.
    0x17BA0, // Она права. Видно, что на них потратили много усилий.
    0x17BFE, // Вот как? Уверена, многие из наших ребят были бы рады это услышать. В любом случае теперь до фестиваля осталось не так много работы.
    0x17CEB, // Эм-м… время близится к ночи. Может, пойдём?
    0x17D39, // Хорошая идея. Ты тоже возвращаешься в общежитие, Хисао?
    0x17D9E, // Да, прогуляюсь, пожалуй, с вами.
    0x17DD7, // Ночью в свете фонарей сквер выглядит абсолютно по-другому. По сравнению с обычным видом буйной зелени, сейчас вокруг намного спокойнее.
    0x17ED0, // Тут роль играет и отсутствие людей, учитывая поздний час. Можно увидеть разве что одного-двух учеников, направляющихся в общежития или из них, спешащих по максимуму использовать оставшееся до отбоя время, и всё.
    0x18052, // Слышны только наши шаги и лёгкое постукивание трости Лилли по земле.
    0x180D0, // Хорошо наконец немного расслабиться после сумасшедшей суеты в школе.
    0x18150, // Не успев спохватиться, я тихонько зеваю.
    0x1819A, // Устал?
    0x181A6, // Да. Наверное, ещё не привык к круговороту событий.
    0x18201, // Но та… э… ситуация… с Сидзунэ застала меня врасплох.
    0x18264, // Я стискиваю зубы, невольно напомнив об их публичной перебранке. К слову, хотелось бы выяснить, что же, чёрт возьми, за всем этим кроется.
    0x1835B, // А… насчёт этого…
    0x1837C, // Прости, что тебе пришлось стать невольным свидетелем нашей ссоры. Мы с Сидзунэ… у нас это давно.
    0x1842C, // Её голос становится немного раздражённым, когда она вспоминает про Сидзунэ. Дальше эту тему, я думаю, она обсуждать не захочет.
    0x18514, // Я смотрю на Ханако с целью узнать, что она об этом думает, но по выражению её лица трудно что-либо понять.
    0x185D2, // В любом случае, думаю, извинения Лилли дорогого стоят, даже если моё любопытство остаётся неутолённым.
    0x1868E, // Как бы то ни было, я буду рада, когда фестиваль закончится.
    0x186F8, // Смена темы быстро разряжает атмосферу.
    0x18740, // Представляю. Фестивали в моей старой школе были куда скромнее, чем этот.
    0x187C4, // «Ямаку» делает упор на идею школьного сообщества, поэтому персонал любит устраивать фестивали и подобные мероприятия.
    0x1889F, // А вся работа ложится на учеников. Мир несправедлив.
    0x188FD, // Ханако и Лилли, смеясь, соглашаются, радуясь тому, что никто из работников школы сейчас не слышит наших жалоб.
    0x189C5, // Думаю, в «Ямаку» мне помогло то, что я перевелась сюда из пансиона для девочек. Здесь, по сравнению с ним, гораздо спокойнее.
    0x18AA6, // Это во многом объясняет её благовоспитанные речь и поведение.
    0x18B18, // Когда мы подходим к общежитиям, приходит время расходиться по комнатам.
    0x18B9C, // Увидимся, Лилли, Ханако.
    0x18BC8, // Обе вежливо кивают, прежде чем отправиться в сторону женского общежития, расположенного рядом с мужским.
    0x18C89, // Как и следовало ожидать от местного уклада, неподалёку ходит охранник, готовый пресечь любые ночные безобразия.
    0x18D57, // Проходя мимо него, я быстро потягиваюсь и потираю шею, побаливающую после долгой работы на полу, а затем иду в свою комнату.
    0x18E38, // Хорошо всё же, когда есть цель. После долгого времени, проведённого в больнице, жизнь в мире каждодневной учёбы, домашних заданий и учителей кажется практически благословением.
    0x18F7C, // Думаю, если так будет продолжаться, я проведу время в «Ямаку» не так плохо, как думал.
    0x19017, // Ханако резко кивает и торопливо уходит.
    0x19060, // О чём мы там говорили? Ах да, мы очень упорно трудимся, чтобы устроить фестиваль.
    0x190F2, // И мимоходом сводите остальных с ума.
    0x19135, // Ну, удачи вам.
    0x1914E, // Я встаю и выхожу прежде, чем кто-нибудь из них успевает продолжить ругать меня за безделье.
    0x191F4, // В коридорах, как и ожидалось, сейчас тихо. Все, должно быть, на собраниях своих кружков или готовятся к фестивалю. Или всё сразу.
    0x192DC, // Слова Сидзунэ о том, что я лентяй, эхом отдаются у меня в голове.
    0x19350, // Я чувствую себя немного виноватым за то, что не помогаю, но, похоже, мне не хватает решимости сделать что-то определённое.
    0x1942D, // Делать что-то для фестиваля уже поздно, не считая помощи Сидзунэ и Мише (а её я, разумеется, не считаю). А кружки… Я не знаю.
    0x1950B, // Наверное, я не отношусь к тому типу людей, что станут вступать в кружок.
    0x1958D, // Перед общежитиями, на полпути от здания школы, я замечаю чей-то силуэт.
    0x1960E, // Это Рин.
    0x1961D, // Похоже, она снова работает над фреской.
    0x19665, // Я подхожу к ней, но она, кажется, этого не замечает.
    0x196C1, // Она сидит на перевёрнутой коробке, пристально глядя на стену, на которой рисует зажатой между пальцами ноги кистью.
    0x19795, // Со вчерашнего дня работа над фреской значительно продвинулась, но сейчас готова, на мой взгляд, ещё только половина.
    0x1986A, // Появилось больше цветов, число переплетённых человеческих фигур возросло.
    0x198F4, // Надо сказать, её техника довольно оригинальна и притягивает взор. Не то чтобы я особо разбирался в искусстве, но всё равно выглядит здорово.
    0x199F4, // Я прочищаю горло, чтобы привлечь её внимание, но не испугать, так, чтобы не нарушить её концентрацию.
    0x19AAB, // Подожди.
    0x19ABB, // Она даже не оборачивается, чтобы посмотреть, кто это.
    0x19B1C, // Я подожду.
    0x19B2F, // Через пятнадцать минут я решаю, что её концентрация, несомненно, не нарушилась и что я прождал достаточно, чтобы быть в праве постучать её аккуратно по плечу, напомнив о своём присутствии.
    0x19C86, // Рин механически поворачивает ко мне голову, уставившись в итоге в область моей промежности.
    0x19D2F, // О, это Хисао.
    0x19D46, // Узнала? Я бы чувствовал себя куда менее неловко, если бы она смотрела мне в лицо.
    0x19DD8, // Верно подметила. Вся в работе, как погляжу.
    0x19E26, // Беседа начинается так, будто я не стою тут уже четверть часа, но это ерунда. По крайней мере, она начинается.
    0x19EEA, // Выглядит здорово.
    0x19F0B, // Это действительно так; слои краски скрывают другие слои, смешение и формы человеческих фигур создают впечатляющее зрелище. Но Рин выглядит обиженной.
    0x1A01F, // Нельзя комментировать незавершённые работы. Семь лет невезения.
    0x1A096, // Звучит жутко. Думаю, тогда я возьму слова назад.
    0x1A0ED, // Но всё же выглядит здорово. Не ждут ли меня четырнадцать лет невезения за такие мысли?
    0x1A18A, // Рин отворачивается к картине и стучит по ней большим пальцем ноги.
    0x1A204, // Можешь намешать вот такой цвет? Он кончается.
    0x1A257, // Она опускает глаза на полупустую чашку с остатками такого же розового цвета.
    0x1A2E4, // Я как-то не планировал оставаться и помогать ей с проектом, однако… Честно говоря, я вообще не планировал делать что-либо.
    0x1A3C3, // Я смотрю на Рин, а она пустым взглядом – на меня.
    0x1A41B, // Только эту, один раз.
    0x1A441, // Рин берёт другую кисть и смачивает её в другом оттенке бледно-красного. Вокруг неё стоит дюжина одинаковых чаш. Судя по этой обстановке, она сидит здесь уже несколько часов.
    0x1A57D, // Интересно, так ли это. Если так, то, значит, она пропустила все уроки, чего вполне можно ожидать от кого-то вроде Рин.
    0x1A64F, // Я наливаю немного белого и красного в чашку, пытаясь подобрать цвет на стене.
    0x1A6DC, // Похоже, получается не совсем то, что надо.
    0x1A728, // Очень неудобно, что она сразу не намешала достаточно краски. Найти теперь точный оттенок будет невозможно, но я могу хотя бы попытаться.
    0x1A821, // Кстати, о тяжёлой работе. Разве это не огромная нагрузка и для тебя тоже? Картина такая большая, и вообще.
    0x1A8E0, // О, я не настолько старая и утомлённая жизнью, чтобы так думать.
    0x1A952, // Полагаю, что и правда – не настолько.
    0x1A996, // Правильно полагаешь.
    0x1A9BD, // Но ноги болят. Они как свинцовые. Как будто из свинца, сделанного из свинок.
    0x1AA46, // Из-за положения?
    0x1AA64, // Да, я больше люблю этим заниматься в горизонтальном положении, если ты понимаешь, о чём я.
    0x1AB07, // Но с этим ничего не поделаешь. Я не могу попросить стену лечь.
    0x1AB77, // Сказав это, она немного потягивается, изгибая ноги и спину так, как обычный человек не согнулся бы. Поразительно, как она управляется со своим телом.
    0x1AC86, // Мышцы на её лице чуть дёргаются, видимо намекая на боль, которую она испытывает, когда потягивает икры.
    0x1AD42, // У Рин, должно быть, выносливость и ловкость находятся на куда более высоком уровне, чем у обычного человека, но, работая над фреской, она совершенно себя изматывает.
    0x1AE6E, // Зачем так напрягаться? Сделай хотя бы перерыв. Если плохо, продолжишь завтра.
    0x1AEFB, // Это приводит её в замешательство.
    0x1AF39, // И притом долгое, как будто она ненадолго впала в ступор.
    0x1AF9F, // Думаю, не стоит мне этого делать, Хисао.
    0x1AFE7, // И я не напрягаюсь.
    0x1B008, // А очень похоже на то.
    0x1B02E, // Нет. Это не связано ни с напряжением, ни с расслаблением, ни с чем-то вроде того.
    0x1B0BE, // Дело в этом мальчике.
    0x1B0E5, // Мальчике?
    0x1B0F7, // Да.
    0x1B0FD, // Каком?
    0x1B109, // Из кружка рисования.
    0x1B12F, // Э… и?
    0x1B139, // Он слепой.
    0x1B14C, // О. А как рисовать, если ты слепой?
    0x1B188, // Понятия не имею.
    0x1B1A6, // Тогда почему он там?
    0x1B1CB, // В том и дело. Он там.
    0x1B1EF, // Надо бы ей говорить больше одного слова зараз, чтобы больше было похоже на беседу, чем на допрос.
    0x1B29F, // Он не может заниматься чем-либо, что бы ты назвал искусством, так? Но он всё равно туда ходит. И рисует.
    0x1B358, // Почему?
    0x1B366, // Я не знаю. Почему?
    0x1B386, // Я не знаю. Потому и спрашиваю.
    0x1B3BC, // И?
    0x1B3C0, // Он редко рисует, но, как мне кажется, картины у него очень интересные.
    0x1B43E, // Не сомневаюсь.
    0x1B459, // Я однажды попробовала. Рисовать с закрытыми глазами.
    0x1B4BA, // Было не очень интересно. И пол отмывала целую вечность. Больше не пробовала.
    0x1B545, // Но вот скульптуры у него выходят всё лучше.
    0x1B594, // Понятно.
    0x1B5A4, // Может, она пыталась высказать этим какую-то мысль. Или просто забыла, что у неё таковая была.
    0x1B64C, // Похоже, кружок рисования полон интересных людей.
    0x1B6A6, // Не особо.
    0x1B6B7, // Она делает довольно откровенное заявление, притом не замечая моего сарказма.
    0x1B745, // Нет?
    0x1B74D, // Как я и сказала. Они не особо интересные. Обычно меня не сильно интересуют неинтересные люди.
    0x1B7F7, // Может быть, тебя интересуют?
    0x1B82B, // Может быть.
    0x1B840, // Но тот мальчик – интересный.
    0x1B875, // Может быть, я похожа на него, а может быть, ты похож. Может, все похожи.
    0x1B8F3, // Делают вещи, которые не могут делать, просто потому, что могут.
    0x1B965, // Думаю, это очень глубокомысленно, и я так ей и говорю.
    0x1B9C6, // Ты глубоко мыслишь.
    0x1B9EA, // Нет. Я поверхностная и неразумная. Люди мне постоянно об этом твердят.
    0x1BA6A, // Ты знал, что я одновременно могу думать только о четырёх вещах?
    0x1BADD, // Нет, но теперь знаю.
    0x1BB01, // Сейчас я думаю о женском туалете на втором этаже, мороженом со вкусом мороженого, среднем пальце ноги и стрижке.
    0x1BBCE, // Мне скоро надо стричься.
    0x1BBFB, // Она энергично трясёт головой, размахивая своими короткими растрёпанными волосами. Ей, видимо, нравится это делать.
    0x1BCCE, // Мы молчим, пока Рин топчется, перекладывая кисточки. Мне в голову приходит мысль о вступлении в кружок рисования и ненадолго там задерживается.
    0x1BDD5, // Я чувствую, будто ступаю на совершенно неизученную территорию искусства. Встреча с Рин создаёт ощущение, будто я пытаюсь начать курить, или вроде того. Наверное, надо перестать с ней разговаривать.
    0x1BF3E, // Не то чтобы она мне не нравилась, несмотря на замешательство, в которое приводит её натура, и не то чтобы я не любил искусство – я даже когда-то рисовал для забавы, – просто у меня нет ни творческого запала, ни технических навыков.
    0x1C0E0, // Так что обычно, когда я собираюсь порисовать, у меня случается синдром чистого листа и я просто застываю на месте.
    0x1C1B0, // Или же я изображаю что-то бесформенное, тут же расстраиваюсь из-за своей неспособности перенести картинку в голове на бумагу и бросаю всё, даже не пытаясь приложить какие-либо усилия.
    0x1C2FF, // У Рин такой проблемы точно нет… но она смущает меня другим. Быть с ней – это как смотреть в зеркало, которое ничего не отражает.
    0x1C3E8, // Невольно задумываешься о разумности такого действия.
    0x1C44B, // Рин садится на свою коробку, покачиваясь из стороны в сторону, – видимо, неловкое молчание её совсем не смущает. Она опять на меня смотрит или, может быть, за моё плечо. Я не могу точно определить, на чём сфокусированы её глаза.
    0x1C5E6, // Я подумываю её покинуть, чтобы она смогла продолжить, не отвлекаясь, а я – в одиночку делать то, что собирался. Дел у меня, конечно, неотложных нет…
    0x1C6F2, // Вот блин.
    0x1C703, // Где?
    0x1C70B, // Нигде, просто я забыл сказать Ханако, что Лилли её искала.
    0x1C774, // Знаешь её? Из моего класса.
    0x1C7A5, // А, она… Таинственная девушка из туалета.
    0x1C7F0, // Она забавная. Три недели назад я видела, как она пять раз ходила в туалет на одной перемене. Уверена, это был мировой рекорд.
    0x1C8D1, // Это было очень загадочно.
    0x1C900, // Поэтому ты зовёшь её Таинственной девушкой из туалета?
    0x1C965, // А какая ещё тут может быть причина? Ну, если и есть, то это вечная тайна. Туда я за ней не ходила.
    0x1CA11, // Может быть, это было ещё неделей раньше? Возможно.
    0x1CA6C, // Когда я смотрю на неё, то хочу есть.
    0x1CAAC, // Не говори такого.
    0x1CACC, // Хотя бы не при ней.
    0x1CAEE, // Рин поворачивается и смотрит на меня без выражения, будто не понимая, за что я её упрекнул.
    0x1CB93, // До неё так и не доходит, и я сдаюсь.
    0x1CBD2, // Ты, значит, собираешься обедать?
    0x1CC0D, // Нет. Ещё нет.
    0x1CC24, // Рин переводит голодный взгляд на стену, выглядя чуть более энергичной или по крайней мере чуть менее рассеянной, чем прежде.
    0x1CD08, // Будто стена – это противник, которого ей надо побороть; что-то, что нужно одолеть, прежде чем позволить себе поесть.
    0x1CDDB, // Такое у меня создаётся впечатление. Меня охватывает непонятное сочувствие, и я слабо улыбаюсь.
    0x1CE89, // Несмотря на всю свою странность, Рин классная.
    0x1CEDE, // Ну, а я пойду.
    0x1CEF6, // Веселись.
    0x1CF08, // Рин уже взяла кисть и обмакнула её в краску, так что, наверное, меня она не слышит. А если и слышит, всё равно не отвечает.
    0x1CFE2, // Зачем вы и меня втягиваете? Думаю, я сделал более чем достаточно.
    0x1D058, // Если вы злитесь на Лилли, ко мне это никакого отношения не имеет.
    0x1D0CE, // Подожди-ка… ты намекаешь, что президент имеет право ругать меня, но не тебя?
    0x1D159, // Вот чёрт, надо было аккуратнее подбирать слова.
    0x1D1B0, // Я не знаю, но… В смысле…
    0x1D1DD, // Что ты хочешь сказать, Хиттян?
    0x1D214, // Просто я думаю, что вряд ли честно так говорить, учитывая, что вы сами видели, как я вам помогал.
    0x1D2C1, // Атмосфера меняется. Теперь это похоже на дуэль. Ну, и раньше было похоже, только теперь Сидзунэ сосредоточилась на мне.
    0x1D39A, // И Лилли тоже, хоть она и не подаёт виду. Боюсь, я нечаянно её рассердил.
    0x1D41A, // Хочешь сказать, я не права?
    0x1D44B, // Опасная ситуация.
    0x1D46C, // Ещё слишком рано, чтобы с тобой спорить. …Да, я думаю, что несправедливо с твоей стороны на меня наезжать.
    0x1D52C, // Хиттян, ты слишком многого хочешь~! Но~! Ты дело говоришь. Ладно, ладно, ладно~! Ты не лентяй, Хиттян.
    0x1D5DE, // Ха-ха-ха~!
    0x1D5EF, // Сидзунэ большим пальцем поправляет очки, словно выказывая одобрение.
    0x1D66F, // Это хорошо! Если ты не бесполезен, нельзя кому-либо позволять говорить о себе такое~! Но в следующий раз, когда я скажу это, это будет значить, что ты действительно меня расстроил, как вот госпожа Староста, так что не вздумай расслабляться!
    0x1D820, // Лилли молча сносит эту колкость, на её лице застывает ухмылка.
    0x1D892, // Староста~! Ситтян говорит: «Не забудь, пожалуйста, отчёт~!»
    0x1D8FC, // Не забуду.
    0x1D90F, // Это всё?
    0x1D91E, // Угу~!
    0x1D927, // Тогда приятного всем дня.
    0x1D956, // Если бы её голос имел форму, он бы рассёк воздух, как меч.
    0x1D9BD, // Лилли покидает комнату, ясное дело в плохом настроении, но всё же сумев остаться уравновешенной и спокойной, как обычно.
    0x1DA99, // Сидзунэ, ты правда сегодня зашла малость далековато.
    0x1DAFA, // Правда, Ситтян, самую малость~.
    0x1DB32, // Если бы я ожидал, что и здесь Сидзунэ с неохотой признает мою правоту, значит ожидал бы слишком многого. Она молчит.
    0x1DC04, // Ха-ха-ха~! Ситтян думает, что тебе лучше не совать нос.
    0x1DC65, // Хиттян, у нас есть пара неотложных дел перед уроками~! Мы, может быть, опоздаем, так что~! Прикроешь нас?
    0x1DD1F, // Ага.
    0x1DD27, // Потрясно~! Ура~! Отлично~! Спасибо, Хиттян!
    0x1DD72, // Они уходят, несмотря на то что до начала урока остаётся всего десять минут.
    0x1DDFB, // Эй, я новенький, помнишь?
    0x1DE28, // Даже если бы я захотел, то не смог бы многого сделать.
    0x1DE89, // Вот именно, не следует ожидать от переведённого ученика, что он включится во все дела в первую же неделю.
    0x1DF48, // То, что Лилли принимает мою сторону, странным образом меня приободряет, так что я решаю тоже за неё вступиться.
    0x1E012, // Да, ты к нам обоим несправедлива.
    0x1E04E, // Отговорки, отговорки. У госпожи Старосты была куча времени поработать над отчётностью.
    0x1E0EE, // А тебе мы не раз предлагали вступить в Совет, чтобы помочь, только вот ты не захотел посвятить себя будущему успеху фестиваля.
    0x1E1D4, // Да, но, как я уже говорил, я не уверен, что…
    0x1E221, // Нет у меня на это времени; что бы я ни делал, я всё равно окажусь втянут в противостояние с Сидзунэ, а она именно этого и добивается.
    0x1E30F, // Неважно. Забудь.
    0x1E32D, // Не втягивай меня в это! Я свою часть сделал!
    0x1E37C, // Эй, да ладно тебе. Дай нам с Лилли поблажку…
    0x1E3CC, // Раз я решил всерьёз взяться за своё здоровье, то не время прохлаждаться. Начну с самых основ.
    0x1E475, // В эти основы входит поддержание формы и укрепление сердца теми немногими способами, что мне доступны.
    0x1E530, // Может, так я верну себе некое подобие обычной жизни или хотя бы увеличу шанс не упасть в любую минуту замертво.
    0x1E5FA, // Звучит, правда, немного глупо.
    0x1E631, // Но так я хотя бы с чистым сердцем смогу сказать фельдшеру, что забочусь о своём здоровье.
    0x1E6D3, // Не то чтобы я особо увлекался бегом.
    0x1E715, // Но попробовать начать, наверное, стоит.
    0x1E75D, // «Мисс Ибарадзаки!»
    0x1E780, // Она имитирует голос Миши, имитирующей «голос» Сидзунэ, безуспешно пытаясь придать своему звонкому голоску ту же строгость.
    0x1E863, // Руки шире, да?
    0x1E87C, // И не опираться на пятки…
    0x1E8AA, // Я пытаюсь поддерживать тот же темп, что и Эми, но это довольно трудно.
    0x1E928, // Конечно, я не так хорош, как она.
    0x1E962, // Быть может, Эми сможет помочь мне улучшить технику?
    0x1E9C0, // Не знаю, есть ли какие-то специальные методики бега, но у меня всё явно идёт не так.
    0x1EA56, // Рядом с лёгкой и грациозной Эми я чувствую себя неуклюжим.
    0x1EAC1, // Не хочу больше этим заниматься.
    0x1EAFB, // Не уверен в успешности сегодняшнего эксперимента, но всё же неплохо, что я смог чем-то заняться.
    0x1EBAA, // Как Эми правильно заметила, не всё удаётся с первого раза.
    0x1EC14, // «Без труда не выловишь и рыбку из пруда», так ведь?
    0x1EC70, // Меня посещает обнадёживающая мысль, что я в первый раз сам сделал что-то для укрепления своего здоровья.
    0x1ED2F, // И, надеюсь, не в последний.
    0x1ED5F, // Единственное, чего я смог добиться этой пробежкой, – убийственной усталости с самого утра.
    0x1EE06, // Даже стыдно, что я такой немощный.
    0x1EE44, // Вполне возможно, что эти пробежки не более, чем пустая трата времени. Пожалуй, буду укреплять здоровье как-то иначе.
    0x1EF17, // Лилли, скоро начнётся урок, мы потом ещё сможем поговорить. Я передам Ханако, что ты её искала.
    0x1EFC2, // Я затылком чувствую, что Сидзунэ прямо оцепенела. Наверное, её впервые настолько грубо проигнорировали.
    0x1F081, // Спасибо, Хисао. Тогда я пойду.
    0x1F0B7, // Она улыбается мне самой милой улыбкой, что я видел за эту неделю, и разворачивается, чтобы выйти.
    0x1F167, // Как только Лилли выходит за дверь, я вдруг начинаю ощущать сильное нежелание поворачиваться лицом к Сидзунэ.
    0x1F22F, // Я чувствую, как её взгляд впивается мне в спину, и не могу заставить себя посмотреть на неё. Она, должно быть, в ярости. Я жду, что Миша что-нибудь скажет, чтобы смягчить напряжение, но, видимо, ожидаю слишком многого.
    0x1F3B4, // В конце концов я сажусь на своё место, слушая шаги удаляющейся из класса Сидзунэ. Она возвращается только за несколько минут до начала урока.
    0x1F4B6, // Потом иду и сажусь на своё место, не прислушиваясь к концу спора между Лилли и Сидзунэ.
    0x1F554, // Наконец Лилли покидает наш класс, а Сидзунэ с Мишей молча рассаживаются.
    0x1F5D9, // Я чувствую, как взгляд Сидзунэ впивается мне в спину. Она наверняка злится на меня, но я тоже на неё зол.
    0x1F695, // Не понимаю, зачем ей надо было втягивать меня в ссору.
    0x1F6F7, // Я поворачиваюсь к ним спиной.
    0x1F72D, // Может, бездельничает где-нибудь, прямо как Хиттян~! Ва-ха-ха~!
    0x1F79B, // Чёрт, и зачем Сидзунэ постоянно делать такие ремарки?
    0x1F7FD, // Вспомнив ворчание фельдшера, я ставлю будильник пораньше, чтобы успеть на пробежку.
    0x1F897, // Я дал обещание и собираюсь его сдержать. К тому же Эми придётся на меня наябедничать, если я не появлюсь.
    0x1F955, // Но всё не так уж плохо.
    0x1F97E, // Я чувствую себя настолько уставшим, что ставлю будильник на такое позднее время, на какое только могу себе позволить, чтобы не опоздать на первый урок.
    0x1FA92, // Я вспоминаю голос фельдшера, нудящего об утренних пробежках. Компенсирую их, пожалуй, прогулкой завтра после школы.
    0x1FB66, // Эми, небось, в любом случае будет всё равно.
};

#endif // KS_SCRIPT_A1_THURSDAY_RU_TL_INDEX