#ifndef KS_SCRIPT_A1_TUESDAY_RU_TL_INDEX
#define KS_SCRIPT_A1_TUESDAY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int script_a1_tuesday_ru_intl[] = {
    0x0000, // Я просыпаюсь в незнакомой комнате.
    0x0040, // Прошлым вечером я забыл занавесить окно, поэтому светло-серый потолок залит ярким утренним светом.
    0x00F6, // Я?
    0x00FA, // Это ведь моя комната?
    0x0121, // Моя комната…
    0x013A, // Уже третья за этот год комната, которую я должен считать своей.
    0x01AD, // Вокруг расставлены мои вещи, а это значит, что комната действительно моя.
    0x0233, // Мои сумки на полу, мои новые учебники на столе.
    0x0288, // Мои бесчисленные лекарства на тумбочке.
    0x02D2, // С минуту раздумывая, я гляжу на пузырьки, беру один из них, вытряхиваю таблетку, а вторую выдавливаю из упаковки.
    0x039F, // Быстро запивая их глотком воды, я стараюсь не думать о том, как может быть вредна вся эта химия.
    0x044C, // Моя форма висит в шкафу.
    0x0478, // Я вылезаю из-под одеяла и, потянувшись, принимаюсь одеваться.
    0x04E8, // Надевать новую школьную форму – всё равно что примерять чужие вещи.
    0x0565, // Синтетический запах стирального порошка бьёт мне в нос, но ощущать свежесть новой одежды всё же приятно.
    0x0625, // Форма как форма. Не сильно отличается от той, что я носил раньше.
    0x069A, // То же можно сказать и об остальном. Не так уж много отличий от обычной школы.
    0x0725, // Только люди.
    0x073C, // Я вспоминаю свой вчерашний разговор с Кендзи, смешливость Миши и яростную жестикуляцию Сидзунэ.
    0x07ED, // Пока что я познакомился только с тремя учениками. Может быть, они и не совсем обычные, но я уверен, что это скорее исключение.
    0x08D0, // Или, возможно, именно такие люди здесь и являются нормальными?
    0x0942, // Что здесь вообще считается нормальным? Чем люди занимаются?
    0x09B0, // Я не видел, чтобы кто-нибудь слонялся по школе после занятий, так что, наверное, тут есть кружки. Если так, может стоит вступить в какой-нибудь?
    0x0AB2, // На протяжении всего урока этот вопрос не выходит у меня из головы, поэтому, когда мы делимся на группы, я решаюсь задать его Сидзунэ.
    0x0BA3, // В конце концов, она ведь говорила, что я могу спрашивать её обо всём, что меня интересует.
    0x0C45, // …
    0x0C49, // Сидзунэ скрещивает руки на груди и медленно переводит взгляд на Мишу, которая увлечена стиранием ластика на конце карандаша до получения идеально гладкой поверхности.
    0x0D7E, // А-ха-ха~! Извини, извини, Ситтян! Ты что-то хотела?
    0x0DD6, // А… Вот оно что~! Хм… Хороший вопрос, Хиттян.
    0x0E26, // Первое, о чём я подумал, – она не знает ответа, и это плохо. Но, может, я зря готовлюсь к худшему. В любом случае, Миша, пожалуйста, не давай подтверждения моей догадке.
    0x0F52, // Точно! У нас всех поощряют вступать в кружки. Многие так и делают, потому что больше тут всё равно заняться нечем.
    0x1020, // Ещё есть школьные мероприятия вроде фестиваля, который будет через несколько дней. Почти все ученики принимают участие в его подготовке по мере своих сил и возможностей.
    0x1158, // Так что~! Ты перевёлся в очень интересное время… может, и для тебя найдётся занятие~!
    0x11F2, // Я не против.
    0x1208, // А в честь чего фестиваль?
    0x1236, // Миша замирает.
    0x1251, // …Ва-ха-ха-ха~! Я не знаю, Хиттян, дело в том, что это местный праздник, а я нездешняя, поэтому…
    0x12F9, // Миша в растерянности обращается к Сидзунэ, кажется прося её о помощи. Сидзунэ величественно поправляет очки и начинает уверенно и быстро жестикулировать.
    0x1415, // Что? А…
    0x1423, // Да какая разница?
    0x1443, // Набрав воздуха в лёгкие, с несоразмерной торжественностью и громкостью озвучивает она Сидзунэ.
    0x14F3, // Слишком громко; к нам обернулось уже несколько человек.
    0x1559, // Потише нельзя?
    0x1574, // Люди эволюционируют с каждым новым поколением! Вместе с ними неизбежно изменится и смысл фестиваля!
    0x162C, // …!
    0x1631, // Сейчас главное – это вкусная еда и весёлые аттракционы, в которых можно что-нибудь выиграть~! Ха-ха-ха-ха~!
    0x16F2, // Учитель, пристально глянув на нас, громко откашливается, при этом похлопывая длинной деревянной указкой по ладони, словно дубинкой.
    0x17E4, // Вспомнив наконец, где находится, Миша едва сдерживает вскрик и замолкает. Сидзунэ, нисколько не смутившись, только отмахивается.
    0x18D0, // Уже середина урока, и пора бы приступать к работе.
    0x192B, // Точно, Ситтян~!
    0x1946, // Что? Точно~! Хиттян, ты спросил, потому что хочешь вступить в кружок?
    0x19C1, // Может, это лишь игра моего воображения, но мне показалось, что девочки подозрительно переглянулись. Интонация Миши также изменилась… Хотя она и так постоянно меняется.
    0x1AF6, // Да, я подумывал об этом.
    0x1B21, // Миша и Сидзунэ снова переглядываются.
    0x1B67, // Я собираюсь спросить, не хотят ли они чего-то предложить, но тут моё внимание привлекает чья-то тёмная фигура, которую я улавливаю боковым зрением.
    0x1C73, // Краем глаза я замечаю, как девочка с длинными тёмными волосами встаёт из-за парты и беззвучно выскальзывает за дверь.
    0x1D4A, // Не похоже, чтобы она работала в какой-то из групп, и никто, кроме меня, не обращает на неё внимания.
    0x1DFC, // Я поворачиваюсь к учителю, который тоже видел, как она уходила.
    0x1E6F, // Почему он ничего не сказал?
    0x1EA1, // Хиттян? Что-то не так?
    0x1EC8, // Моё замешательство настолько очевидно?
    0x1F11, // Или Миша заметила, как я смотрел на ту девочку?
    0x1F66, // Нет, всё в порядке.
    0x1F88, // Отлично~! Значит, у тебя нет никаких планов на большую перемену?
    0x1FFC, // Вообще-то, я собирался пойти в библиотеку взять пару книжек.
    0x206A, // …Да нет, в принципе.
    0x208F, // Тогда давай поедим вместе?
    0x20C0, // Давай.
    0x20CC, // Ура~! А-ха-ха-ха~! Отлично, Хиттян~! Здорово!
    0x2118, // Оставшаяся часть урока обходится без происшествий. Длинноволосая девочка так и не возвращается.
    0x21CA, // Я не успеваю придумать, куда бы она могла пропасть, когда учитель объявляет, что пора сдавать работы.
    0x2282, // Сидзунэ, похоже, расстроена, что мы едва успели закончить в срок. Я же рад, что мы вообще закончили. Это ведь не соревнование какое-нибудь.
    0x237C, // Ещё как соревнование, Хиттян!
    0x23B2, // Не может быть.
    0x23CC, // Да ну?
    0x23D7, // Ну да.
    0x23E2, // Я давно приметил, что Миша всегда сопровождает жестами не только свои слова, но и реплики окружающих – со стороны это выглядит очень забавно.
    0x24E5, // Очевидно, это для того, чтобы Сидзунэ понимала, что происходит вокруг. Её взгляд постоянно переключается с Мишиных рук на меня и обратно.
    0x25DF, // Я не совсем понимаю, на кого мне нужно смотреть. Разговор идёт через Мишу, но, может быть, я должен обращаться к Сидзунэ? Я привык смотреть на того, чей голос слышу, но…
    0x270E, // Сидзунэ не может меня слышать, но было бы неуважением говорить с ней только через Мишу. Впрочем, разве она не делает так же? Но при этом она смотрит на меня… Это обескураживает, и к этому, видимо, ещё придётся привыкнуть.
    0x289D, // Это не соревнование, потому что соревнования – это борьба за призы. Нет приза – нет и соревнования.
    0x2953, // Глаза Сидзунэ вспыхивают. Она смотрит на меня так, словно я бросил ей вызов. Похоже, для неё это действительно является состязанием.
    0x2A44, // Я никогда раньше не замечал, насколько завораживает тёмная синева её глаз.
    0x2ACD, // Уверен, Хиттян?
    0x2AE9, // Абсолютно.
    0x2AFD, // Ха-ха-ха! Ты не прав, Хиттян. Потому что~! Я не хочу быть самой медленной в классе. Поэтому ставка – уверенность в своих силах, а приз – подтверждение моих способностей.
    0x2C2D, // Ва-ха-ха-ха-ха~!
    0x2C48, // Сидзунэ поправляет очки, всем видом выражая уверенность в своих словах.
    0x2CCC, // Я бы ещё поспорил, но тут звенит колокол. Вскочив, Миша подхватывает портфель и в нетерпении поворачивается ко мне.
    0x2D9E, // Я чуть не забыл, что собирался с ними перекусить.
    0x2DF7, // Где хочешь поесть?
    0x2E19, // …В столовой?
    0x2E31, // Ха-ха-ха~! Так банально… Ладно~! Пошли!
    0x2E76, // Банально? Да, пожалуй…
    0x2EA0, // В прежней школе у меня было своё местечко на открытом воздухе позади здания, где я обычно ел. Отличное место – жаль, что я нашёл его только в конце первого года.
    0x2FC3, // Интересно, есть ли здесь что-то подобное? Должно быть, Миша это и имела в виду.
    0x3050, // Сидзунэ и Миша притаскивают меня в столовую, как ни странно полупустую. Видимо, многие и правда предпочитают есть в классе или на улице. Я видел коробки с ланчами у некоторых одноклассников.
    0x31AB, // После еды Миша возвращается к разговору, который мы начали в классе.
    0x3228, // Итак, Хиттян, ты хотел узнать о кружках и всяком таком, да? Да~?
    0x3298, // Да, Ситтян! Думаю, лучше сначала спросить.
    0x32E4, // Кивнув друг другу, они снова поворачиваются ко мне. Миша выпрямляется, будто собираясь произнести речь.
    0x33A2, // Хиттян, у тебя есть какое-нибудь увлечение?
    0x33F1, // Раньше я играл в футбол, но без особого интереса. И никогда ни за кого не болел.
    0x3480, // В последнее время я стал много читать.
    0x34C6, // Хм… Здесь есть литературный кружок, да, Ситтян? Да! Но~! Кажется, у них нет свободных мест. Извини, Хиттян… Они очень популярны.
    0x35AC, // А, да! Но ближе к делу, Хиттян! Не значит ли это, что у тебя нет других идей?
    0x3631, // В самом деле, нет.
    0x3651, // Хорошо! Отлично~! Это отлично, Хиттян! Замечательно! Ха-ха-ха~! Ва-ха-ха-ха-ха~!
    0x36DB, // Почему это так уж прям замечательно?
    0x371E, // Да неважно.
    0x3733, // Дело в том, Хиттян, что кроме кружков и приближающегося фестиваля здесь есть ещё такая вещь…
    0x37DD, // Школьный совет!
    0x37FA, // Понятно. Не знал, что в этой школе есть ученический совет. Хотя непонятно, зачем они разыграли целый спектакль, чтобы сообщить мне об этом.
    0x38F6, // Они и сами замечают, что перестарались: Сидзунэ немного смущается, а Миша заливается смехом.
    0x399F, // Сидзунэ тут же пытается взять разговор под контроль, если так можно выразиться, – ведь говорит она всё равно через Мишу.
    0x3A7B, // Ха-ха-ха~! Хм? Да, да… Хиттян, может, тебе стоит вступить в Школьный совет? Им могут пригодиться новые люди~ Да! Точно! Тебе точно надо вступить!
    0x3B7C, // Зачем?
    0x3B88, // Ну, например, затем, чтобы каждый день быть вместе, Хиттян~! Мы с Ситтян тоже в Совете.
    0x3C22, // И Ситтян – его президент.
    0x3C51, // Хм…
    0x3C59, // Как я и подозревал, у них свой интерес в этом разговоре.
    0x3CBE, // Словно прочитав мои мысли, Сидзунэ быстро поправляет очки и говорит что-то Мише.
    0x3D51, // Ха-ха-ха~! Конечно, мы не пытаемся убедить тебя вступить только потому, что нам так нужно, и не станем наста—
    0x3E15, // Так, значит, ты признаёшь, что—
    0x3E4E, // А-ха-ха~! Нет! Мы ничего не признаём~! Я имею в виду, Хиттян, что было бы здорово, если бы ты вступил, и мы были бы очень рады.
    0x3F29, // Но дело не только в этом. Вступление в Совет – это проявление здорового интереса к школьным делам.
    0x3FDD, // Да~! Это так, Хиттян. Кроме того, разве ты не хочешь после школы проводить время с нами, Хиттян?
    0x4087, // Не могу определить, говорит она искренне или просто хорошо притворяется. Обе, кажется, пытаются быть со мной как можно милее… Хотя они и так очень милы…
    0x419E, // Ну что ж…
    0x41B0, // Итак, решено! Добро пожаловать в Школьный совет, Хиттян~!
    0x4217, // Что? Нет. Нет!
    0x422F, // У-у-у… Видишь, Ситтян? Я же говорила, что будет не так просто.
    0x429D, // Угу! Конечно, если бы всё прошло легко, было бы даже скучно. А, да~! Ситтян теперь должна мне конфетку!
    0x4353, // Вы что, поспорили? Эй, моя жизнь не игра!
    0x439B, // Похоже, Сидзунэ заинтриговали мои слова; в её глазах вспыхивает огонёк азарта.
    0x442B, // Ва-ха-ха~! А это мысль, Хиттян. Давай сыграем в игру!
    0x4487, // Я не об этом.
    0x449E, // Как насчёт «Богач, бедняк», Хиттян? Если проиграешь – должен будешь вступить в Совет~!
    0x453B, // Нет, однозначно нет.
    0x4560, // У-у~, почему нет?
    0x457D, // Ну, потому что у вас обеих одна и та же цель – затащить меня в Школьный совет, так?
    0x4611, // Ага~!
    0x461A, // А мне это не нужно. Значит, вы можете объединиться и я окажусь в проигрышном положении. Поэтому я не буду играть.
    0x46E6, // Хиттян! Я крайне оскорблена! Ты не доверяешь нам настолько, что думаешь, будто мы способны на нечто столь и-из—во—рот—ли—во-е? Печально слышать от тебя такое…
    0x480B, // Извини?
    0x4819, // Сложно сказать, где заканчиваются слова Сидзунэ и начинаются Мишины мысли.
    0x48A3, // Чтобы загладить свою вину перед девушкой, чьи чувства ты оскорбил, ты определённо должен вступить в Школьный совет!
    0x4977, // Нет!
    0x497F, // Тогда как насчёт партии в бумажный футбол вместо «Богач, бедняк»?
    0x49F7, // Бумажный футбол?
    0x4A16, // Да~! Это игра, в которую играют в Америке~! Ты делаешь бумажный треугольник и пытаешься забить им гол в ворота, которые другой игрок делает из своих пальцев!
    0x4B31, // Разве не круто~? Это настоящий поединок, Хиттян~!
    0x4B89, // …И в него играют школьники в младшей и средней школах, Ситтян? А-ха-ха! Значит, это игра, отличающая мальчиков от мужчин!
    0x4C63, // Скорее мальчиков помладше от мальчиков постарше. В любом случае в неё я тоже играть не буду. Раз вы о ней знаете, значит хорошо в неё играете.
    0x4D63, // Ха-ха-ха~! Да, да~, это так! Как ты догадался, Хиттян?
    0x4DBE, // Сидзунэ мрачно смотрит на Мишу, и это наводит меня на мысль о том, что та не должна была с такой готовностью в этом сознаваться.
    0x4EA5, // Не скажу, что мне нравятся их попытки навязать своё предложение, но мне интересно, чем же здесь занимается Школьный совет.
    0x4F84, // Я не состоял в нём в прежней школе и даже не был знаком с кем-то из его членов. Кроме того, Сидзунэ и Миша мне вроде как нравятся, так что, возможно, это не такая уж плохая идея.
    0x50BF, // Ладно, Хиттян, тогда как насчёт «Риска»? Это такая игра в мировое господство!
    0x514B, // Не знаю такой.
    0x5165, // Она очень интересная, Хиттян. Борьба за власть над миром, армии, войны и всё такое!
    0x51FA, // Сидзунэ, должно быть, хороша в этом деле.
    0x5244, // Если хочешь, можем сыграть после уроков.
    0x528E, // А, да, Ситтян? Можем сыграть просто на интерес, Хиттян. Ситтян давно не играла, поэтому, если захочешь, поиграем безо всяких условий.
    0x537D, // Ну, хорошо…
    0x5393, // Хорошо! Хорошо, хорошо~! Превосходно~! Тогда увидимся после школы в кабинете Школьного совета, Хиттян!
    0x544C, // Стоп, почему там?
    0x546B, // Потому что~! Там набор для игры.
    0x54A4, // Я строю недовольную гримасу, но лишь для вида.
    0x54F8, // В конце концов я соглашаюсь, уяснив для Сидзунэ, что моё согласие не подразумевает ничего, кроме желания сыграть.
    0x55C7, // Ланч заканчивается, и мы возвращаемся в класс.
    0x561C, // После ланча длинноволосая девочка возвращается в класс и молча занимает своё место.
    0x56B7, // Её снова то ли не замечают, то ли игнорируют. Я хочу спросить об этом у Миши, но боюсь показаться чересчур любопытным.
    0x578C, // После занятий Сидзунэ и Миша настигают и окружают меня в вестибюле первого этажа, отрезав пути к отступлению с обоих флангов.
    0x5872, // Я немного уязвлён, хотя и подумывал о побеге. Тем не менее меня настораживает тот факт, что им приходится быть настолько бдительными, – видимо, от них вот так сбежало уже немало народу.
    0x59C2, // Что за конвой? Я чувствую себя неуютно.
    0x5A09, // Словно опасный преступник, сопровождаемый в камеру.
    0x5A69, // Ва-ха-ха-ха! Что не так, Хиттян?
    0x5AA0, // Вот-вот, мы же просто собирались поиграть в «Риск», забыл?
    0x5B09, // Не знаю, Миша, это выглядит зловеще. Я начинаю думать, что, как только мы сядем играть, вы свяжете меня и будете пытать, пока я не стану молить о приёме в Школьный совет.
    0x5C38, // Это, конечно, маловероятно, но всё же… От них как будто всего можно ожидать…
    0x5CC4, // Добраться до места несложно: всего два поворота – и мы уже у кабинета Совета.
    0x5D51, // И это всё? Мы уже на месте? Мне кажется, вы, ребята, перестарались с конвоем.
    0x5DD9, // Неправда, Хиттян. Ситтян говорит, что, когда жизнь человека под угрозой, он может проявить чудеса в плане скорости бега.
    0x5EB3, // «Жизнь под угрозой»?
    0x5ED9, // Миша, не меняясь в лице, что-то радостно жестикулирует Сидзунэ, и та, нацепив маску загадочности, прячет руки за спину, принимая самодовольный вид.
    0x5FE4, // М-м~ Хм-хм-хм~…
    0x5FFE, // Миша начинает весело напевать, притворяясь, что не услышала меня. Прекрати! У тебя, в отличие от Сидзунэ, нет оправданий!
    0x60D9, // Сидзунэ открывает дверь в кабинет Школьного совета – просторную комнату со строгой обстановкой безо всяких излишеств.
    0x61B5, // В центре стоит большой стол, окружённый стульями, а чуть в стороне – стол поменьше, который, как я понимаю, принадлежит Сидзунэ. Ещё несколько парт со стульями стоят вдоль стены, вероятно просто на всякий случай.
    0x6337, // Кроме этой мебели, комнате практически нечем похвастаться. Пара шкафов и полок, набитых старыми школьными документами и папками, – вот, в общем-то, и всё.
    0x644F, // Какое мрачное помещение. Могли бы хоть что-нибудь вроде горшочка с цветами поставить. Но больше всего бросается в глаза то, что мы здесь одни.
    0x6551, // Мы слишком рано?
    0x656F, // Нет~.
    0x6578, // Что значит «нет»? Сегодня, кроме нас, больше никто не придёт?
    0x65E6, // Так точно~.
    0x65FA, // Прежде чем я успеваю спросить, почему так получилось, Сидзунэ очень энергично хлопает в ладоши.
    0x66A9, // Хиттян, давай играть в «Риск»! Ты ведь обещал, правда? Значит, должен сдержать слово~!
    0x6743, // Ха-ха-ха~! Да, да, да~! Хочешь узнать правила? Я расскажу, пока мы тут всё готовим!
    0x67D2, // В это время Сидзунэ достаёт из шкафа нечто, напоминающее настольную игру, и бросает на стол.
    0x687A, // Выглядит игра, пожалуй, довольно интересно.
    0x68CA, // Миша начинает с несвойственной ей медлительностью путано объяснять основные правила, но Сидзунэ, не вытерпев, вмешивается, резким взмахом руки провозглашая начало игры.
    0x6A02, // Агрессивный настрой Сидзунэ передаётся и мне. Я наконец-то проникаюсь духом соперничества, которого не было и в помине, когда я соглашался на участие в игре.
    0x6B21, // Посреди игры, в то время как я пытаюсь продумать защиту от атак сразу на два фронта, Сидзунэ нарушает ход моих мыслей, пытаясь привлечь моё внимание постукиванием пальцами о край стола.
    0x6C73, // Хиттян, Ситтян хочет заметить, что ты слишком долго думаешь над своими ходами.
    0x6D02, // Ещё Ситтян говорит, что оставит тебе Австралию, если ты согласишься вступить в Совет!
    0x6D9E, // Я думал, это просто игра, безо всякого подтекста.
    0x6DF7, // Факт того, что она трясёт этим предложением у меня перед носом, означает, что она догадалась о моём желании выиграть.
    0x6ECC, // И всё равно – нет!
    0x6EED, // Ситтян восхищена твоим боевым духом и обещает быть великодушным диктатором, который пощадит твой народ, если ты согласишься вступить в Совет!
    0x6FF2, // Ха-ха-ха-ха~!
    0x7008, // Ты слишком азартная, Сидзунэ.
    0x703E, // Кажется, она воспринимает это как комплимент.
    0x7092, // Я ожидал, что президент Школьного совета будет более… благожелательным.
    0x7118, // Бла-го-же-ла-тель-ным?
    0x713F, // Похоже, она не знает, что означает это слово или как оно показывается жестами, поэтому берёт лист бумаги и пишет его для Сидзунэ, которая в ответ показывает несколько жестов.
    0x727C, // Миша прижимает указательный палец к виску, словно пытаясь впечатать это слово в свою память.
    0x7326, // Внезапно Сидзунэ разражается потоком жестов. Миша выглядит ошеломлённой той скоростью, с которой Сидзунэ жестикулирует.
    0x7405, // Ах, пожалуйста, помедленнее, Ситтян… Хм, Хиттян~! Ситтян говорит, что ты проиграешь!
    0x749D, // Скажи ей, что я разрушу её империю своим восстанием.
    0x74FC, // А… Хорошо…
    0x7512, // Её глаза сверкают детским озорством.
    0x7556, // Взглянув на настенные часы, я понимаю, что прошло гораздо больше времени, чем я собирался здесь провести.
    0x7616, // А теперь простите, но я хотел зайти в библиотеку. Она ведь ещё открыта?
    0x7696, // Почесав затылок, Сидзунэ что-то жестикулирует Мише.
    0x76F5, // Так сложно определить, открыта ли она, когда часы висят рядом?
    0x7766, // Должна бы, если библиотекарь ещё там.
    0x77AA, // Думаю, ты права, Ситтян.
    0x77D5, // Мы… пришли к мнению, что она открыта. Она на втором этаже, мимо не пройдёшь. Хочешь, мы тебя туда проводим?
    0x7895, // Нет, спасибо. До завтра.
    0x78C0, // Пока-пока!
    0x78D3, // Всего один лестничный пролёт, и я уже сталкиваюсь с проблемами.
    0x7947, // Второй этаж – точная копия третьего.
    0x798B, // Передо мной очередной широкий прямой коридор.
    0x79E0, // И отыскать здесь библиотеку – задача намного более сложная, чем мне казалось вначале.
    0x7A7E, // Помимо пронумерованных классов, здесь ещё множество дверей безо всяких обозначений.
    0x7B1A, // Библиотека за одной из них? Или где-то дальше?
    0x7B6D, // Остановившись на втором, я решаю пойти наугад.
    0x7BC2, // За углом я обнаруживаю незакрытую дверь.
    0x7C0D, // Она приоткрыта совсем чуть-чуть – ровно настолько, чтобы было заметно, что тут не заперто.
    0x7CB2, // Я полагал, что дверь школьной библиотеки должна быть гостеприимно распахнутой, но сейчас меня обнадёживает и этот маленький зазор.
    0x7DA3, // По крайней мере, внутри должен быть кто-то, у кого я могу спросить дорогу, пусть мне и неловко.
    0x7E4D, // Нервничая и готовясь в любой момент отпрянуть, я осторожно толкаю дверь кончиками пальцев.
    0x7EF4, // В этой школе я чувствую себя посторонним. Меня постоянно преследует ощущение, что я здесь чужой, поэтому даже такую простую вещь я боюсь сделать неправильно.
    0x8014, // Скрип двери напоминает кряхтение человека, пробуждающегося от долгого сна, хотя она поддаётся моему толчку неожиданно легко.
    0x80FB, // Чтобы побыстрее увидеть комнату, я заглядываю внутрь, но робкое приветствие замирает у меня на устах.
    0x81B5, // Такого… я не ожидал.
    0x81DB, // Я рассеянно распахиваю дверь настежь. Всё моё внимание приковывает одинокая фигура в центре комнаты.
    0x8295, // Я безмолвно застываю в дверном проёме, уставившись на удивительно красивую девушку.
    0x8330, // Оценив ситуацию, девушка аккуратно ставит чашку с чаем на стол и открывает глаза, не глядя, однако, в мою сторону.
    0x83FE, // Приветствую. Могу я чем-нибудь помочь?
    0x8444, // Она сидит, глядя перед собой, и, кажется, не слова, а лишь движения её губ нарушают покой.
    0x84E4, // Из-за её неподвижности звук мягкого, размеренного голоса звучит будто бы сам по себе.
    0x8580, // Она выглядит как иностранка, но всё же сильно отличается от тех иностранцев, что я встречал раньше. Кроме того, она – самая высокая девушка, которую я когда-либо видел.
    0x86B1, // Прошу прощения за вторжение, я тут немного… потерялся.
    0x8716, // Она слегка медлит с ответом. Все её слова и движения точны и грациозны, словно заранее тщательно отрепетированы.
    0x87E4, // Не желаешь ли присесть?
    0x880F, // …Неожиданно, учитывая то, как я к ней ворвался.
    0x8865, // Эм-м-м… спасибо.
    0x8883, // Я не спеша занимаю место за столом напротив неё. Между нами стоит чашка с чаем.
    0x8912, // Она не следит за мной взглядом, что… вместе с туманной дымкой в её глазах говорит о проблемах со зрением, как у Кендзи.
    0x89EA, // Кстати, говорит она без какого-либо акцента. Вероятно, она наполовину японка.
    0x8A77, // Я удивлён её собранностью и тем спокойствием, что царит в комнате. Даже молчание здесь не вызывает неловкости.
    0x8B41, // Атмосфера совсем иная, нежели в кабинете Школьного совета.
    0x8BAD, // Полагаю, ты перевёлся в «Ямаку» недавно?
    0x8BF7, // А, да. Только вчера.
    0x8C1A, // Я чувствую, как мои неуклюжие слова контрастируют с изяществом её речи. Её благородный сдержанный поклон усугубляет это чувство ещё больше.
    0x8D1B, // Я отвечаю на него, хотя тут же осознаю бессмысленность своего действия.
    0x8D9E, // Меня зовут Лилли Сато. Приятно познакомиться…
    0x8DF4, // Хисао. Хисао Накай.
    0x8E17, // Она кивает и указывает в сторону чашки.
    0x8E5F, // Не желаешь ли чаю?
    0x8E80, // Да, конечно.
    0x8E96, // Как бы обидно мне ни было, я не могу полностью соответствовать галантности её манер.
    0x8F30, // На мою просьбу Лилли спокойно кивает.
    0x8F75, // Не говоря ни слова, она встаёт и заваривает вторую чашку чая, используя припасы, разложенные вдоль полок.
    0x9035, // Раз за разом, наливая, Лилли легко касается чётким и отточенным движением левой руки то чайника, то чашки. Кажется, будто она выполняла эти действия уже десятки раз.
    0x9161, // Я чуть наклоняюсь и, выглядывая из-за её спины, вижу, что она проверяет уровень воды в чашке своим длинным изящным пальчиком.
    0x9244, // Одно дело – видеть людей с различными физическими недостатками на уроках, и совсем другое – наблюдать, как они адаптируются в быту.
    0x9336, // Сидзунэ и Миша без проблем работают сообща, общаясь со мной. Лилли, на мой взгляд, тоже нашла решение для проблем, о которых я даже не задумывался.
    0x943F, // Я чувствую себя слегка виноватым из-за того, что ей приходится всё делать самой… Впрочем, кажется, ей нравится быть радушной хозяйкой, готовя мне напиток.
    0x9559, // Итак…
    0x9565, // Её мягкий голос прерывает моё безмолвное наблюдение.
    0x95C7, // Что именно ты искал? В этот кабинет не так часто заходят после занятий.
    0x9648, // Школьную библиотеку. Сидзунэ и Ми… то есть мои одноклассницы сказали, что она на этом этаже.
    0x96F1, // Кивнув, она заканчивает наливать воду в чашку и, судя по металлическому звону, начинает помешивать в ней ложкой.
    0x97BE, // Я знаю мисс Хакамити – думаю, её знают почти все ученики. Но, раз вы с ней одноклассники, значит ты тоже в классе 3-3, верно?
    0x989A, // Именно. Кабинет естественных наук Муто.
    0x98E3, // Она хихикает и, положив чайную ложку, медленно направляется к столу с чашкой и блюдцем в руках.
    0x9990, // Он такой оригинал, его здесь любят. Полагаю, и тебе он тоже скоро понравится.
    0x9A1B, // Я аккуратно беру чашку и делаю глоток. На самом деле я предпочитаю кофе, но сейчас не лучший момент упоминать об этом.
    0x9AF1, // Тем более что запах довольно приятный. Не думаю, что будет сложно выпить всю чашку до дна.
    0x9B94, // Спасибо, Сато. Очень вкусный чай.
    0x9BD0, // Она с улыбкой отмахивается.
    0x9C03, // Пожалуйста, зови меня Лилли. Не нужно формальностей.
    0x9C63, // Произносит она чрезвычайно благовоспитанным тоном. Что ж, ладно.
    0x9CDA, // Думаю, стоит попробовать задать ей вопрос о ней самой, раз она проявляет такую заботу обо мне.
    0x9D85, // А из какого ты класса? Третий год обучения, да?
    0x9DD9, // Именно. Кабинет 3-2 – на том же этаже, что и ваш. Нас учит Мияги. Это класс для учеников с проблемами со зрением.
    0x9EA0, // Очевидно.{w} Ой, я х-хотел сказать, эм, извини…
    0x9EF2, // Хочется стукнуть себя по лбу за такую промашку. Хотя, судя по выражению её лица, это вовсе её не задело.
    0x9FAD, // Что ты, что ты! Не нужно стараться подбирать из-за меня слова.
    0xA01C, // Да, конечно. Извини, я здесь новенький и постоянно это всем показываю.
    0xA09B, // Твоё окружение полностью изменилось, и мне не в чем винить тебя. Не буду говорить за всех, но многие смирились со своим состоянием.
    0xA189, // Думаю, она входит в их число. Эта беседа смущает меня, и я пытаюсь сменить тему.
    0xA218, // Ты здесь часто пьёшь чай? Место действительно очень хорошее.
    0xA287, // Наверное, для неё эта комната – как мой уголок, где я любил перекусывать, позади здания в старой школе.
    0xA342, // Я часто прихожу сюда во время ланча. Мои обязанности старосты класса не оставляют времени на кружки и прочее, так что мы с подругой используем эту комнату для чаепитий.
    0xA475, // Староста, значит?
    0xA495, // Она и Сидзунэ – полные противоположности. Сидзунэ резкая и энергичная, Лилли же – спокойная и расслабленная, чуть отстранённая.
    0xA581, // Кстати, думаю, от неё можно услышать более непредвзятое мнение о школьных кружках.
    0xA618, // А какие кружки тут вообще есть?
    0xA651, // Хм… У нас наиболее популярны кружки лёгкой атлетики и бейсбола, а также литературный кружок, расположенный возле библиотеки.
    0xA738, // Есть и множество мелких, как, например, кружок рисования и музыкальный кружок.
    0xA7C7, // Перспектива вступления куда-либо сразу после перевода выглядит для меня не слишком привлекательно.
    0xA87F, // Интересно, действует ли здесь то же правило насчёт кружков, что и в моей прежней школе…
    0xA91F, // Членство в кружке обязательно?
    0xA958, // Нет, просто желательно.
    0xA983, // Хорошо. Гора с плеч.
    0xA9A7, // Я и правда расслабился рядом с этой девушкой, раз позволил этой мысли слететь с моего языка. Кажется, это её слегка радует.
    0xAA86, // Мы с Лилли начинаем наконец пить чай, пока он окончательно не остыл.
    0xAB02, // Взглянув Лилли через плечо, я замечаю, что из окна струится оранжевый закатный свет.
    0xAB9C, // Даже здесь время не стоит на месте.
    0xABDC, // Мда, время быстро пролетело.
    0xAC10, // Прости?
    0xAC1E, // Точно. Она слепая. И, конечно же, не может увидеть, что солнце садится.
    0xAC9C, // Кажется, солнце клонится к закату.
    0xACDB, // Похоже, это становится для неё неожиданностью. Видимо, она потеряла счёт времени.
    0xAD70, // Извини, Хисао. Я не хотела тебя так задерживать.
    0xADC7, // Я пытаюсь развеять её беспокойство.
    0xAE09, // Да нет, ничего страшного. Библиотека ведь ещё открыта?
    0xAE6C, // Она замолкает и ненадолго задумывается.
    0xAEB6, // Наверное, мне стоило задать этот вопрос Сидзунэ, когда был шанс. Впрочем, и Лилли наверняка легко может на него ответить.
    0xAF92, // Верно. Она открыта до половины седьмого по будням.
    0xAFEE, // Беглый взгляд на часы подтверждает, что у меня ещё достаточно времени.
    0xB06F, // Хм, в таком случае я пойду. Приятно было поболтать, Лилли.
    0xB0D7, // Сохраняя всё ту же благочестивую позу, она с вежливой улыбкой кивает мне.
    0xB15D, // Взаимно.
    0xB16D, // Кстати… может, мне стоит тебя проводить?
    0xB1B8, // Нет-нет, ты и так очень помогла мне. Думаю, я без труда её отыщу.
    0xB22A, // Ну, если только навык ориентирования на местности меня не подведёт.{w} А такое нередко случается.
    0xB2DA, // Это нисколько меня не затруднит, я как раз собиралась поговорить с библиотекарем. Могу представить тебя ей.
    0xB39F, // Всё лучше и лучше. От такого предложения сложно отказаться.
    0xB40C, // Было бы здорово, раз ты не против. Спасибо.
    0xB459, // Она встаёт и, взяв прислонённую к её портфелю трость, следует за мной.
    0xB4D8, // Её трость гораздо тоньше и длиннее, чем у моего одноклассника. Наверное, потому что она использует её для того, чтобы ориентироваться в пространстве, а не для опоры при ходьбе.
    0xB618, // Направляясь в библиотеку, мы выходим из комнаты и оказываемся в пустом коридоре.
    0xB6AC, // Я иду не торопясь, подстраиваясь под её неспешные шаги.
    0xB711, // Спустя некоторое время мы подходим к двери уютно выглядящего помещения, расположенного посередине этажа, а не в одном из крыльев здания.
    0xB80C, // Дамы вперёд.
    0xB823, // Она признательно улыбается в ответ на этот жест и заходит внутрь.
    0xB89B, // Слева от входа располагается стол библиотекаря, книжные полки ровными рядами стоят по правую руку.
    0xB951, // По сравнению с библиотекой моей прежней школы, эта кажется мне просто огромной. Запах старых книг придаёт этому месту, можно сказать, дух старины.
    0xBA5C, // Читателей в этот час здесь почти нет: все гуляют или отдыхают в общежитии.
    0xBAE3, // Юко, ты здесь?
    0xBAFC, // Она задаёт этот вопрос в пустоту, потому что библиотекаря, кажется, нет на месте, а Лилли этого, конечно, не видит.
    0xBBCA, // Но, к моему удивлению, ответ всё же следует.
    0xBC19, // Из-под стола библиотекаря раздаётся звук удара, а следом за ним тихий стон.
    0xBCA2, // Ай-яй-яй!
    0xBCB2, // Голос принадлежит девушке, которая уже выбралась из-под стола и теперь стоит перед нами, неуклюже потирая затылок.
    0xBD84, // Привет, Лилли. Чем могу помочь?
    0xBDBC, // Она старается, чтобы её голос звучал как ни в чём не бывало.
    0xBE28, // Добрый день. Что произошло? Я слышала какой-то странный звук.
    0xBE97, // Ничего, я всего лишь немного ушиблась.
    0xBEDD, // Видишь ли, я уронила ластик под стол, а пока искала, упал и карандаш, я стала искать и его, а потом ты пришла и позвала меня так неожиданно…
    0xBFD8, // Ты в порядке? Прошу прощения, я не нарочно—
    0xC027, // Всё нормально! Я в полном порядке – не переживай за меня.
    0xC08F, // Это ерунда, со мной и похуже бывало.
    0xC0D0, // Она спешно прерывает извинения Лилли, словно отвергает саму возможность, что шишка на голове может её хоть сколько-нибудь беспокоить.
    0xC1C6, // Да… бывало и похуже, хе-хе-хе…
    0xC1FE, // Она нервно перебирает пальцами, а с лица Лилли никак не сходит встревоженное выражение; затем Юко без видимой причины начинает перекладывать с места на место какие-то бумаги.
    0xC33E, // Юко немного ниже Лилли, на покрытом веснушками носике небрежно сидят очки. Её облик идеально соответствует стереотипам о внешнем виде библиотекаря.
    0xC44F, // Ах да, Лилли, ты получила моё сообщение?
    0xC497, // Сообщение… хм…
    0xC4B5, // А, о том, что прибыли новые зарубежные книги?
    0xC506, // Именно! Именно! Наконец-то их доставили! Невероятно, что так долго, но—
    0xC587, // Внезапно прервав своё ликование, она обращает внимание на меня, отчасти – я почти уверен – чтобы сменить тему разговора, и застывает на месте.
    0xC68C, // Ой, простите, я вас не сразу заметила!
    0xC6D0, // Вы хотели взять книгу? Или вернуть? Извините! Извините!
    0xC734, // Такая резкая смена настроения сбивает меня с толку.
    0xC793, // Он пришёл со мной. Юко, это Хисао, новый ученик. Хисао, это Юко, школьный библиотекарь.
    0xC82E, // Приятно познакомиться.
    0xC859, // Хисао. Верно. Хисао. Я тоже рада познакомиться. Хисао.
    0xC8BA, // Она явно пытается отпечатать моё имя у себя в голове.
    0xC91B, // Юко часто заказывает для меня книги на Брайле.
    0xC970, // Ты не расскажешь Хисао вкратце о библиотеке?
    0xC9C2, // Невинное предложение Лилли повергает библиотекаря в панику.
    0xCA32, // Я… умоляю, Лилли, я не могу. Я не знаю, что именно его интересует. Это слишком большая ответственность.
    0xCAEC, // Я не понимаю, каким образом это может считаться ответственностью, но она выглядит так, будто скорее сгорит на месте, чем покажет мне полки с ранобэ.
    0xCBF9, // Но…
    0xCC01, // А много здесь книг на Брайле?
    0xCC36, // Я пытаюсь спасти ситуацию, спросив первое, что приходит в голову. Отчасти это срабатывает: Юко… не то чтобы приходит в себя, но начинает держаться чуть более расслабленно.
    0xCD6F, // Ну… Думаю, примерно треть или четверть библиотеки «Ямаку» либо на Брайле, либо в аудиоформате.
    0xCE1D, // Резонно, учитывая количество слепых учеников.
    0xCE72, // А как вообще получилось, что библиотека настолько обширная?
    0xCEE0, // М-м-м, ну, мы регулярно получаем новые книги, потому что у школы хорошее финансирование. Наверное, так.
    0xCF99, // На книги тратится больше денег, чем на мою зарплату, а мне их потом ещё приходится по полкам расставлять.
    0xD058, // Книги ужасно тяжёлые, и расставлять их так трудно, что я иногда хочу уволиться.
    0xD0E8, // За этими откровениями следует неловкое молчание.
    0xD143, // М-м, я, пожалуй, пойду осмотрюсь.
    0xD17D, // Думаю, для всех будет лучше, если этот разговор на этом и завершится.
    0xD1FA, // Очень хорошо. А пока, Юко, я хотела бы забрать те книги, если ты не против.
    0xD27E, // Моё первое впечатление оправдалось: библиотека удивительно большая.
    0xD2FD, // Прогуливаясь узкими проходами, я изучаю корешки книг, время от времени вытаскивая какую-нибудь, чтобы прочитать аннотацию и забрать, если книга покажется интересной.
    0xD42E, // Через несколько минут у меня набирается порядочная стопка.
    0xD49B, // Думаю, проблем с выбором у меня здесь не возникнет.
    0xD4F8, // Это место пропитано знакомой мне атмосферой. Несмотря на множество книг с крупным шрифтом и на Брайле, это самая настоящая библиотека.
    0xD5EF, // Кажется, что безмятежность комнаты, в которой мы с Лилли пили чай, перебралась сюда вместе с нами. Или она была здесь всегда?
    0xD6D1, // Благодаря этому ощущению ко мне возвращается прежнее умиротворение.
    0xD750, // Дойдя до конца прохода, я вижу несколько парт, поставленных для занятий. Но любопытство ведёт меня дальше, вперёд, где я обнаруживаю уютный уголок за стеллажами.
    0xD876, // В то время как в остальных частях библиотеки можно изредка встретить читающего или украдкой спящего ученика, эта часть кажется безлюдной.
    0xD974, // Но, оглядевшись по сторонам, я замечаю кое-кого знакомого на одном из пуфов.
    0xD9FE, // Темноволосая девочка из моего класса. Та, что ушла с середины урока.
    0xDA7A, // Она читает книгу. И очень увлечённо, судя по тому, как она уткнулась в неё носом.
    0xDB0B, // Сегодняшним своим поведением она произвела впечатление скорее хулиганки, нежели книжного червя. Её таинственное исчезновение из класса породило у меня в голове кучу вопросов.
    0xDC4F, // Интерес медленно, но верно берёт своё, и я сам не замечаю, как направляюсь в её сторону.
    0xDCED, // Думаю, ничего страшного, если я ей представлюсь. Она же, в конце концов, моя одноклассница.
    0xDD91, // Пройдя к соседнему пуфу, я сажусь и кладу книги рядом.
    0xDDF3, // Девочка вздрагивает и испуганно смотрит на меня из-под чёлки.
    0xDE64, // Впервые я вижу её так близко. Под длинной, густой чёлкой по меньшей мере треть лица, если не половина, покрыта серьёзными шрамами.
    0xDF50, // Я бросаю взгляд на шрамы, неосознанно пытаясь увидеть их сквозь волосы, и случайно встречаюсь с ней глазами.
    0xE016, // Смутившись, я спешу перевести взгляд на её книгу, впрочем сразу сообразив, что так будет только хуже.
    0xE0CE, // Я…
    0xE0D4, // Я… Я…
    0xE0E0, // Я?..
    0xE0E6, // Ядолжнаидтиуменядела!
    0xE110, // Без предупреждения Ханако срывается и бежит к выходу.
    0xE173, // Её действия застают меня врасплох, что даёт ей немалую фору, прежде чем я отправляюсь в погоню.
    0xE220, // Когда я добегаю до стойки библиотекаря, её уже нигде не видно.
    0xE291, // Лилли и Юко беззаботно болтают в сторонке.
    0xE2DF, // Понимая, что ни за что не догоню Ханако, я подхожу к ним.
    0xE344, // Эй, вы не видели… э… не заметили пробегавшую мимо девочку?
    0xE3B0, // М, возможно… как она выглядела?
    0xE3EA, // Длинные тёмные волосы. Немного стеснительная. И у неё были… ну… шрамы… на лице.
    0xE47D, // Уж не о Ханако ли ты говоришь?
    0xE4B3, // Да, именно о ней. Я увидел, как она читала, и хотел поговорить с ней, но, думаю, я её спугнул или что-то вроде того.
    0xE57D, // Ах, боже мой. Юко, с твоего позволения, мне лучше пойти и найти её.
    0xE5F3, // К-конечно. Я просто подожду тут с книгами.
    0xE63F, // Эй, что происходит?
    0xE662, // Извини, но объяснения придётся отложить до следующего раза.
    0xE6D0, // Ладно. Тогда до встречи…
    0xE6FE, // Лилли стремительно хватает свою трость и спешит прочь, оставив меня наедине с Юко.
    0xE795, // Думаю, я никогда не научусь себя здесь вести.
    0xE7E7, // Я сделал что-то неправильно?
    0xE81B, // А что ты сделал?
    0xE838, // Но как же мне тогда вести себя с этими людьми? Держаться как ни в чём не бывало будет лицемерно.
    0xE8E5, // Как будто я пытаюсь не обращать внимания на очевидную проблему.
    0xE95A, // Юко начинает ёрзать, будто хочет что-то сказать, но не решается.
    0xE9CE, // Думаю, это проблема только в том случае, если ты её так воспринимаешь.
    0xEA4D, // Вероятно, она не слишком сдержана. Я лишь слегка улыбаюсь, и она заливается краской.
    0xEAE6, // Ч… Что? Я сказала глупость?
    0xEB18, // Нет-нет, наоборот, это очень мудро. Наверное, ты права: дело скорее во мне.
    0xEB9D, // К этому нечего добавить. Чтобы заполнить тишину, Юко начинает перебирать на столе какие-то бумаги.
    0xEC51, // Я заметил, что люди, у которых водятся бумаги на столе, любят это дело.
    0xECD0, // Ты выбрал какие-нибудь книги? Мне скоро закрываться. То есть библиотека закрывается. Но закрыть её должна я. Надеюсь, это не причинит тебе неудобств?
    0xEDDF, // А, да, я взял несколько книг, но оставил их там, потому что…
    0xEE4A, // …Короче, сейчас принесу.
    0xEE78, // Я возвращаюсь за стопкой книг, оставленной у пуфов, где мы столкнулись с Ханако.
    0xEF0A, // Ух. Ты так много читаешь?
    0xEF37, // Честно говоря, сам удивляюсь. Когда задумываюсь над этим.
    0xEFA0, // Последние несколько месяцев у меня было много свободного времени, и я просто… начал читать, чтобы убить время. Больше я ничего и не мог.
    0xF098, // Ясно.
    0xF0A2, // Больше она не произносит ни слова, молча оформляя выдачу книг.
    0xF114, // Видимо, это тут и зовётся тактом.
    0xF150, // Удерживая стопку книг одной рукой, я нащупываю в кармане ключ от двери.
    0xF1D2, // Внезапно раздавшийся за спиной звук заставляет меня вздрогнуть, и я чуть не роняю и книги, и ключ, который уже почти вставил в замок.
    0xF2C3, // Кто это?
    0xF2D2, // Я поворачиваюсь на голос. Это Кендзи. Похоже, он в хорошем расположении духа, но отсвет очков в темноте придаёт ему зловещий вид.
    0xF3BC, // Всего лишь я.
    0xF3D4, // Он молчит, нервно облизывая губы.
    0xF411, // Какой ещё «я»? Не знаю никаких «я». Снова какой-то новенький?
    0xF47F, // Его речь вдруг становится быстрой и напряжённой.
    0xF4D9, // Да… но мы уже встречались. Вчера.
    0xF516, // Не думаю. Я бы запомнил того, кого видел только вчера. Когда это было? Какой сегодня день?
    0xF5B7, // Я ничего не отвечаю. Он что, так шутит?
    0xF5FC, // Докажи, что мы уже встречались!
    0xF635, // Ты живёшь напротив. Тебя зовут Кендзи.
    0xF67B, // Кендзи отскакивает назад, его глаза наполняются страхом и недоумением.
    0xF6FE, // Откуда ты знаешь моё имя? Чёрт, это может значить только одно из двух: либо мы и правда встречались и я забыл об этом, либо ты шпион.
    0xF7EB, // Он делает паузу.
    0xF809, // Шпион-экстрасенс.
    0xF82A, // Он мечется взглядом по сторонам, пытаясь заглянуть в комнату за моей спиной, хотя у меня сложилось впечатление, что он едва ли видит что-то через свои толстенные очки.
    0xF95A, // Из дружелюбного его настроение менее чем за минуту превратилось в маниакальное.
    0xF9EE, // Я не экстрасенс.
    0xFA0C, // Откуда мне знать? Я не умею читать мысли.
    0xFA56, // Кендзи осуждающе тычет пальцем мне в лицо.
    0xFAA4, // …В отличие от тебя!
    0xFAC8, // Прекрати, чувак. Мы вчера встречались. Да что с тобой? Я живу в этой комнате.
    0xFB51, // Ложь. Если ты считаешь, что сможешь выдать себя за Хисао только потому, что у меня проблемы со зрением, ты глубоко ошибаешься.
    0xFC35, // Ты даже на него не похож. То есть сходство очень, очень отдалённое. Разве что издалека, но кого ты пытаешься обмануть?
    0xFD0A, // Мне хочется схватить его за плечи и встряхнуть. Я раздражённо тру глаза и вздыхаю.
    0xFDA0, // Стой на месте.
    0xFDBA, // Кендзи начинает аккуратно, шаг за шагом, приближаться. Я стою ровно, чтобы не спровоцировать его… Хотя сомневаюсь, что он сможет причинить много вреда.
    0xFECF, // А, стоп, теперь вижу. Блин, это и правда ты.
    0xFF1B, // Тяжело вздохнув ещё раз, а затем и ещё раз, я на всякий случай отхожу назад.
    0xFFA3, // Как жизнь, чувак? Ты неважно выглядишь… кажется. Что-то случилось?
    0x1001C, // Ничего особенного. Просто со мной приключилась дурацкая история. Точнее, даже несколько, не считая этой.
    0x100DB, // Я не могу наладить нормальный контакт с людьми здесь и не могу понять, во мне дело или в них.
    0x10182, // Не знаю, зачем я всё это рассказываю Кендзи. Ведь с ним у нас тоже вроде как не очень ладится.
    0x1022A, // Это печально, чувак. Кстати, прости за то, что назвал тебя шпионом-экстрасенсом и прочее: лучше перебдеть, чем недобдеть.
    0x10305, // Такова наша жестокая реальность.
    0x10342, // Думаю, у Кендзи реальность всё-таки какая-то своя.
    0x1039D, // Понимаешь, так уж устроен мир. В нём нет справедливости. Понимаешь? Но, даже проигрывая, я выигрываю, потому что усвоил урок.
    0x1047E, // …Ты это вообще к чему?
    0x104A7, // Проехали.
    0x104B9, // Он резко отмахивается.
    0x104E3, // Так что стряслось? Почему такой угрюмый? Ты ведь угрюмый?
    0x1054B, // Да ничего. Просто случайно спугнул одну девушку. Она в прямом смысле слова убежала от меня.
    0x105F1, // Думаю, я сам виноват. Просто… не привык к здешним порядкам.
    0x1065D, // Девушку? Симпатичную?
    0x10685, // Симпатичную? Сложный вопрос. У неё красивая фигура и поистине роскошные волосы… но лицо…
    0x1072A, // Тут много милашек. Просто парадоксальное количество… Я считаю, что это один из тёмных секретов нашей школы.
    0x107F0, // Я пытался предупредить, но слушал ли ты…
    0x1083B, // Не припоминаю подобных предупреждений.
    0x10884, // Тёмных секретов?
    0x108A3, // Да, тёмных секретов. Чрезвычайно тёмных. Как чёрная дыра.
    0x1090B, // Ты заметил, что девушек в этой школе пусть ненамного, но явно больше, чем парней? Примерно шестьдесят к сорока.
    0x109D4, // Он отворачивается, устремив взгляд вдаль.
    0x10A21, // Почему так? На первый взгляд всё в порядке, но это же разница в целых двадцать процентов!
    0x10AC2, // Можно было бы подумать, что школа с такой кучей женщин – мечта любого мужчины. Но нет!
    0x10B5E, // То, что я сейчас скажу, сорвёт тебе башню. Ты готов?
    0x10BBA, // Я не знаю, к чему всё это, но решаю, что не слишком много потеряю, если не стану его слушать.
    0x10C5E, // Нет, не готов.
    0x10C77, // Я уже берусь за дверную ручку, но Кендзи продолжает говорить – очевидно, его самого перспектива сноса моей башни волнует мало.
    0x10D5F, // Я считаю, что эта школа – поле битвы. Отсюда начнётся феминистское нашествие.
    0x10DED, // Неравенство численности мужчин и женщин – верный знак того, что они преуспели. Если «холодная» война станет «горячей», у них будет численный перевес.
    0x10F00, // И это лишь очередной бой в бесконечной войне против феминистских сил… Они повсюду. В Японии женщин больше, чем мужчин. Пока отношение не 60 к 40, но, чувак, это только вопрос времени…
    0x11049, // Даже в Америке женщин – большинство. Они набирают мощь. Исторически наращение военных сил всегда было верным знаком надвигающейся войны.
    0x11146, // Япония – это только первый шаг. Наша экономика очень крута, а сама страна, хоть небольшая и изолированная, всё же играет огромную роль в тихоокеанской политике.
    0x1126B, // Идеальная цель. Они коварны… Как и подобает женщинам.
    0x112CE, // Настанет день, когда…
    0x112F7, // Кендзи угрожающе замолкает.
    0x1132B, // Вот почему им нельзя доверять. Они обманут тебя, а потом убьют, так же как убили меня. Тебя ждёт та же участь.
    0x113EF, // Да чёрта с два…
    0x1140C, // Я не могу сдержаться и произношу это вслух.
    0x1145B, // Эй! Какого чёрта это значит?!
    0x1148F, // И это ты меня спрашиваешь?
    0x114BF, // Это лучшее из того, что я могу придумать.
    0x11509, // И что? Ты не должен был так реагировать на мою речь! Это чертовски грубо.
    0x1158C, // Так на чём я остановился? Ах да, великий феминистский заговор.
    0x115FD, // Стой. Прекрати! Я давно уже перестал понимать, о чём ты. Начиная где-то с «феминистского нашествия».
    0x116B2, // Сложно воспринять на слух? Ничего, у меня в комнате есть кое-какие графики. И куклы. Любишь кукол?
    0x11762, // Никаких кукол.
    0x1177D, // Не любишь кукол, ладно. Но против графиков ты ничего не имеешь, да?
    0x117F5, // Он говорит энергично, не дожидаясь моих ответов, при этом внушительно и грозно жестикулируя, точно античный оратор.
    0x118C9, // Какой-то он чудаковатый. А ведь я поначалу принял его за вполне нормального парня.
    0x1195F, // О чём задумался, чувак?
    0x11989, // О том, каково это – быть последним здравомыслящим человеком в безумном мире.
    0x11A16, // Кендзи хмурится, принимая расстроенный вид.
    0x11A67, // Ты про себя, да? Это невозможно, ибо я – тот последний здравомыслящий в безумном мире. Это моя мечта, а ты не можешь так просто украсть у человека мечту.
    0x11B7A, // Какого чёрта? Не может быть двух последних здравомыслящих. Тогда бы нельзя было сказать «последний»… а это как раз самое важное!
    0x11C66, // Должен остаться только один. Как в том иностранном фильме, где должен был остаться лишь один, и один чувак и остался, потому что в этом была вся суть.
    0x11D74, // Я никогда раньше не видел, чтобы человек так самозабвенно, с таким жаром отстаивал какой-то пустяк.
    0x11E29, // Ну ладно, если ты подождёшь, я вынесу графики. Ещё у меня есть список других тёмных и замысловатых заговоров, за которыми стоит эта школа, запутанных, словно…
    0x11F49, // Срочно, закончи метафору. Будь другом.
    0x11F8F, // Всё, я пошёл спать. Время уже очень позднее.
    0x11FDE, // Что-то это не похоже на метафору. Ну и ладно.
    0x1202E, // Ты мне нравишься. Похоже, ты – классный чувак.
    0x12082, // Большинство людей ничего не понимают, когда я пытаюсь открыть им глаза на этот широкомасштабный феминистский заговор. Они отказываются принять истину, и это ужасно.
    0x121B1, // До встречи.
    0x121C6, // Он хлопает меня по спине на прощание, а затем быстро и тихо исчезает за дверью, словно пройдя сквозь неё, как призрак.
    0x1229B, // Я и не пытаюсь переварить всё, что мне наговорил сейчас Кендзи, а просто захожу в свою комнату, скидываю башмаки и падаю на кровать вниз лицом.
    0x1239E, // Проходит немало времени, прежде чем я прихожу в себя и принимаюсь за домашнее задание.
    0x1243C, // Это из-за простыней. В их приятной прохладе хочется просто валяться с закрытыми глазами.
    0x124DE, // Эта школа кажется мне резервацией абсурда. Сокрытая на вершине горы, где обитатели – один причудливей другого.
    0x125AA, // И мне тут совсем не место. Какая ирония: не удаётся вписаться в компанию, состоящую из людей, которые никуда не вписываются.
    0x1268B, // Может быть, я слишком упорно стараюсь?
    0x126D1, // Я говорю это вслух, но легче от этого не становится – слова лишь отражаются эхом от голых стен.
    0x1277E, // Впрочем, всё могло быть и хуже. По крайней мере, это место больше похоже на школу, чем на больницу, замаскированную под школу, как я думал вначале.
    0x12886, // Да и пейзаж красив.
    0x128A9, // Я приоткрываю один глаз, чтобы взглянуть на склянки с лекарствами, стоящие на письменном столе бок о бок с учебниками.
    0x12981, // Может быть, это место даже слишком похоже на обычную школу.
    0x129ED, // Она или издевается надо мной, или пытается спровоцировать.
    0x12A59, // Но мне нечего терять, поэтому следует на самом деле попробовать новую тактику.
    0x12AE9, // Может, если я распределю свои силы и попробую контролировать больше территорий, то смогу получить преимущество?
    0x12BB7, // Сидзунэ сосредоточилась на завоевании целых народов, так что если я пожертвую своими владениями на материке, то смогу завоевать больше маленьких стран.
    0x12CCF, // Стоит попытаться.
    0x12CF0, // Но через несколько ходов я всё равно проигрываю.
    0x12D49, // Сидзунэ поправляет очки и празднует победу, торжествующе взмахнув в воздухе кулачком.
    0x12DE8, // Я победила, я победила~! Ура~!
    0x12E1C, // Спасибо, я и без перевода понял.
    0x12E56, // Ва-ха-ха~! Не расстраивайся так, Хиттян! Ты, как мне кажется, старался изо всех сил!
    0x12EEA, // Однако твоих сил пока недостаточно~! Уж кто-кто, а я в таком разбираюсь! Ты неплохо справлялся, особенно учитывая то, что сегодня играл впервые!
    0x12FEE, // Хиттян, атаковать Исландию и Северную Африку одновременно было смелым ходом. Ситтян впечатлена~!
    0x130A0, // Великие люди – это те, кто отваживаются на смелые ходы и преодолевают все препятствия~! Полпути уже пройдено; разве это не замечательно, Хиттян?
    0x131A7, // Но одного лишь потенциала недостаточно! В нём нет смысла, если ты не осмелишься сделать первый шаг и идти вперёд. Я хотела бы увидеть больше.
    0x132A7, // Ты права, Ситтян~, но ты так требовательна…
    0x132F6, // Сидзунэ подаётся вперёд, и её игривость внезапно сменяется той серьёзностью, которую я от неё ожидал с самого начала.
    0x133CD, // Хиттян, ты хочешь присоединиться к Школьному совету?
    0x1342E, // Не теряет время попусту, да? Но…
    0x13469, // Я в школе только второй день и сомневаюсь, что стоит так скоро делать какой-либо выбор.
    0x13507, // Я ещё даже не взглянул на остальные кружки.
    0x13556, // Хотя я был бы не прочь проводить время с Сидзунэ и Мишей.
    0x135BD, // Мне нужно больше времени, прежде чем я смогу решить наверняка.
    0x1362F, // Возможно. Я сообщу попозже.
    0x13661, // Хорошо, Хиттян~! Но я надеюсь, ты сказал это не для того, чтобы не расстраивать нас.
    0x136F6, // Ни в коем случае.
    0x13715, // Правда~?
    0x13724, // Хиттян, если ты соберёшься сказать это, это должно быть окончательное решение и безо всяких сомнений~!
    0x137DF, // Знаю, знаю. Я по меньшей мере должен взять реванш за сегодняшнее.
    0x13855, // Сидзунэ озорно улыбается, поворачивая нож в ране, которую нанесло мне поражение.
    0x138E9, // Похоже, она хочет спровоцировать меня.
    0x13930, // Окинув взглядом доску, я убеждаюсь, что моя защита весьма неплоха, и я не собираюсь разрушать её необдуманными поступками.
    0x13A10, // Ва-ха-ха-ха~! Хиттян, ты проиграл ещё тогда, когда позволил мне захватить Северную Америку.
    0x13AB4, // В смысле Ситтян, а не мне.
    0x13AE2, // Получать контроль над Северной Америкой очень рискованно, ведь, хоть она и обеспечивает пять дополнительных армий, её можно атаковать с трёх сторон и приходится сосредотачиваться на защите~!
    0x13C41, // Не думала, что ты такой нерешительный. Какое разочарование.
    0x13CAE, // Амбиции, Хиттян. Тебе нужно играть более уверенно! Амбиции, амбиции~!
    0x13D2B, // Игра стала интереснее, когда ты захватил Южную Америку, но, получив небольшое преимущество, ушёл в оборону. Это плохо, Хиттян.
    0x13E10, // Ты недостаточно рисковал, а если и рисковал, то не доводил дело до конца. Это ужасно, Хиттян.
    0x13EB7, // Блин, какое ей дело до того, что я слишком осторожничал? Не обязательно бросать мне это в лицо.
    0x13F62, // Я начала сомневаться, что от тебя будет польза Школьному совету…
    0x13FDA, // Это что, реверсивная психология?
    0x14016, // В таком случае мне не нужно беспокоиться о вступлении?
    0x1407A, // Уже сдаёшься? Я ожидала от тебя большего.
    0x140C5, // Неужели Сидзунэ дразнит меня, пытаясь заманить в Совет?
    0x1412B, // Я не хочу вступать туда сейчас. Ведь я в школе только второй день – в поспешном решении нет смысла.
    0x141DF, // Я ещё даже не взглянул на остальные кружки. Да и эти двое какие-то странные.
    0x14268, // Ладно, может быть я подумаю о вступлении, но сперва взгляну на другие кружки.
    0x142F4, // Правда, Хиттян? Ты сказал это не для того, чтобы не огорчать нас?
    0x14368, // Нет, нет. Просто я ещё сам не решил, хочу ли я этого.
    0x143C4, // Вот оно как…
    0x143DC, // Ладно, Хиттян. Но мы не собираемся сдаваться так просто. Ты сказал «может быть», значит ещё не всё потеряно~!
    0x144A0, // Ну же, это будет весело! Мы сможем ещё поиграть в «Риск», и, возможно, однажды ты сумеешь выиграть! Если мы не закончим школу раньше этого момента.
    0x145A8, // Знаешь, это отнюдь не добавляет мне желания присоединяться к вам.
    0x14620, // Ва-ха-ха~! Уверена, ты неплох в настольных играх! Может, сыграем в игру, с которой ты знаком, чтобы дать тебе небольшую фору?
    0x146FE, // Знаешь, я всё-таки сказал «может быть» лишь для того, чтобы вы не расстроились.
    0x1478D, // У-у-у, это жестоко, Хиттян…
    0x147BE, // Привет! Я новенький, Хисао Накай. Мы с тобой в одном классе.
    0x14829, // Эм… Я только на днях перевёлся. Может, ты не помнишь?
    0x14889, // Девушка по-прежнему не произносит ни звука, лишь испуганно глядит на меня.
    0x14911, // Я пока ещё тут осваиваюсь и пытаюсь со всеми познакомиться.
    0x1497E, // Ну так… как тебя зовут?
    0x149A9, // Х… Ханако…
    0x149BF, // Она говорит запинаясь и так тихо, что её едва слышно даже в безмолвии библиотеки.
    0x14A53, // Думаю, я ошибся, приняв её за хулиганку.
    0x14A9B, // Ханако, значит? А что ты читаешь?
    0x14AD6, // Она показывает мне книжку, при этом робко пряча за ней лицо.
    0x14B43, // Должно быть, она заметила, как я пялился на её шрамы.
    0x14BA2, // «Жизнь Пи»? Никогда о ней не слышал. О чём она?
    0x14BF5, // О мальчике… и о тигре…
    0x14C20, // …на лодке…
    0x14C36, // Видимо, это потребует времени.
    0x14C6E, // Звучит интересно. Нравится?
    0x14CA1, // Она молча кивает из-за книжки.
    0x14CD8, // Девочка выглядит очень напряжённой. Не совсем так, как Юко, она, скорее… оцепеневшая от ужаса, я бы сказал.
    0x14D9A, // Таинственная незнакомка оказалась вовсе не хулиганкой. Сейчас она дрожит, будто боится меня до смерти.
    0x14E57, // Полагаю, единственный выход из этой ситуации – попытаться наладить нормальный разговор.
    0x14EFB, // Это библиотечная книжка? Я ищу, что бы почитать, но тут так много всего…
    0x14F7E, // Н-нет. Моя.
    0x14F91, // А, ясно… Ты часто сюда приходишь?
    0x14FCE, // По лицу Ханако разливается румянец, а глаза невероятно расширяются.
    0x1504B, // Ой-ёй-ёй. Неужели она приняла мои потуги завязать разговор за неумелую попытку приударить за ней?
    0x150FD, // То есть… э… Я не в том смысле, что…
    0x1513E, // Извини, я не хотел тебя напугать.
    0x1517A, // Ни… ничего страшного.
    0x151A3, // По её перепуганному виду не скажешь, что ей не страшно, но я решаю не зацикливаться на этом.
    0x15249, // Так, м-м… ты не против, если я тут присяду?
    0x15295, // Кажется, она пребывает в смятении, но наконец находит в себе силы едва заметно кивнуть.
    0x15334, // Х… хорошо.
    0x15348, // Я сажусь рядом с ней, а она робко прячет лицо за книгой.
    0x153AC, // «Жизнь Пи»… Никогда не слышал о такой.
    0x153F3, // Это, э… опять же, извиняюсь, что напугал. Я Хисао.
    0x1544C, // Она выглядывает из-за книги, медля с ответом.
    0x1549E, // Я… знаю.
    0x154AE, // Мы… мы в одном… одном классе.
    0x154E5, // Х-Ханако. Я… Ханако.
    0x1550A, // Я сдерживаюсь, чтобы не ляпнуть банальщину вроде «какое красивое имя», но это действительно единственное, что приходит мне в голову.
    0x155FD, // Я чувствую себя идиотом. Все тут уже наверняка привыкли к тому, что у каждого есть особенности, а я один напрягаюсь и нервничаю из-за такой ерунды.
    0x15707, // Не буду тебя отвлекать. Я… просто посмотрю книжки, если ты не против.
    0x15785, // Она чуть кивает, вздохнув с облегчением.
    0x157CF, // Я начинаю изучать обложки и оглавления книг, которые взял, а она возвращается к чтению.
    0x1586E, // Наступает неловкое молчание.
    0x158A4, // Я продолжаю украдкой смотреть в её сторону, пытаясь увидеть скрытые под россыпью тёмных волос шрамы.
    0x1595D, // Через какое-то время я понимаю, что она тоже поглядывает на меня, лишь притворяясь погружённой в книгу.
    0x15A19, // Но в её взгляде нет и намёка на любопытство; он мечется, словно испуганный кролик.
    0x15AAE, // Когда наши глаза наконец встречаются, происходит цепная реакция.
    0x15B26, // Она резко вскакивает с пуфа и набирает в грудь воздуха.
    0x15B8B, // Да, думаю, симпатичная.
    0x15BB5, // Так и знал!
    0x15BC9, // Не, не особо.
    0x15BE0, // Ничего! Я просто… говорил с ней. Пытался познакомиться. Хотя даже толком не начал…
    0x15C78, // Юко вздыхает. Похоже, мои слова встревожили её ещё больше.
    0x15CE2, // Думаю, не «неправильно», а скорее «бестактно».
    0x15D37, // «Бестактно»?
    0x15D4F, // Та девочка – особый случай. Она почти ни с кем не разговаривает.
    0x15DC4, // По-моему, это немного… ненормально.
    0x15E06, // Может быть… но уж такая она, и тут ничего не поделаешь, наверное.
    0x15E7C, // Слова Юко звучат не слишком убедительно, но, возможно, здесь подобное в порядке вещей.
    0x15F19, // У каждого тут свои проблемы, иначе они сюда не попали бы.
    0x15F80, // Наверное, я и правда поступил бестактно.
    0x15FCA, // Ничего! Я просто смотрел книги, а она внезапно вскочила и убежала.
    0x16042, // Самое оскорбительное, что я мог сделать, – пару раз посмотреть в её сторону.
    0x160CD, // Ну, она очень робкая девочка.
    0x16102, // Тебе надо быть с ней осторожным. Она может очень сильно нервничать, потому что не привыкла общаться с людьми.
    0x161C9, // Слова Юко звучат не слишком убедительно, но, возможно, тут такое в порядке вещей.
    0x1625C, // Я ещё представлялся классу…
};

#endif // KS_SCRIPT_A1_TUESDAY_RU_TL_INDEX