#ifndef KS_A1_MONDAY_GATEWAY_EFFECT_RU_TL_INDEX
#define KS_A1_MONDAY_GATEWAY_EFFECT_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_1AE3BA25_ru_intl[] = {
    0x0000, // Ворота выглядят слишком помпезно.
    0x003F, // Впрочем, ворота часто производят подобное впечатление, но эти выделяются особенно.
    0x00D8, // Красный кирпич, чёрное кованое железо и серая лепнина составляют совершенно негостеприимную композицию.
    0x019A, // Я задумываюсь, должны ли школьные ворота вызывать подобные эмоции, но не могу прийти ни к чему определённому. Наверное, всё же нет.
    0x0288, // Конечно, я не собираюсь вечно тут стоять и думать о воротах, так что прохожу в них быстрым шагом, что оказывается довольно приятно.
    0x0376, // Двигаться по жизни вперёд вообще приятно.
    0x03C3, // Я направляюсь к главному корпусу интерната «Ямаку», где кто-то должен меня встретить. Один, потому что родители отвозят мои вещи в общежитие.
    0x04C5, // Вокруг всё покрыто пышной зеленью.
    0x0505, // Это мало похоже на обычные школьные клумбы. Скорее напоминает парк с чистыми дорожками, вьющимися между деревьями, запахом свежеподстриженной травы – со всем, что делает парк парком.
    0x0655, // Мне сразу приходят на ум слова «стерильный» и «гигиеничный», и меня передёргивает.
    0x06ED, // Выбрось это из головы. Оставайся непредвзятым. Это твоя новая жизнь – прими её такой, какая она есть.
    0x07A5, // Вот что я говорю себе.
    0x07CD, // За кронами деревьев виднеются очертания нескольких больших зданий. Их слишком много, и они необычайно велики для простой школы.
    0x08B8, // Зрелище открывается непривычное и совсем не соответствующее моим прежним представлениям об учебных заведениях.
    0x0988, // Всё какое-то неестественное. Пусть мне и сказали, что это моя новая школа, но я чувствую себя здесь чужим.
    0x0A47, // Интересно, правдиво это впечатление или оно является результатом моего предубеждения?
    0x0AE7, // Кстати, я до сих пор не встретил ни души. Как-то жутковато.
    0x0B50, // Мне уже хочется увидеть хоть кого-нибудь, лишь бы избавиться от ощущения, что я попал в другое измерение.
    0x0C0F, // Шумящие на ветру деревья и пышная сверкающая зелень вокруг отвлекают моё внимание.
    0x0CA8, // Я снова думаю о больницах, где «операционные покрашены в зелёный цвет, потому что он успокаивает».
    0x0D5C, // Так почему же, несмотря на всю эту зелень, мне так тревожно?
    0x0DC8, // …
    0x0DCC, // Уже дойдя до главного корпуса, я внезапно осознаю причину заминки у ворот.
    0x0E54, // Там у меня был последний шанс повернуть назад, пусть я и не смог бы вернуться к прежней жизни.
    0x0EFE, // Но, когда я вошёл, пути назад не осталось.
    0x0F49, // С этой мыслью, по-прежнему волнуясь, я отворяю парадную дверь.
    0x0FBA, // Когда я вхожу, меня сразу замечает высокий, слегка сутулый мужчина. Неудивительно: кроме нас, в вестибюле никого нет.
    0x108F, // Ты, наверное… Ни… На… Ники?
    0x10C3, // Накай.
    0x10CF, // Да, именно. Отлично. Я твой классный руководитель и учитель естественных наук. Меня зовут Муто.
    0x117C, // Добро пожаловать.
    0x119D, // Мы обмениваемся небрежным рукопожатием, и он смотрит на часы.
    0x120E, // Тебе следует зайти в медкабинет, но сейчас на это нет времени.
    0x127F, // Ага. Наверное, я тогда загляну туда попозже?
    0x12CF, // Да, после обеда было бы замечательно. Сейчас нам нужно представить тебя одноклассникам. Они уже ждут.
    0x1388, // Ждут меня? Я не люблю быть в центре внимания, но, думаю, в подобной ситуации это неизбежно.
    0x142B, // Беспокойство о том, какой мне окажут приём, снова заставляет меня нервничать.
    0x14B9, // В результате я пропускаю мимо ушей практически всё, что говорит мне учитель.
    0x1545, // Когда я поднимаюсь за учителем по лестнице, сердце бешеным стуком в груди напоминает о причине моего появления здесь.
    0x161D, // Третья дверь третьего этажа помечена как класс 3-3.
    0x1679, // Муто открывает её и входит.
    0x16AB, // Всем доброе утро. Извиняюсь, что снова опоздал.
    0x1701, // У самых дверей меня охватывает сомнение.
    0x174C, // Ты хочешь сам представиться классу?
    0x178E, // Зачем?
    0x179A, // Да, конечно.
};

#endif // KS_A1_MONDAY_GATEWAY_EFFECT_RU_TL_INDEX