#ifndef KS_A1_SUNDAY_IS_CARNIVAL_RU_TL_INDEX
#define KS_A1_SUNDAY_IS_CARNIVAL_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_304FE8CE_ru_intl[] = {
    0x0000, // Не знаю… Я голодный, но я заключил сделку, что попытаюсь беречь себя. Ну, быть здоровее, понимаешь?
    0x00B3, // Не знаю, стоит ли мне держаться подальше от такояки или же пойти прямиком к ним.
    0x0144, // Сделку? Звучит зловеще. А что ты получишь взамен?
    0x019D, // Полагаю, что ничего. Это не такого рода сделка.
    0x01F2, // Ты знаешь Эми из параллельного класса? Мы вроде как договорились присматривать друг за другом, и…
    0x02A6, // Йа-и-и-и-и-и-и-и-и!
    0x02C4, // От пронзительного визга и гримасы ужаса на лице Кендзи у меня кровь стынет в жилах. Как будто я сообщил католическому священнику, что продал душу дьяволу.
    0x03DE, // С ней! Ты продал душу дьяволу и не получил ничего взамен?
    0x0445, // Чувак, да что с тобой вообще такое?
    0x0484, // Ты в курсе, с кем имеешь дело?
    0x04B9, // Она – угроза здоровью общества. Знаешь, сколько народу она каждый месяц отправляет в больницу, когда влетает в них на полной скорости?
    0x05AF, // Она – одна из них! Ключевой игрок в этом глобальном заговоре, преследующий цель полностью поставить на колени всё мужественное.
    0x069A, // Ушам своим не верю. Чувак, я доверял твоему здравомыслию. Я думал, мы братья.
    0x0724, // Тебе нужно отменить сделку, пока не поздно.
    0x0773, // И отказаться от похода на фестиваль… это же одна из их ловушек.
    0x07E7, // Это как-то беспокоит, а теперь я и сам начинаю сомневаться.
    0x0852, // Стоит ли мне идти?
    0x0873, // Я достаю книгу, которую собирался почитать.
    0x08C3, // Что-то о подпольной почтовой системе, которая, может, существует, а может, и нет…
    0x0956, // И эта книга короткая. Я могу прочитать её за день.
    0x09B0, // Но хороший ли это способ провести время?
    0x09FA, // Ну, да. Определённо.
    0x0A1E, // Но, полагаю, пойти на улицу окажется идеей получше.
    0x0A7B, // Посмотреть фестиваль.
    0x0AA4, // Попробовать поучаствовать во всех сопутствующих развлечениях.
    0x0B19, // В самом деле, я должен по крайней мере попробовать остаться тем дружелюбным человеком, которым был всю прошедшую неделю.
    0x0BF6, // Можно найти там что-нибудь перекусить, как предлагает мой живот.
    0x0C6C, // Почти время ланча… По крайней мере, я мог бы взять чего-нибудь с одного из тамошних лотков.
    0x0D12, // Вскоре я оказываюсь снаружи, в окружении учеников и людей, которые могут приходиться кому-то из них родителями.
    0x0DDE, // Часто мне попадаются на глаза те, кто, очевидно, просто пришёл из города посмотреть на фестиваль.
    0x0E8F, // Их легко заметить.
    0x0EB1, // Они не могут перестать пялиться, и в их глазах читается: «Интересно, а что не так с {b}этим{/b} парнем?»
    0x0F66, // Хочется накричать на них.
    0x0F95, // С другой стороны, не могу же я отрицать, что всю неделю тем же самым и занимался?
    0x1026, // Меня накрывает волна чего-то, похожего на отвращение, вины за собственную узколобость.
    0x10C5, // …
    0x10C9, // Я отбрасываю мысли в сторону, сосредоточившись на приступах голода, которые полыхают в моём желудке, словно лесной пожар.
    0x11A8, // Запах жареного приводит меня в край обетованный, где я могу поесть.
    0x1223, // Я протягиваю руки, чтобы получить свой заказ, но тут меня останавливает громкий голос.
    0x12C1, // Эй, какого чёрта ты делаешь?
    0x12F4, // Собираюсь завтра… эм, есть ланч.
    0x1330, // Завтракать?
    0x1346, // Ты хочешь сказать, что только что встал?
    0x138F, // Эм-м…
    0x139A, // Внезапно проспать всё утро стало чем-то вроде преступления.
    0x1408, // Нет, я имел в виду ланч… Честно.
    0x1442, // Она не покупается на это.
    0x1470, // Поздний завтрак?
    0x148F, // Как бы то ни было, это определённо не здоровая пища.
    0x14ED, // Она выхватывает еду из моих рук, воззрившись на меня.
    0x154E, // Какого чёрта она творит?
    0x157B, // Эй, это мой завтрак!
    0x159F, // Ты ведь сказал, что это ланч?
    0x15D3, // Это мой… Неважно, это моя еда!
    0x160A, // Эми упирает руки в боки и начинает читать мне нотацию.
    0x166D, // Ты и правда уже забыл свой режим питания?
    0x16B8, // Тебе надо серьёзнее относиться к своему здоровью, Хисао!
    0x1720, // Как же твоё сердце?
    0x1743, // С моим сердцем всё в порядке! Почти.
    0x1784, // В ответ она только закатывает глаза.
    0x17C7, // Я в этом сомневаюсь.
    0x17EC, // Если бы это было так, тебя бы здесь не было, верно?
    0x1846, // В её словах есть смысл, разумеется.
    0x1886, // Но я не собираюсь так просто сдаваться.
    0x18CE, // Для сердца это не так уж и плохо!
    0x1909, // Оно, безусловно, способно справиться с капелькой жира время от времени!
    0x198C, // Вот именно. И небольшие пробежки – тоже не беда.
    0x19E4, // Но не похоже, что Эми убеждена.
    0x1A1C, // Неудивительно, мне и себя-то не удалось этим убедить.
    0x1A7D, // Может быть, но не тогда, когда ты дрыхнешь днями напролёт!
    0x1AE6, // Её лицо принимает вкрадчивое выражение.
    0x1B30, // Разумеется, если бы ты следовал расписанию с самого начала, то не оказался в этом положении…
    0x1BDA, // Эй, у меня была весьма насыщенная неделя, знаешь ли!
    0x1C38, // Например, я едва не умер! И встретился с множеством людей, и ещё я был на крыше…
    0x1CC8, // Это, чтоб ты знал, не является достаточным оправданием.
    0x1D2D, // Краткое свидание со смертью – не повод для пропуска базовых упражнений.
    0x1DB2, // Таких как пробежка по утрам.
    0x1DE6, // Она кивает, словно приняла только что очень важное решение.
    0x1E53, // Значит, решено!
    0x1E6F, // Ты увидел, насколько ошибочен был твой путь, и готов следовать моему расписанию, правда?
    0x1F10, // Я увижу тебя завтра рано утром?
    0x1F49, // Мы будем партнёрами по бегу?
    0x1F7D, // Знаешь, ты меня вчера уже убедила, что так будет лучше.
    0x1FE0, // Незачем убеждать меня заново.
    0x2017, // Хотя моя убеждённость как-то слабо отражается на поступках.
    0x2085, // Она права насчёт здоровой еды, в конце концов. А то, что я здесь заказал, ничуть не здоровое.
    0x212B, // Но вкусное!
    0x2140, // Есть более важные вещи, чем вкусная еда, разве нет?
    0x219C, // Например, оставаться живым?
    0x21CF, // Если бы Эми со своими угрозами за мои неверные решения здесь не было, я бы, наверное…
    0x226A, // Эй, погоди секунду.
    0x228D, // У меня в мозгу внезапно возникает вопрос.
    0x22D9, // Эй, а с какой радости тебя так волнует моё доброе здоровье?
    0x2344, // Эми пожимает плечами и ухмыляется.
    0x2384, // Ты ведь новичок.
    0x23A2, // Я так понимаю, у тебя нет друзей, верно?
    0x23E9, // К тому же я доставляла тебе проблемы всю неделю, верно?
    0x244D, // Я должна тебе за то, что ты не разозлился.
    0x2498, // Тем более я это фельдшеру обещала.
    0x24D7, // А-га. Чокнутая маленькая девчушка-попрыгушка хочет вернуть моё здоровье.
    0x255D, // Наверное, бывает участь и похуже.
    0x259A, // Ладно, это звучит… Неплохо.
    0x25CD, // Спасибо за участие.
    0x25F1, // Значит, завтра утром?
    0x2618, // Подумав, что беседа завершена, я поворачиваюсь, чтобы уйти.
    0x2684, // Не так быстро!
    0x269E, // Эй, не так грубо!
    0x26BC, // Что тебе ещё нужно?
    0x26DF, // Эми, кажется, вот-вот обидится на мой раздражённый вопрос.
    0x2749, // Думала, тебе захочется провести время в компании.
    0x27A4, // Она глядит на меня с подозрением.
    0x27E1, // Кроме того, ты ведь просто собирался украдкой прикупить ещё той жареной гадости, разве нет?
    0x2888, // Я не собирался, но теперь, когда Эми об этом упомянула, идея кажется не такой уж и плохой.
    0x2929, // Ничего подобного!
    0x294A, // Ещё один пристальный взгляд.
    0x297F, // Ладно, может быть, немножко…
    0x29B4, // Она всё глядит на меня в упор.
    0x29EA, // Ладно, много.
    0x2A02, // О боже, я опасен для себя и окружающих, да?
    0x2A4E, // Сначала соглашаюсь, что надо выздоравливать, и тут же покупаюсь на соблазн первой попавшейся нездоровой привычки.
    0x2B20, // Я так и знала! Тебе нельзя доверять!
    0x2B61, // Теперь мне точно придётся пойти с тобой.
    0x2BAB, // Сама эта ситуация кажется глупой.
    0x2BE9, // Могу только представить, что думают прохожие, когда видят меня, выслушивающего наставления от девушки ростом вдвое ниже меня.
    0x2CD0, // Наверное, мне лучше пока сдаться.
    0x2D0D, // Отлично, делай что хочешь.
    0x2D3D, // Я вздыхаю.
    0x2D50, // Попробую найти в этом положительную сторону.
    0x2DA3, // Чем тебе хочется заняться?
    0x2DD4, // Эми ненадолго задумывается.
    0x2E08, // Ну, я обещала Рин взглянуть на её фреску…
    0x2E54, // Так что давай отправимся к ней!
    0x2E8D, // Признаюсь, мне самому слегка любопытно, что у неё в итоге получилось, и я снова отмечаю, что судьба моя могла быть куда менее приятной.
    0x2F81, // Я согласно киваю и вдруг обнаруживаю, что Эми практически волоком тащит меня сквозь толпу, устремляясь к нашей цели.
    0x3056, // Ко времени прибытия к стенам общежития я чувствую, что моё сердце колотится очень сильно.
    0x30FA, // Оно не должно так стучать после всего лишь маленькой пробежки.
    0x316D, // Я делаю несколько глубоких вдохов, заставляя себя расслабиться.
    0x31E3, // По сравнению со многими учениками «Ямаку», я выгляжу вполне здоровым, но я всё равно должен находиться здесь.
    0x32AB, // Иногда мне прямо хочется, чтобы я лишился руки или что-то в этом роде.
    0x3329, // По крайней мере, тогда будет очевидно, почему я тут.
    0x3387, // Но я, напротив, даже не кажусь больным.
    0x33CD, // Даже сейчас, когда пытаюсь отдышаться, я просто похож на парня в плохой физической форме.
    0x3470, // Эми оглядывается и замечает моё бедственное положение.
    0x34D6, // Надеюсь, ты не собираешься умереть тут при мне?
    0x352C, // Пожалуйста, не надо!
    0x3551, // Это будет моей ошибкой, и я совсем не хочу заполучить такое чувство вины.
    0x35D6, // И вообще, мне хватило прошлого раза и я не думаю, что желаю снова это видеть, особенно если фельдшер скажет, что виновата во всём была я.
    0x36CC, // Н… не, я в порядке.
    0x36EE, // Пожалуй, мне всё же придётся начать бегать.
    0x373D, // А ты ещё хотел продолжить есть то сочащееся жиром… что бы это ни было.
    0x37BD, // Вот видишь? Хорошо, что я тебя нашла, правда?
    0x380D, // Да, так и есть.
    0x3827, // Может быть.
    0x383C, // Конечно, я не скажу ей, что не оказался бы в таком виде, если бы она не проволокла меня через весь фестиваль.
    0x38FF, // Дальнейшее общение прерывается внезапным появлением Рин.
    0x396A, // А, это вы.
    0x397B, // Привет, Эми.
    0x3991, // Здорово, Рин! Я взяла Хисао с собой, потому что он пытался вызвать у себя новый инфаркт!
    0x3A2F, // Неправда!
    0x3A41, // Моё возражение проходит незамеченным.
    0x3A88, // Мы зашли поглядеть, что вышло из фрески!
    0x3AD1, // Рин деловито кивает.
    0x3AF7, // Что ж, она прямо тут.
    0x3B1C, // Её довольно неплохо отсюда видно.
    0x3B5A, // Мне любопытно, как долго Рин уже стоит перед своей фреской.
    0x3BC6, // Кто-нибудь вообще приходил на неё посмотреть?
    0x3C1A, // Или мы первые?
    0x3C34, // Очевидно, что мы не первые её увидели.
    0x3C79, // В смысле, она довольно-таки большая.
    0x3CBB, // Нужно постараться, чтобы её не заметить.
    0x3D05, // И в то же время я не думаю, что кто-нибудь заговаривал о ней с Рин.
    0x3D7B, // Кроме нас, конечно.
    0x3D9E, // Я чувствую, что обязан что-то сказать.
    0x3DE3, // Выглядит здорово.
    0x3E04, // Я всё равно не очень довольна тем, какой она получилась.
    0x3E6A, // Но, думаю, сойдёт.
    0x3E8A, // Она, похоже, чуть ли не убеждает себя.
    0x3ECE, // Я точно не уверен, какого результата она ждала, но, полагаю, она не вполне его добилась.
    0x3F6C, // Мы стоим перед фреской и разглядываем её от края до края.
    0x3FD4, // Я старательно сосредотачиваюсь на композиции картины.
    0x4039, // Она и в самом деле любопытная.
    0x4070, // Цвета переплетаются и смешиваются, вовлекая меня в свой хоровод.
    0x40E7, // Картина настолько фантастическая, что я уже не вполне уверен, в том ли ещё мире я нахожусь.
    0x418C, // Я пытаюсь обнаружить следы красок, которые мы с Эми достали.
    0x41FA, // Но, как ни стараюсь, нигде не вижу следов прусской лазури.
    0x4263, // Ну и ладно.
    0x4277, // Уверен, она где-то тут.
    0x42A0, // У меня начинают ныть ноги, но Рин, похоже, не собирается двигаться с места.
    0x4327, // Эми решается заговорить.
    0x4355, // Эй, Рин, а ты ела?
    0x4373, // Конечно. Иначе не выживешь.
    0x43A5, // А как насчёт последних пяти часов?
    0x43E4, // Может быть. Но я снова голодна, поэтому, возможно, я ошибаюсь.
    0x4453, // Эми улыбается и хлопает в ладоши.
    0x4490, // Отлично! Пойдём с нами, перекусишь!
    0x44D0, // Рин молча кивает.
    0x44F0, // Хорошо, но нам нужно спешить, пока они не заметили, что я ушла.
    0x4560, // Я почему-то думаю, что им всё равно.
    0x45A0, // Кем бы «они» ни были.
    0x45C6, // Когда мы возвращаемся к прилавкам с едой, я жадным взглядом окидываю выставленную там жареную пищу.
    0x467D, // Нет, лучше не надо.
    0x469F, // Я совершенно уверен, что Эми всё равно мне не позволит.
    0x4703, // Мы находим отличное местечко на газоне и присаживаемся, чтобы расправиться со своими покупками.
    0x47B4, // Ну, вернее, моими покупками. Как-то так вышло, что я заплатил за всю еду.
    0x4835, // Удивительно, но моя (нежареная) еда вполне вкусная.
    0x4892, // Тишина окутывает нашу компанию – мы с Эми едим, а Рин глядит на… куда-то глядит, в общем, время от времени откусывая кусочек-другой.
    0x4982, // Я первым доедаю свою порцию и ложусь на траву.
    0x49D6, // Эми отрывается от еды и переводит на меня взгляд.
    0x4A30, // Устал, Хисао?
    0x4A48, // Наверное, немножко.
    0x4A6C, // Ну, не проспи завтра, постарайся.
    0x4AA8, // Мы утром начинаем бегать, помнишь?
    0x4AE7, // Вообще-то, я как раз забыл.
    0x4B17, // Я сейчас просто наслаждаюсь спокойным отдыхом.
    0x4B6E, // Гулять с ними по фестивалю оказалось весело.
    0x4BC0, // Да, я поставлю будильник.
    0x4BEE, // Попробуй только не прийти!
    0x4C1F, // Я рассержусь, если ты не придёшь!
    0x4C5B, // Боже упаси.
    0x4C70, // Думаю, Бог тут ни при чём.
    0x4C9E, // Если только не случится что-нибудь невероятное и твой будильник закоротит.
    0x4D28, // Тогда это может оказаться божественным провидением.
    0x4D89, // Значит, не надо навлекать на себя никаких провидений.
    0x4DEB, // В моей голове начинает формироваться план.
    0x4E3A, // План, на который моя совесть отзывается уколом вины, но я всё равно собираюсь привести его в исполнение.
    0x4EF8, // Чёрт побери, я заслужил немного жареной пищи.
    0x4F4B, // И вообще, я начинаю бегать только завтра, так?
    0x4F9E, // Значит, расписание заработает тогда, а не сегодня.
    0x4FFA, // Следовательно диета тоже начинается завтра, следовательно сегодня мне можно позволить себе что-нибудь нездоровое.
    0x50CE, // Своего рода последнее «прощай» всему тому, что я жадно ел до больницы.
    0x514E, // Кстати, думаю, мне стоит вернуться в свою комнату.
    0x51A9, // Надо доделать домашку, а раз я завтра собираюсь бегать, то мне надо лечь пораньше…
    0x5240, // Снова эти прищуренные глаза.
    0x5275, // Ты уверен, что не собираешься улизнуть и купить себе всякой жареной гадости?
    0x5301, // Не, я слишком сытый для этого.
    0x5337, // В подтверждение своих слов я похлопываю себя по животу.
    0x539D, // И к тому же вы всё равно меня обчистили.
    0x53E5, // Эми хихикает. Неожиданно приятный звук.
    0x542E, // Чувствую ещё один укол вины.
    0x5462, // Она же должна понимать, что я ей вру, разве нет?
    0x54B7, // Или она настолько мне верит?
    0x54EB, // Я чувствую себя чуть ли не чудовищем.
    0x552F, // Всё часть моего генерального плана, Хисао.
    0x557D, // Ну, тогда увидимся завтра утром.
    0x55B8, // Спасибо за угощение! И за компанию!
    0x55F8, // А я-то думал, это она оказывает мне услугу.
    0x5645, // Рин утвердительно кивает.
    0x5675, // Я не скажу «увидимся завтра», потому что это будет звучать как предсказание будущего, а я уверена, что на такое не способна.
    0x5756, // …
    0x575A, // Ладно.
    0x5766, // Ладно, пока.
    0x577C, // Странно, но я рад, что решился выйти сегодня из комнаты.
    0x57E1, // Не самый плохой способ начать вторую неделю пребывания здесь, это уж точно.
    0x586B, // Убедившись, что скрылся с глаз Эми, я сразу же бегу к прилавкам с едой и покупаю пирожные.
    0x590D, // По крайней мере, они не жареные, верно?
    0x5953, // Это чуть лучше, чем я изначально планировал.
    0x59A4, // Правда, мне всё равно неловко, что я соврал Эми.
    0x59FA, // Её ведь действительно беспокоит моё здоровье.
    0x5A4F, // Я должен как-нибудь ей отплатить.
    0x5A8C, // Вернусь-ка я лучше к себе.
    0x5ABB, // К тому же у меня {b}есть{/b} важное дело.
    0x5AFF, // Меня дожидается книга, и я плюхаюсь на постель, принимаясь читать её под вспышки фейерверков.
    0x5BAA, // Наконец начинает сказываться вся эта сегодняшняя ходьба (или, точнее, беготня).
    0x5C3B, // Я и правда не в форме.
    0x5C62, // Наверное, всё-таки неплохо, что Эми принудила меня начать бегать с ней по утрам.
    0x5CF3, // Я буду ждать этих пробежек.
};

#endif // KS_A1_SUNDAY_IS_CARNIVAL_RU_TL_INDEX