#ifndef KS_A1C8O2_RU_TL_INDEX
#define KS_A1C8O2_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1EB01_ru_intl[] = {
    0x0000, // Эй, я новенький, помнишь?
    0x002D, // Даже если бы я захотел, то не смог бы многого сделать.
    0x008E, // Вот именно, не следует ожидать от переведённого ученика, что он включится во все дела в первую же неделю.
    0x014D, // То, что Лилли принимает мою сторону, странным образом меня приободряет, так что я решаю тоже за неё вступиться.
    0x0217, // Да, ты к нам обоим несправедлива.
    0x0253, // …
    0x0257, // Отговорки, отговорки. У госпожи Старосты была куча времени поработать над отчётностью.
    0x02F7, // А тебе мы не раз предлагали вступить в Совет, чтобы помочь, только вот ты не захотел посвятить себя будущему успеху фестиваля.
    0x03DD, // Да, но, как я уже говорил, я не уверен, что…
    0x042A, // Нет у меня на это времени; что бы я ни делал, я всё равно окажусь втянут в противостояние с Сидзунэ, а она именно этого и добивается.
    0x0518, // Неважно. Забудь.
};

#endif // KS_A1C8O2_RU_TL_INDEX