#ifndef KS_STRANGER_LILLY_AND_HANAKO_RU_TL_INDEX
#define KS_STRANGER_LILLY_AND_HANAKO_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_7814BB8B_ru_intl[] = {
    0x0000, // Не знаю. Я голодный, так что подумывал раздобыть еды и сходить на аттракционы.
    0x008E, // У твоего класса вроде крутой проект, и я тоже помогал, так что хочу посмотреть хотя бы его, и ещё поболтать с Лилли, наверное.
    0x0170, // Кстати, у тебя разве нет обязательств, связанных с проектом?
    0x01DE, // Ты с ума сошёл?
    0x01F9, // От этой слепой бабы ничего хорошего ждать не следует, печёнкой чую, чувак. Её присутствие – словно мрачная тень на пути моего великого взора.
    0x02FB, // Чего и можно ожидать от слепых.
    0x0334, // Чё?
    0x033A, // Кроме того, я думал, что ты тоже…
    0x0376, // Он поднимает руку, прерывая меня.
    0x03B3, // Нет, у меня просто проблемы со зрением.
    0x03FA, // Метафорически же я вижу дальше, чем кто бы то ни было до меня.
    0x0469, // В подтверждение своих слов Кендзи устремляет взор в мнимую даль, выставив вперёд подбородок, чтобы выглядеть более мужественно. Вообще-то всего в паре метров находится стена коридора, но это не меняет сути.
    0x05E3, // Я вижу будущее человечества, которое будет мрачным, если не подавить угрозу женщин.
    0x067C, // Они повсюду.
};

#endif // KS_STRANGER_LILLY_AND_HANAKO_RU_TL_INDEX