#ifndef KS_A1_WEDNESDAY_DETOUR_AHEAD_RU_TL_INDEX
#define KS_A1_WEDNESDAY_DETOUR_AHEAD_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_8009F0BA_ru_intl[] = {
    0x0000, // Наблюдая за её походкой, я отмечаю, что она делает очень быстрые, тяжёлые и уверенные шаги.
    0x00A5, // Возможно, такая походка была бы уместна, если бы мы пробирались сквозь снежную бурю, но на улице стоит ясный безветренный день. В любом случае я чувствую себя абсолютно выдохшимся лишь глядя на неё.
    0x020E, // Вероятно, именно благодаря такому безумному темпу мы добираемся до чайного дома за время, которое Миша называет «рекордным». Мне слегка досадно оттого, что перед моим взглядом не предстаёт здание феодальной эпохи с татами на полу и женщинами в кимоно, разливающими чай.
    0x03FC, // Чайный дом оказывается самым обычным кафе. Впрочем, это не так уж и плохо – выглядит довольно уютно.
    0x04B3, // Как только мы оказываемся внутри, к нам немедленно подбегает девушка, будто поджидавшая нас всё это время.
    0x0576, // Добро пожаловать! Спасибо, что выбрали наше заведение!
    0x05DA, // Она кланяется резким движением, будто рубит топором дрова.
    0x0646, // Я с удивлением узнаю в ней Юко, нашего библиотекаря.
    0x06A5, // Привет. Я не знал, что ты работаешь и здесь.
    0x06F3, // А… Да, работаю. Официанткой… Уже год, шесть месяцев и две недели… Спасибо, что выбрали именно наше заведение. Я могу вам чем-нибудь помочь?
    0x07F1, // Привет, Ю-тян~!
    0x080B, // Приветствую.
    0x0823, // Миша, вы обе тоже с ней знакомы?
    0x085C, // Конечно, Хиттян~! Ю-тян у нас в библиотеке работает, в конце концов~! Я редко хожу туда, но Ситтян её знает! И~! Мы часто приходим сюда, поэтому получается, что постоянно с ней видимся!
    0x09A3, // Эм… Да… Я принесу вам всё, что вы обычно заказываете. И… если ещё что-нибудь понадобится, пожалуйста, просто позовите меня.
    0x0A85, // Тебе не обязательно говорить с нами в таком формальном тоне. Мы ведь все знакомы.
    0x0B19, // К тому же народу в кафе совсем мало, она могла бы чувствовать себя и посвободнее.
    0x0BAC, // Я надеялся, что мои слова помогут ей расслабиться, но они оказывают обратный эффект.
    0x0C46, // Нет… Я же официантка, это моя работа, поэтому я должна… выполнять её как подобает.
    0x0CDD, // …
    0x0CE1, // Ладно, ладно~! Ситтян не возражает! Ю-тян, принеси, пожалуйста, Ситтян то же, что и всегда, а мне – зелёный чай с молоком и мёдом.
    0x0DC6, // Не переживай так.
    0x0DE6, // Эм, да… но… это же моя работа, и… всегда есть из-за чего переживать. Извините, я не должна спорить с клиентом… Извините! Извините!
    0x0ED3, // Юко снова начинает стремительно кланяться. Я сдаюсь и присоединяюсь к Сидзунэ и Мише за их столиком.
    0x0F8B, // Когда я располагаюсь в кресле, ко мне подходит Юко, выглядящая ещё более расстроенной, чем во время предыдущего разговора.
    0x106B, // Извините! Мне правда очень, очень жаль! Я забыла принять ваш заказ… Я… невнимательна к посетителям, так нельзя… Простите меня… Если я могу как-то загладить свою вину, пожалуйста, только скажите…
    0x11D2, // …
    0x11D6, // Всё в порядке, Ю-тян, просто Хиттян ещё ничего не заказал. Ты ни в чём не провинилась, незачем так расстраиваться.
    0x12A3, // Действительно, пора бы и мне сделать заказ. Но я не знаю, что здесь подают, и меню нигде не видно.
    0x1351, // Миша права. Мне, пожалуйста, кофе и… сэндвич, если у вас есть. Самый вкусный, на твой выбор, раз уж Сидзунэ за меня платит.
    0x142C, // Сидзунэ одаряет меня взглядом, в котором смешиваются удивление, негодование и шок. Она явно не может решить, на чём ей остановиться.
    0x151D, // …
    0x1521, // Хиттян, вот у тебя в бумажнике сколько денег? Ведь что-то точно есть, да? Нам надо разделить сумму заказа на троих, чтобы было честно~! Да, и на другое я не согласна~!
    0x1648, // Миша поворачивается к Юко.
    0x1679, // Ю-тян, Ситтян говорит, что хочет три порции самого дорогого блюда из меню~
    0x16FF, // Нет!
    0x1707, // Ха-ха-ха~! Мы шутим, Хиттян…
    0x1739, // Эм… хорошо… Думаю, сэндвич с индейкой здесь самый вкусный… К тому же к нему подаётся бесплатный суп… Хотя хороший работник должен был бы порекомендовать блюдо, которого у нас в избытке, ну… или самое дорогое блюдо…
    0x18C7, // У меня плохо получается?
    0x18F4, // Вовсе нет! Звучит отлично, я беру. И кофе, пожалуйста.
    0x1954, // Хорошо.
    0x1962, // Через несколько минут она приносит напитки и сэндвич. Сидзунэ обходится одним только чаем, а Миша заказала ещё и парфе. Не представляю, почему именно его: сложно придумать более неподходящий десерт к чаю.
    0x1AD7, // Ну да ладно. Я кусаю сэндвич. Он на удивление сочный и вкусный.
    0x1B48, // …
    0x1B4C, // Хиттян, ты уже подумал о вступлении в Школьный совет?
    0x1BAD, // Хм?
    0x1BB3, // …
    0x1BB7, // Хиттян, не говори с набитым ртом…
    0x1BF5, // Я запиваю еду глотком кофе, который тоже весьма неплох. Но сейчас не время хвалить это заведение.
    0x1CA6, // Вы же сами признали, что мне ещё рано принимать такое серьёзное решение! И было это всего три часа назад!
    0x1D64, // …
    0x1D68, // Мужчина должен быть решительным, Хиттян!
    0x1DB3, // …
    0x1DB7, // Тебе правда стоит вступить, Хиттян. Давай же, будет весело!
    0x1E22, // «Будет весело», как правило, говорят о том, что на самом деле ни капли не весело.
    0x1EB3, // …
    0x1EB7, // Ты что, мне не веришь, Хиттян?
    0x1EEC, // Кто из них это сказал? Такое серьёзное давление в словах Миши – и такая невинная улыбка на лице. Похоже на раздвоение личности.
    0x1FD4, // Эм-м…
    0x1FDF, // …
    0x1FE3, // Это обидно, Хиттян. Мы ведь просто хотим проводить с тобой время…
    0x205B, // …
    0x205F, // Вот именно, Ситтян! И это тоже!
    0x2096, // …
    0x209A, // Все оказываются в плюсе, решаются все наши проблемы~
    0x20FA, // …
    0x20FE, // Я тоже думала, что Хиттян это хоть немножко оценит… Обидно!
    0x216B, // Моего мнения опять никто не спрашивает.
    0x21B4, // Эй, прекратите разговаривать так, будто меня тут нет.
    0x2215, // Сидзунэ поправляет очки и смеётся про себя.
    0x2265, // …
    0x2269, // У-у, но ведь правда же, Хиттян~! Ты бы нас очень выручил, в этом году у нас совсем мало людей.
    0x230D, // Насколько мало?
    0x232A, // О, а это секрет, Хиттян.
    0x2354, // Нет, я хочу знать. Насколько мало ваше «мало»?
    0x23A7, // А-ха-ха…
    0x23B7, // Пятеро?
    0x23C5, // …
    0x23C9, // Меньше?
    0x23D7, // Ну-у…
    0x23E2, // Ноль?
    0x23EC, // …
    0x23F0, // Ва-ха-ха~! Хиттян, неважно сколько. Важно, что мало, и поэтому мы были бы рады твоей помощи. Особенно когда фестиваль на носу, да и вообще год нас ждёт очень занятой.
    0x2517, // То есть ты не хочешь отвечать?
    0x254E, // …
    0x2552, // Нет~
    0x255A, // Я вздыхаю и выпрямляю спину, пытаясь придать себе деловой вид. Это кажется серьёзным решением, и мне не хочется вот так запросто сдаваться. Хотя чувствую я себя глупо, словно надутая рыба-ёж.
    0x26B5, // Ладно, тогда скажите хотя бы, сколько человек в Школьном совете? Всего?
    0x2736, // …
    0x273A, // Эм, ну, Хиттян, нас достаточно, чтобы выполнять необходимую работу, но явно меньше, чем хотелось бы. Да-да-да~!
    0x27FF, // Только не говори мне, что вас там всего двое.
    0x2850, // Ха-ха-ха~! Забавно, Хиттян~!
    0x2880, // …
    0x2884, // Но~! В нём точно не только мы одни.
    0x28C1, // Вы уверены? Абсолютно уверены?
    0x28F9, // Угу~!
    0x2902, // Я всматриваюсь в их лица, рассчитывая на то, что они чем-нибудь выдадут себя, подтверждая мои худшие опасения.
    0x29CA, // Миша хмурится. Ей явно не по себе, но это, скорее всего, связано с тем, что я столь пристально на неё уставился.
    0x2A91, // Сидзунэ, напротив, отвечает мне одним из своих фирменных взглядов. Может быть, она бросает мне вызов, вот так уставившись на меня поверх очков. Её взгляд так и дразнит меня; он на удивление детский, словно она маленькая девочка, которая пытается втянуть кого-то в свою игру.
    0x2C81, // …
    0x2C85, // Хиттян, две прелестные представительницы Школьного совета оказывают тебе радушный приём и даже угощают ланчем. Тебе следовало бы выразить свою признательность, вступив в Совет, чтобы помочь им.
    0x2DEA, // Да, было бы здорово, если бы ты помог нам заполнить кое-какие бумаги, и… скоро фестиваль, так что надо построить несколько киосков для аттракционов и продажи еды, так что, если бы ты вступил, нам было бы куда проще…
    0x2F6F, // Ну, пожалуйста, Хиттян?
    0x2F99, // Забавно, как хорошо у них получается разыгрывать роли плохого и хорошего полицейского.
    0x3039, // В принципе, я могу попробовать.
    0x3072, // Почему бы и нет? Просто чтобы присмотреться.
    0x30C3, // Ладно, я согласен попробовать. Но это не значит, что я уже определился со вступлением. Я помогу немного, а потом посмотрим. И таким образом, кстати, я расквитаюсь за этот обед. Я соглашаюсь не потому, что хочу.
    0x323B, // Я доедаю сэндвич, и это заставляет Мишу вспомнить, что перед ней стоит парфе. Она берётся за него, чем сильно огорчает Сидзунэ: ей явно ещё многое хочется высказать.
    0x3366, // Всякий раз, как я гляжу на Сидзунэ, она отвечает мне весьма сосредоточенным горящим взором. И сейчас тоже. Несколько секунд выражение лица Сидзунэ остаётся непроницаемым: наверное, она о чём-то размышляет. Через некоторое время на её губах появляется улыбка.
    0x353E, // …
    0x3542, // Она что-то жестикулирует мне, и я, само собой, не понимаю, что она хочет сказать. Причём она это знает. Она повторяет ещё раз, энергично и по-детски игриво.
    0x3658, // …
    0x365C, // Миша, что она сказала?
    0x3684, // …?
    0x3689, // Миша отвлекается от парфе явственно разрываясь между желанием помочь и желанием вернуться к сладкому.
    0x3746, // Что это значит?
    0x3762, // Я изо всех сил пытаюсь повторить жесты Сидзунэ – это оказывается очень нелегко. Страшно подумать, каково было бы использовать их постоянно, изо дня в день за неимением других средств общения.
    0x38C1, // Хм~… Прости, Хиттян, не скажу.
    0x38F7, // Почему? Это что-то обидное?
    0x3928, // Нет, Хиттян, потому что~! Это что-то хорошее.
    0x3977, // Что-то хорошее, значит? Они возвращаются к своим напиткам и еде, так что, я полагаю, разговор пока окончен.
    0x3A37, // Я не совсем понимаю. Но от этого во мне разгорается желание понимать. Может, попытаться выучить язык жестов? В этой школе должны быть курсы.
    0x3B35, // Пойду ли я на такой шаг? Я допиваю кофе, размышляя об этом. Не знаю, с чего я вдруг вообще задумался о подобном.
    0x3BFC, // Я так хорошо провожу здесь время, что упускаю из виду одну важную деталь: десять минут назад наша прогулка превратилась в прогул.
    0x3CE8, // Если мы выйдем прямо сейчас, то будем в школе… минут через тридцать? Наверное. В моём состоянии не стоит бегать, поэтому вряд ли сможем добраться быстрее.
    0x3E01, // Хотя мы всё равно уже опоздали на десять минут, так что даже телепортация не спасла бы.
    0x3E9F, // Что-то не так, Хиттян?
    0x3EC6, // Перерыв кончился десять минут назад. Я тут всего третий день и уже прогуливаю.
    0x3F55, // …
    0x3F59, // Угу~! Ты прогулял.
    0x3F79, // Эй, это не смешно! Вы тоже! Кстати, разве вы не члены Школьного совета? Вы подаёте дурной пример.
    0x4026, // Хиттян у нас такой моралист…
    0x405C, // …
    0x4060, // Но~! Хиттян прав, он опоздал и~ не торопится идти на урок.
    0x40C6, // Как представители Школьного совета мы позаботимся, чтобы тебя наказали за это~!
    0x4158, // Но ведь это вы меня сюда притащили, поэтому вина лежит на вас! Будьте поответственней!
    0x41F5, // …
    0x41F9, // Хиттян, мы вербовали потенциального члена Совета. Уважительная причина~! Но… ты не член Совета, поэтому у тебя нет оправдания!
    0x42E0, // Есть. Этот «потенциальный член Совета» – я.
    0x4330, // …
    0x4334, // Да~! Ты вступаешь в Школьный совет, Хиттян?
    0x4381, // Сидзунэ торжествующе поднимает чашку, оттопырив мизинчик и помахивая им.
    0x4408, // …
    0x440C, // Эх, Хиттян, если бы только ты был членом Школьного совета… Но~! У тебя ещё есть шанс согласиться! Присоединишься сейчас – избежишь проблем и сможешь совершать такие маленькие прогулки с нами ещё много-много раз! Будет весело~!
    0x45A8, // Я начинаю подозревать, что угодил в заранее расставленную хитроумную западню. Вероятно, Сидзунэ заманила меня сюда, рассчитывая на то, что я забуду о времени и окажусь в подобной ситуации. Коварно…
    0x4712, // Что ж, учитывая всё то, что мне о ней известно, мне стоило оставаться настороже. Но если я признаю то, что сам виноват в сложившейся ситуации, то никогда не смогу простить себя.
    0x4850, // Я пытаюсь прочесть намерения Сидзунэ по её глазам, но она просто смотрит на меня ничего не выражающим невинным взглядом. Она делает глоток чая, будто насмехаясь надо мной.
    0x4989, // …
    0x498D, // Кстати, Хиттян, я не планировала ничего подобного, это вышло само собой~!
    0x4A11, // Я уже собирался списать эту теорию на паранойю, но эта фраза порождает новый виток подозрений. Я чуть не падаю со стула от ужаса, когда осознание накрывает меня с головой. Итак, всё и вправду было умело подстроено. С самого начала. Всё ради того, чтобы в тот миг, когда я начну сгорать со стыда, заставить меня присоединиться к Школьному совету.
    0x4C80, // …
    0x4C84, // А-ха-ха-ха-ха~! Ты что, нервничаешь, Хиттян~? Ты ведь не думаешь, что мы всё это время играли с тобой?
    0x4D35, // Разве нет?
    0x4D48, // Хиттян, ты действительно так думал?..
    0x4D8B, // Миша понуро опускает голову, и Сидзунэ тут же вторит ей. Как синхронно. Прекрасная пара. Точно близнецы.
    0x4E48, // …
    0x4E4C, // Хиттян, Ситтян говорит, что она польщена, но такой поступок был бы неприемлемым злоупотреблением властью и посягательством на твою свободу воли~! И~! Это было бы шантажом! Ситтян никогда бы так не поступила, никогда!
    0x4FD4, // Меня так и подмывает спросить Мишу, уверена ли она в этом, но я сдерживаюсь.
    0x505D, // …
    0x5061, // И Ситтян сказала правду о том, что, раз ты с нами и мы выполняем работу для Совета, нет ничего страшного в пропуске пары уроков.
    0x5147, // …
    0x514B, // Не то чтобы это было таким уж хорошим оправданием…
    0x51A9, // …
    0x51AD, // …И не то чтобы так можно было поступать чаще трёх раз в месяц…
    0x5220, // …
    0x5224, // И не то чтобы этим можно и нужно было бы злоупотреблять…
    0x528C, // …
    0x5290, // Поэтому~! Нам обязательно, обязательно нужно вернуться в класс! Когда-нибудь~!
    0x531E, // Ва-ха-ха!~
    0x532F, // Сидзунэ машет Юко и указывает на пустую чашку, прося повторить заказ. Миша второпях доедает парфе, явно не собираясь на нём останавливаться. Может быть, и мне стоит взять ещё что-нибудь?
    0x5481, // Сэндвич был чрезвычайно мал, и я не наелся, а раз Сидзунэ за всё платит, то можно попросить принести ещё один.
    0x5547, // …Мы покидаем чайный дом, просидев в нём не один, а целых два урока.
    0x55C0, // Сидзунэ и Миша, кажется, не возражают против того, чтобы прогулять их все. Они придумывают новый повод потянуть время, предлагая экскурсию по городку, которая выливается в прогулку по двум ближайшим кварталам.
    0x573F, // Через какое-то время мы всё же возвращаемся в школу, и остаток учебного дня проходит как обычно. После уроков Сидзунэ и Миша собираются и покидают класс раньше меня. Если подумать, это первый раз, когда они оставили меня одного.
    0x58DD, // Странно, мне даже как будто бы не хватает их компании. Класс быстро пустеет, и я покидаю кабинет последним.
    0x599F, // Однако в вестибюле передо мной резко опускается, словно шлагбаум, знакомая рука.
    0x5A33, // …
    0x5A37, // О, привет, Сидзунэ.
    0x5A59, // И знакомые ладошки закрывают мои глаза под взрыв озорного смеха.
    0x5AD0, // Эй, Хиттян~! Угадай кто?
    0x5AFA, // Миша задаёт этот вопрос без малейшего намёка на сарказм, что означает её искреннюю веру в то, что я не способен узнать её по ряду совершенно очевидных признаков.
    0x5C20, // Кто бы это мог быть? Ну уж точно не Миша…
    0x5C6A, // Ха-ха-ха~! Именно она!
    0x5C90, // Она подскакивает к Сидзунэ и встаёт рядом.
    0x5CDE, // …
    0x5CE2, // Хиттян, ты сейчас занят?
    0x5D0E, // Занят, направляюсь в свою комнату. Увидимся завтра!
    0x5D6C, // Я пытаюсь их обойти, но Сидзунэ проворно меня останавливает. Похоже, годы игры в футбол прошли даром. Наше поведение привлекает слишком много лишних взглядов. Лучше бы сдаться, пока я совсем не опозорился.
    0x5EE2, // …
    0x5EE6, // Хиттян, не мог бы ты подняться наверх и принести кое-что из кабинета кружка рисования?
    0x5F83, // Почему я?
    0x5F94, // Ха-ха-ха~! Ситтян считает, что если мы встретим учителя рисования, то он начнёт с нами здороваться, а он ей не нравится!
    0x606A, // Пусть не обращает на него внимания.
    0x60AB, // …
    0x60AF, // Она пыталась, но, несмотря на то что Ситтян глухая, он всё равно говорит: «Привет~!»
    0x6145, // А убежать?
    0x6158, // …
    0x615C, // Я никогда не бегу с поля боя!
    0x6190, // Резкость этих слов заметна даже через Мишин перевод. Спорить об этом дальше с Сидзунэ бесполезно.
    0x6243, // Миша, а почему ты не сходишь?
    0x6277, // У меня от лестниц голова кружится, Хиттян!
    0x62C4, // …
    0x62C8, // Сидзунэ кивает в подтверждение её слов.
    0x6311, // Ну, пожалуйста, Хиттян! Нам нужны эти материалы, чтобы построить киоски для фестиваля! Ты же обещал немного помочь, ведь так? Так?
    0x63FB, // Не стоило бы этого делать, но разок можно и помочь.
    0x6457, // Ладно.
    0x6463, // …
    0x6467, // Отлично, Хиттян! Спасибо~!
    0x6496, // Вот что нам нужно!
    0x64B7, // Она передаёт мне бумажку.
    0x64E6, // Список явно составляла Сидзунэ. Он написан от руки, но каждый символ вычерчен с безупречной точностью, как будто набран на компьютере, а сам список предельно подробен, с пунктами, подпунктами и даже клеточками для галочек.
    0x667C, // Им нужны краски, кисти, листы ватмана и мольберты разных типов и в разных количествах. Интересно, как я протащу всё это вниз по лестнице, не сломав шею?
};

#endif // KS_A1_WEDNESDAY_DETOUR_AHEAD_RU_TL_INDEX