#ifndef KS_A1_SATURDAY_SIP_P2_RU_TL_INDEX
#define KS_A1_SATURDAY_SIP_P2_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_B77B0D37_ru_intl[] = {
    0x0000, // Но почему Лилли оставила её одну? Судя по реакции Ханако, это довольно необычно.
    0x0092, // …
    0x0096, // …А, точно. Перед тем как мы столкнулись с Рин, Лилли вроде что-то говорила насчёт прогулки в город.
    0x0149, // Подумав об этой прогулке, я выглядываю в окно.
    0x019D, // Я гляжу на яркое солнце и людей, прогуливающихся и наслаждающихся погодой, и мне хочется выбраться из школы или хотя бы просто не сидеть здесь, а заняться чем-то другим.
    0x02D0, // Поддавшись одному из своих самых злостных пороков – лени, я решаю, что историю лучше учить в воскресенье. Или в понедельник. Или в любой другой день, кроме сегодняшнего.
    0x0404, // С тяжёлым вздохом я поднимаюсь с места, размышляя, не пойти ли потусоваться с Кендзи.
    0x049F, // Однако он не производит впечатления человека, который любит наслаждаться прекрасной погодой на улице с друзьями. Потом как-нибудь свидимся.
    0x05A1, // Изменив ход мысли, я обдумываю идею поговорить с Ханако, но когда поворачиваюсь, то замечаю, что её место уже пусто. Наверное, ушла в библиотеку.
    0x06A7, // Пойду на прогулку в город.
    0x06D7, // Пойду в библиотеку.
    0x06FB, // Ю… Юко?
    0x0709, // Привет, я и не знал, что ты здесь работаешь.
    0x0757, // А, да, м-м…
    0x076A, // Добро пожаловать в «Шанхай»! Могу я принять ваш заказ?
    0x07CD, // Не знаю… кофе, пожалуйста?
    0x07FE, // Да, конечно. Я прямо сейчас займусь им и принесу вам, когда он будет готов.
    0x0884, // Э, спасибо.
    0x0898, // Привет, Лилли.
    0x08B2, // …Хисао?
    0x08C1, // Да. Рад снова тебя видеть.
    0x08F0, // Вы знакомы?
    0x0905, // Я… полагаю, да.
    0x0921, // Хм… может, присядешь?
    0x0949, // Полагаю, вас следует представить.
    0x0987, // Хисао, это Акира Сато, моя старшая сестра. Акира, это Хисао Накай, он тоже учится в «Ямаку».
    0x0A2B, // Ну, как дела в школе?
    0x0A50, // Ты, похоже, сильно занята.
    0x0A7F, // Мне теперь хотя бы не приходится готовить тебе обед каждый день после уроков.
    0x0B0D, // Ох, как резко. Разве ты не для себя готовила? А я только получала остатки.
    0x0B91, // Я не к тому… тебе хотя бы удаётся себя прокормить?
    0x0BED, // Я, знаешь ли, умею готовить, не взрывая кухню.
    0x0C3F, // В большинстве случаев.
    0x0C69, // Это…
    0x0C73, // Ха-ха-ха! Всё в порядке, в порядке. Мне всё равно пришлось бы когда-нибудь научиться.
    0x0D0B, // О, Лилли?
    0x0D1B, // Ну, мне, наверное, пора. Была рада с тобой поговорить, Лилли.
    0x0D87, // Акира, тебе уже…
    0x0DA6, // Извини, мне нужно вернуться на работу. Они снова начнут ко мне цепляться, если я быстро не вернусь.
    0x0E59, // Пока, Акира…
    0x0E71, // Ну давай, не грусти. Скоро ещё встретимся. Пока.
    0x0EC7, // Она довольно приятный человек.
    0x0F00, // Мы раньше жили вместе, но теперь, когда я живу в интернате, мы даже видимся очень редко.
    0x0F9E, // Вы жили вместе? Где-то здесь, недалеко?
    0x0FE4, // Мы жили довольно далеко к югу, так что путешествие в «Ямаку» было весьма длинным.
    0x1078, // Затем она стала работать дольше, а «Ямаку» находился слишком далеко, так что у меня не осталось выбора, кроме как переехать в общежитие.
    0x1170, // Я так понимаю, ты уже отдохнул?
    0x11A8, // Прости?
    0x11B6, // Твоё дыхание успокоилось по сравнению с тем, каким оно было, когда ты только вошёл.
    0x124D, // Да. Хотел немного пройтись, а вместо этого стал гулять по всему городу.
    0x12CE, // Ты уходишь?
    0x12E3, // Да. А ты не собираешься тоже пойти? Уже довольно поздно.
    0x1348, // Юко, можно нам ещё один кофе, пожалуйста?
    0x1392, // Хорошо, сейчас принесу!
    0x13BD, // Это было… прямолинейно.
    0x13EA, // Значит, жаждешь общества?
    0x1419, // Хм… Я бы сказала, что просто задалась вопросом…
    0x1472, // Нет ли у тебя братьев или сестёр?
    0x14AE, // Нет, я единственный ребёнок. Если честно, я немного завидую тем, у кого есть кто-то настолько близкий.
    0x1566, // Занятно…
    0x1578, // Просто я уже такое слышала от других.
    0x15BC, // Над этим вопросом сложно думать объективно, учитывая, что у меня такой человек всегда был.
};

#endif // KS_A1_SATURDAY_SIP_P2_RU_TL_INDEX