#ifndef KS_A1C1O2_RU_TL_INDEX
#define KS_A1C1O2_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1D0BA_ru_intl[] = {
    0x0000, // Да, конечно. В смысле, мне кажется, что так принято.
    0x005C, // Разумеется. Просто не все любят быть в центре внимания.
    0x00C1, // Наверное, я как раз из таких людей, но лучше бы мне произвести первое впечатление самостоятельно.
    0x0173, // Бывает, но для меня это не проблема.
    0x01B4, // Ну, тогда пойдём.
};

#endif // KS_A1C1O2_RU_TL_INDEX