#ifndef KS_A1_THURSDAY_THINGS_YOU_CAN_DO_RU_TL_INDEX
#define KS_A1_THURSDAY_THINGS_YOU_CAN_DO_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_DFFE7EA5_ru_intl[] = {
    0x0000, // Ханако резко кивает и торопливо уходит.
    0x0049, // О чём мы там говорили? Ах да, мы очень упорно трудимся, чтобы устроить фестиваль.
    0x00DB, // И мимоходом сводите остальных с ума.
    0x011E, // Ну, удачи вам.
    0x0137, // Я встаю и выхожу прежде, чем кто-нибудь из них успевает продолжить ругать меня за безделье.
    0x01DD, // В коридорах, как и ожидалось, сейчас тихо. Все, должно быть, на собраниях своих кружков или готовятся к фестивалю. Или всё сразу.
    0x02C5, // Слова Сидзунэ о том, что я лентяй, эхом отдаются у меня в голове.
    0x0339, // Я чувствую себя немного виноватым за то, что не помогаю, но, похоже, мне не хватает решимости сделать что-то определённое.
    0x0416, // Делать что-то для фестиваля уже поздно, не считая помощи Сидзунэ и Мише (а её я, разумеется, не считаю). А кружки… Я не знаю.
    0x04F4, // Наверное, я не отношусь к тому типу людей, что станут вступать в кружок.
    0x0576, // Перед общежитиями, на полпути от здания школы, я замечаю чей-то силуэт.
    0x05F7, // Это Рин.
    0x0606, // Похоже, она снова работает над фреской.
    0x064E, // Я подхожу к ней, но она, кажется, этого не замечает.
    0x06AA, // Она сидит на перевёрнутой коробке, пристально глядя на стену, на которой рисует зажатой между пальцами ноги кистью.
    0x077E, // Со вчерашнего дня работа над фреской значительно продвинулась, но сейчас готова, на мой взгляд, ещё только половина.
    0x0853, // Появилось больше цветов, число переплетённых человеческих фигур возросло.
    0x08DD, // Надо сказать, её техника довольно оригинальна и притягивает взор. Не то чтобы я особо разбирался в искусстве, но всё равно выглядит здорово.
    0x09DD, // Я прочищаю горло, чтобы привлечь её внимание, но не испугать, так, чтобы не нарушить её концентрацию.
    0x0A94, // Подожди.
    0x0AA4, // Она даже не оборачивается, чтобы посмотреть, кто это.
    0x0B05, // Я подожду.
    0x0B18, // …
    0x0B1C, // …
    0x0B20, // …
    0x0B24, // …
    0x0B28, // …
    0x0B2C, // Через пятнадцать минут я решаю, что её концентрация, несомненно, не нарушилась и что я прождал достаточно, чтобы быть в праве постучать её аккуратно по плечу, напомнив о своём присутствии.
    0x0C83, // Рин механически поворачивает ко мне голову, уставившись в итоге в область моей промежности.
    0x0D2C, // О, это Хисао.
    0x0D43, // Узнала? Я бы чувствовал себя куда менее неловко, если бы она смотрела мне в лицо.
    0x0DD5, // Верно подметила. Вся в работе, как погляжу.
    0x0E23, // Беседа начинается так, будто я не стою тут уже четверть часа, но это ерунда. По крайней мере, она начинается.
    0x0EE7, // Выглядит здорово.
    0x0F08, // Это действительно так; слои краски скрывают другие слои, смешение и формы человеческих фигур создают впечатляющее зрелище. Но Рин выглядит обиженной.
    0x101C, // Нельзя комментировать незавершённые работы. Семь лет невезения.
    0x1093, // Звучит жутко. Думаю, тогда я возьму слова назад.
    0x10EA, // Но всё же выглядит здорово. Не ждут ли меня четырнадцать лет невезения за такие мысли?
    0x1187, // Рин отворачивается к картине и стучит по ней большим пальцем ноги.
    0x1201, // Можешь намешать вот такой цвет? Он кончается.
    0x1254, // Она опускает глаза на полупустую чашку с остатками такого же розового цвета.
    0x12E1, // Я как-то не планировал оставаться и помогать ей с проектом, однако… Честно говоря, я вообще не планировал делать что-либо.
    0x13C0, // Я смотрю на Рин, а она пустым взглядом – на меня.
    0x1418, // Только эту, один раз.
    0x143E, // Рин берёт другую кисть и смачивает её в другом оттенке бледно-красного. Вокруг неё стоит дюжина одинаковых чаш. Судя по этой обстановке, она сидит здесь уже несколько часов.
    0x157A, // Интересно, так ли это. Если так, то, значит, она пропустила все уроки, чего вполне можно ожидать от кого-то вроде Рин.
    0x164C, // Я наливаю немного белого и красного в чашку, пытаясь подобрать цвет на стене.
    0x16D9, // Похоже, получается не совсем то, что надо.
    0x1725, // Очень неудобно, что она сразу не намешала достаточно краски. Найти теперь точный оттенок будет невозможно, но я могу хотя бы попытаться.
    0x181E, // Кстати, о тяжёлой работе. Разве это не огромная нагрузка и для тебя тоже? Картина такая большая, и вообще.
    0x18DD, // О, я не настолько старая и утомлённая жизнью, чтобы так думать.
    0x194F, // Полагаю, что и правда – не настолько.
    0x1993, // Правильно полагаешь.
    0x19BA, // Но ноги болят. Они как свинцовые. Как будто из свинца, сделанного из свинок.
    0x1A43, // Из-за положения?
    0x1A61, // Да, я больше люблю этим заниматься в горизонтальном положении, если ты понимаешь, о чём я.
    0x1B04, // Но с этим ничего не поделаешь. Я не могу попросить стену лечь.
    0x1B74, // Сказав это, она немного потягивается, изгибая ноги и спину так, как обычный человек не согнулся бы. Поразительно, как она управляется со своим телом.
    0x1C83, // Мышцы на её лице чуть дёргаются, видимо намекая на боль, которую она испытывает, когда потягивает икры.
    0x1D3F, // У Рин, должно быть, выносливость и ловкость находятся на куда более высоком уровне, чем у обычного человека, но, работая над фреской, она совершенно себя изматывает.
    0x1E6B, // Зачем так напрягаться? Сделай хотя бы перерыв. Если плохо, продолжишь завтра.
    0x1EF8, // Это приводит её в замешательство.
    0x1F36, // И притом долгое, как будто она ненадолго впала в ступор.
    0x1F9C, // …
    0x1FA0, // Думаю, не стоит мне этого делать, Хисао.
    0x1FE8, // И я не напрягаюсь.
    0x2009, // А очень похоже на то.
    0x202F, // Нет. Это не связано ни с напряжением, ни с расслаблением, ни с чем-то вроде того.
    0x20BF, // Дело в этом мальчике.
    0x20E6, // Мальчике?
    0x20F8, // Да.
    0x20FE, // Каком?
    0x210A, // Из кружка рисования.
    0x2130, // Э… и?
    0x213A, // Он слепой.
    0x214D, // О. А как рисовать, если ты слепой?
    0x2189, // Понятия не имею.
    0x21A7, // Тогда почему он там?
    0x21CC, // В том и дело. Он там.
    0x21F0, // Надо бы ей говорить больше одного слова зараз, чтобы больше было похоже на беседу, чем на допрос.
    0x22A0, // Он не может заниматься чем-либо, что бы ты назвал искусством, так? Но он всё равно туда ходит. И рисует.
    0x2359, // Почему?
    0x2367, // Я не знаю. Почему?
    0x2387, // Я не знаю. Потому и спрашиваю.
    0x23BD, // И?
    0x23C1, // Он редко рисует, но, как мне кажется, картины у него очень интересные.
    0x243F, // Не сомневаюсь.
    0x245A, // Я однажды попробовала. Рисовать с закрытыми глазами.
    0x24BB, // Было не очень интересно. И пол отмывала целую вечность. Больше не пробовала.
    0x2546, // Но вот скульптуры у него выходят всё лучше.
    0x2595, // Понятно.
    0x25A5, // Может, она пыталась высказать этим какую-то мысль. Или просто забыла, что у неё таковая была.
    0x264D, // Похоже, кружок рисования полон интересных людей.
    0x26A7, // Не особо.
    0x26B8, // Она делает довольно откровенное заявление, притом не замечая моего сарказма.
    0x2746, // Нет?
    0x274E, // Как я и сказала. Они не особо интересные. Обычно меня не сильно интересуют неинтересные люди.
    0x27F8, // Может быть, тебя интересуют?
    0x282C, // Может быть.
    0x2841, // …
    0x2845, // Но тот мальчик – интересный.
    0x287A, // Может быть, я похожа на него, а может быть, ты похож. Может, все похожи.
    0x28F8, // Делают вещи, которые не могут делать, просто потому, что могут.
    0x296A, // Думаю, это очень глубокомысленно, и я так ей и говорю.
    0x29CB, // Ты глубоко мыслишь.
    0x29EF, // Нет. Я поверхностная и неразумная. Люди мне постоянно об этом твердят.
    0x2A6F, // Ты знал, что я одновременно могу думать только о четырёх вещах?
    0x2AE2, // Нет, но теперь знаю.
    0x2B06, // Сейчас я думаю о женском туалете на втором этаже, мороженом со вкусом мороженого, среднем пальце ноги и стрижке.
    0x2BD3, // Мне скоро надо стричься.
    0x2C00, // Она энергично трясёт головой, размахивая своими короткими растрёпанными волосами. Ей, видимо, нравится это делать.
    0x2CD3, // Мы молчим, пока Рин топчется, перекладывая кисточки. Мне в голову приходит мысль о вступлении в кружок рисования и ненадолго там задерживается.
    0x2DDA, // Я чувствую, будто ступаю на совершенно неизученную территорию искусства. Встреча с Рин создаёт ощущение, будто я пытаюсь начать курить, или вроде того. Наверное, надо перестать с ней разговаривать.
    0x2F43, // Не то чтобы она мне не нравилась, несмотря на замешательство, в которое приводит её натура, и не то чтобы я не любил искусство – я даже когда-то рисовал для забавы, – просто у меня нет ни творческого запала, ни технических навыков.
    0x30E5, // Так что обычно, когда я собираюсь порисовать, у меня случается синдром чистого листа и я просто застываю на месте.
    0x31B5, // Или же я изображаю что-то бесформенное, тут же расстраиваюсь из-за своей неспособности перенести картинку в голове на бумагу и бросаю всё, даже не пытаясь приложить какие-либо усилия.
    0x3304, // У Рин такой проблемы точно нет… но она смущает меня другим. Быть с ней – это как смотреть в зеркало, которое ничего не отражает.
    0x33ED, // Невольно задумываешься о разумности такого действия.
    0x3450, // Рин садится на свою коробку, покачиваясь из стороны в сторону, – видимо, неловкое молчание её совсем не смущает. Она опять на меня смотрит или, может быть, за моё плечо. Я не могу точно определить, на чём сфокусированы её глаза.
    0x35EB, // Я подумываю её покинуть, чтобы она смогла продолжить, не отвлекаясь, а я – в одиночку делать то, что собирался. Дел у меня, конечно, неотложных нет…
    0x36F7, // Вот блин.
    0x3708, // Где?
    0x3710, // Нигде, просто я забыл сказать Ханако, что Лилли её искала.
    0x3779, // Знаешь её? Из моего класса.
    0x37AA, // А, она… Таинственная девушка из туалета.
    0x37F5, // Она забавная. Три недели назад я видела, как она пять раз ходила в туалет на одной перемене. Уверена, это был мировой рекорд.
    0x38D6, // Это было очень загадочно.
    0x3905, // Поэтому ты зовёшь её Таинственной девушкой из туалета?
    0x396A, // А какая ещё тут может быть причина? Ну, если и есть, то это вечная тайна. Туда я за ней не ходила.
    0x3A16, // …
    0x3A1A, // Может быть, это было ещё неделей раньше? Возможно.
    0x3A75, // …
    0x3A79, // Когда я смотрю на неё, то хочу есть.
    0x3AB9, // Не говори такого.
    0x3AD9, // Хотя бы не при ней.
    0x3AFB, // Рин поворачивается и смотрит на меня без выражения, будто не понимая, за что я её упрекнул.
    0x3BA0, // До неё так и не доходит, и я сдаюсь.
    0x3BDF, // Ты, значит, собираешься обедать?
    0x3C1A, // Нет. Ещё нет.
    0x3C31, // Рин переводит голодный взгляд на стену, выглядя чуть более энергичной или по крайней мере чуть менее рассеянной, чем прежде.
    0x3D15, // Будто стена – это противник, которого ей надо побороть; что-то, что нужно одолеть, прежде чем позволить себе поесть.
    0x3DE8, // Такое у меня создаётся впечатление. Меня охватывает непонятное сочувствие, и я слабо улыбаюсь.
    0x3E96, // Несмотря на всю свою странность, Рин классная.
    0x3EEB, // Ну, а я пойду.
    0x3F03, // Веселись.
    0x3F15, // Рин уже взяла кисть и обмакнула её в краску, так что, наверное, меня она не слышит. А если и слышит, всё равно не отвечает.
};

#endif // KS_A1_THURSDAY_THINGS_YOU_CAN_DO_RU_TL_INDEX