#ifndef KS_A1_FRIDAY_INVISIBLE_HAT_RU_TL_INDEX
#define KS_A1_FRIDAY_INVISIBLE_HAT_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_9BFD77BF_ru_intl[] = {
    0x0000, // Первое, что я вижу по возвращении в комнату, – знакомый ряд лекарств на тумбочке, и он, как обычно, вгоняет меня в тоску.
    0x00D9, // Это напрягает. Я думал, будет нормально. Я думал, что свыкся с этим, пересилил себя.
    0x016F, // Но на самом деле… я позволил себе забыть о том, что у меня проблема. Нахождение здесь возвращает меня к реальности, а попытки бороться с ней только ранят.
    0x0287, // А размышления не особенно-то помогают. Я подобным уже занимался, месяцами. Видимо, пора двигаться дальше.
    0x0347, // Если я позволю себе забыть о том, что моя жизнь не будет столь же длинной, как у других, я ни к чему не приду.
    0x0409, // Быть может, моя жизнь и не такая, как у остальных, но она всё ещё продолжается.
    0x0496, // Вот в таком ключе и буду мыслить.
    0x04D2, // Я глотаю привычную пригоршню таблеток, пытаясь прогнать внезапно нахлынувшее уныние. Затем собираюсь, чтобы добраться до класса, как обычно пораньше.
    0x05E6, // Выйдя в коридор, я замечаю, как Кендзи, крадучись, словно ниндзя, с большой сумкой наперевес, почти беззвучно прокрадывается мимо меня к дверям своей комнаты. В последний момент я его окликаю.
    0x0743, // Здорова.
    0x0753, // Он вздрагивает от неожиданности.
    0x0790, // А, привет, чувак. Я тебя и не заметил. Очень устал.
    0x07E9, // Думаю, он меня даже не увидел, но это неважно.
    0x083B, // Куда ты ходил так рано? За покупками?
    0x087E, // Не, не за покупками. Иногда мне нужно ходить к… учителю математики. Да, я подумал, что хорошо было бы узнать, когда следующий экзамен, ведь он говорит заранее, если спросить.
    0x09B8, // Тогда что в сумке?
    0x09D9, // Думал заодно сходить за покупками, раз уж выбрался на улицу. Мне нужны припасы, чтобы продолжать борьбу против великого феминистского заговора.
    0x0AE1, // А, понятно.
    0x0AF5, // Я думал, ты не выходишь наружу.
    0x0B2D, // Я теперь ношу шляпу.
    0x0B52, // Лучше не говорить ему, что на нём нет шляпы.
    0x0BA1, // Между нами воцаряется неловкое молчание, и Кендзи нарушает его, начав медленно открывать дверь, скрип которой только придаёт моменту ещё больше неловкости. Он ставит сумку в комнату и закрывает дверь.
    0x0D11, // Ты меня удивляешь: изменил свой обычный распорядок, чтобы разузнать дату экзамена. Ты прямо-таки проявляешь себя прилежным учеником: стараешься ухватиться за любую возможность подготовиться получше.
    0x0E81, // Я не готовлюсь к экзаменам.
    0x0EB3, // А…
    0x0EB9, // Я просто хотел знать дату. Я на него, конечно, схожу. Мне нужно знать, в какой день нельзя пропускать урок. Он обычно по телефону о подобной фигне сообщает, так что пришлось мне самому идти и спрашивать.
    0x1026, // А зачем тебе выходить, если ты можешь узнать по телефону?
    0x108E, // Я не ношу телефон.
    0x10AF, // Что ты имеешь в виду? Ты оставляешь его дома?
    0x1100, // Не, я не пользуюсь телефонами. У меня нет телефона. Телефоны… Нет у меня его.
    0x118B, // Почему у тебя нет телефона? Как у тебя может не быть телефона? Совсем нет? Нет телефона?
    0x1229, // Мне просто не нравятся телефоны. На самом деле я их боюсь. Не знаю почему. Наверное, это какая-то подавленная травма.
    0x12FC, // Ну, короче говоря, когда я слышу, как звонит телефон, начинаю нервничать. Это моя самая страшная тайна.
    0x13B6, // У меня на этот счёт две теории: либо я боюсь получить какой-нибудь неясный, зловещий, судьбоносный и роковой звонок, либо меня когда-то избили телефоном. Так сильно, что я не могу этого вспомнить.
    0x1518, // Причём били по голове.
    0x1541, // Ну а куда ещё меня могли бить так, что я теперь не могу вспомнить? По заднице?
    0x15CC, // Неожиданно логично. Я чувствую себя подавленным. Понимая, что разговор более или менее подошёл к концу, Кендзи открывает дверь и собирается войти.
    0x16D8, // Ладно, пойду я спать, чувак. Хорошего дня.
    0x1723, // Урок начнётся уже минут через двадцать.
    0x176C, // Я сегодня уже кое-что сделал. Слишком устал, чтобы идти на занятия.
    0x17E5, // Эй, тебе нужен бальзам для губ? Я случайно купил два; думал, что они начали продавать пальчиковые батарейки поштучно.
    0x18BA, // Спасибо, не надо.
    0x18D9, // Я просыпаюсь и принимаю горячий душ.
    0x191C, // Как хочешь, чувак.
    0x193D, // Он поспешно скрывается в своём логове, наконец-то позволив мне пойти на урок.
};

#endif // KS_A1_FRIDAY_INVISIBLE_HAT_RU_TL_INDEX