#ifndef KS_A1_WEDNESDAY_MEET_CUTE_RU_TL_INDEX
#define KS_A1_WEDNESDAY_MEET_CUTE_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_3909835C_ru_intl[] = {
    0x0000, // Мы втроём покидаем класс.
    0x002F, // Лилли идёт вдоль стены, легонько постукивая по ней тростью, Ханако держится рядом, буквально обнимая её.
    0x00EE, // Похоже, что Лилли намного труднее перемещаться подобным образом, но, несмотря на это, она вовсе не возражает.
    0x01B5, // Как только мы сворачиваем за угол, удар в грудь с силой несущегося на полной скорости поезда едва не сбивает меня с ног. Ханако сдавленно вскрикивает от неожиданности. У меня в глазах начинает темнеть.
    0x0324, // Хисао, что случилось?
    0x034B, // Конечно, Лилли не в курсе происходящего, но её голос звучит крайне взволнованно. Хотя в этой ситуации такое волнение излишне.
    0x0430, // Кое-кто в меня врезался, но вроде ничего серьёзного. Всего лишь небольшой ушиб.
    0x04C0, // Э… извини, я нечаянно. Мне просто надо было срочно забрать кое-что, и я очень торопилась.
    0x0561, // Этот «кое-кто» – Эми, не так ли?
    0x059A, // Маленькая девочка смущённо кашляет и шаркает «ногами», сделанными из какого-то металла или пластика, опуская на них взгляд, прежде чем что-либо ответить.
    0x06B3, // …Привет, Лилли. Привет, Ханако.
    0x06EC, // Похоже, они знакомы.
    0x0711, // Пожалуйста, будь осторожнее. Ты достаточно крепкая, чтобы спокойно перенести такого рода происшествия, но в школе есть ученики, которые от подобного могут пострадать.
    0x0843, // Девочка краснеет со стыда и начинает мяться на месте, как ребёнок, которого отчитывают за плохое поведение.
    0x0908, // Это выглядит так мило, что я не могу сдержать улыбку.
    0x0968, // Я знаю! Я-я… эм… я просто…
    0x0999, // А-а-а! Мне надо спешить!
    0x09C3, // Учитель мне голову оторвёт! Я обещала помочь с распечатками, а вместо этого пошла бегать! Извините, но мне надо переодеться и всё такое!
    0x0ABA, // Не успеваем мы и слова произнести, как Эми срывается с места и бежит дальше по коридору, который без неё становится гораздо тише.
    0x0BA5, // И часто здесь такое случается?
    0x0BDD, // Насчёт бега по коридорам в «Ямаку» особенно строгие правила.
    0x0C4D, // …но, похоже, это редко останавливает Эми.
    0x0C99, // Она качает головой и сдержанно улыбается.
    0x0CE6, // Боюсь, не в наших силах как-то повлиять на неё. Что ж, пойдёмте.
    0x0D57, // Лилли отправляется дальше по коридору, и Ханако, спохватившись, следует за ней.
    0x0DE8, // Я легко восстанавливаю в памяти дорогу в комнату, которую эти двое используют для чаепитий, поскольку был там только вчера.
};

#endif // KS_A1_WEDNESDAY_MEET_CUTE_RU_TL_INDEX