#ifndef KS_CLASS_GOES_LAZILY_RU_TL_INDEX
#define KS_CLASS_GOES_LAZILY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_D7FBC85A_ru_intl[] = {
    0x0000, // Урок тянется очень неторопливо. Думаю, я начинаю входить в ритм школьной жизни.
    0x0091, // Я перестаю конспектировать всё подряд и проявлять чрезмерную внимательность. В первые дни на уроках я был довольно нервным.
    0x0175, // Муто заканчивает свою лекцию об электричестве чуть раньше и сразу же переходит к теме фестиваля.
    0x0227, // Как вы знаете, фестиваль состоится послезавтра. Надеюсь, все ваши проекты будут в этом году иметь успех.
    0x02E5, // Желаю всем приятно провести время, но, пожалуйста, не забывайте истинного значения фестиваля…
    0x0393, // Игры и жареная еда!
    0x03B6, // Класс взрывается смехом, и я тоже.
    0x03F4, // Да, спасибо, Микадо.
    0x0418, // Но я имел в виду—{w=.5}{nw}
    0x0442, // Конец предложения тонет в звоне колокола, возвещающего большую перемену, и все начинают собираться.
    0x04FA, // Муто некоторое время размышляет, стоит ли продолжать, но, поскольку его уже никто не слушает, сдаётся и садится за стол.
    0x05D4, // В коридоре людно… настолько, насколько обычно бывает людно в коридорах этой школы. Большинство учеников направляется в столовую.
};

#endif // KS_CLASS_GOES_LAZILY_RU_TL_INDEX