#ifndef KS_CHOICE_DODGE_SUBJECT_RU_TL_INDEX
#define KS_CHOICE_DODGE_SUBJECT_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_4D2DCD5F_ru_intl[] = {
    0x0000, // Ничего.
    0x000E, // Я быстро встаю перед ними, чтобы загородить обзор. Сидзунэ с подозрительным видом отступает, но на её лице написана и обеспокоенность.
    0x0104, // Надеюсь, если я уклонюсь от темы, она поймёт, что я не хочу, чтобы она продолжала допытываться.
    0x01AF, // …
    0x01B3, // Правда~? Что ты там прячешь, Хиттян~?
    0x01F4, // Ну я же сказал, ничего.
    0x021D, // …
    0x0221, // Вот как~?
    0x0231, // Похоже, я не смогу выкрутиться. Они по природе своей любопытные, и если я буду продолжать что-либо скрывать, то это только распалит их интерес.
    0x0334, // Ну ладно, это {b}кое-что{/b}, но я не хочу об этом говорить, ладно? Пока… не хочу.
    0x03BF, // Можем мы отложить это на потом?
    0x03F8, // Пока Миша переводит, Сидзунэ смотрит на меня поверх очков тяжёлым и, как всегда, пристальным взглядом.
    0x04B3, // Она задумчиво складывает пальцы, будто взвешивая целесообразность оказания дальнейшего давления на меня и оскорбительность пренебрежения моей просьбой.
    0x05D0, // В конце концов она слабо улыбается и начинает что-то жестикулировать Мише.
    0x0659, // …
    0x065D, // Хорошо~! Тогда мы будем ждать. Сдружимся крепче, и однажды, когда ты сам захочешь, сможешь нам об этом рассказать~!
    0x072B, // Они обе мне широко улыбаются, а я чувствую себя потрясённо и немного глупо из-за того, что так себя повёл.
    0x07EA, // Они не глупы и уже, возможно, на пути к разгадке моих проблем со здоровьем. И…
    0x0877, // Такие простые и добрые слова. Я чувствую облегчение, что они не стали обо мне худшего мнения, несмотря на то что я вот такой. Даже если я не похожу на остальных здесь. Несмотря на то что я так напрягаюсь по этому поводу.
    0x0A02, // Похоже, что за завесой надоедливых, озорных девушек скрываются очень добрые и хорошие люди. Я так думаю.
    0x0AC0, // Спасибо.
    0x0AD0, // Значит, хотите, чтобы я вам сегодня помог? Потому что я теперь один из вас?
    0x0B56, // Угу~!
    0x0B5F, // После уроков?
    0x0B78, // Нет-нет-нет~! Сейчас!
    0x0B9D, // Сейчас? А как же уроки? Собираетесь опять пропустить?
    0x0BFE, // …
    0x0C02, // Ха-ха-ха~! Это же для общего блага, поэтому мы приносим в жертву математику и, возможно, обществознание~!
    0x0CBE, // Я не против.
    0x0CD4, // …
    0x0CD8, // Прекрасно, Хиттян~! Запомни, ты сказал, что не против помочь, и запомни хорошенько.
    0x0D6D, // Ага.
    0x0D75, // Этот тон… Я уже сожалею, что ляпнул это.
    0x0DBE, // …
    0x0DC2, // Отлично~! Значит, ты готов идти? Мы можем пойти вместе~!
    0x0E25, // Нет. Вы, наверное, меня заставите нести все ваши вещи или что-нибудь в этом роде.
    0x0EB6, // …
    0x0EBA, // Не глупи, Хиттян.
    0x0ED9, // Мы никогда не ходили в школу вместе, Хиттян~.
    0x0F2A, // Я собираюсь спросить, зачем нам это делать, но тут до меня доходит: они считают меня своим другом, как Миша ранее и сказала. И они хотят стать со мной ещё более близкими друзьями.
    0x106C, // Странно, я никогда не думал о них в таком ключе. Или о ком-либо ещё, встреченном за последнюю неделю. Это действительно так просто?
    0x1158, // Настолько легко…
    0x1179, // Ладно, тогда идём.
    0x119A, // Сидзунэ хитро улыбается и убирает руки за спину.
    0x11F3, // Ха-ха-ха~! Это здорово, Хиттян~! Ладно, ладно, но сначала~! Ты подал отличную идею, Ситтян она очень понравилась… Так что~! время сыграть в игру!
    0x12F3, // О нет.
    0x12FE, // У Ситтян в одной руке купюра в тысячу иен, Хиттян~! Если угадаешь в какой, то заберёшь себе! А если нет…
    0x13B8, // То понесёшь все наши книжки до школы~! Верно, Ситтян~? Верно~!
    0x1425, // Они с Сидзунэ обмениваются кивками.
    0x1467, // Ладно, Хиттян~! Приготовься~!
    0x149B, // Таща три портфеля вместо одного, я размышляю о том, что за день ждёт меня. Ждёт нас.
    0x1531, // Я вижу суетящихся на школьном дворе учеников, возможно занятых подготовкой своих проектов.
    0x15D9, // Фестиваль уже на носу. Это значит, что могут быть только две причины, по которым им может понадобиться моя помощь.
    0x16A8, // Либо осталось совсем немного работы и им просто нужна помощь, чтобы закончить стандартные проверки, которые они обязаны провести.
    0x1797, // Либо осталась гора работы и Сидзунэ не показывает вида, в то время как лавина нагромождавшейся отложенной работы угрожает всех нас смести.
};

#endif // KS_CHOICE_DODGE_SUBJECT_RU_TL_INDEX