#ifndef KS_A1_MONDAY_IN_THE_NURSERY_RU_TL_INDEX
#define KS_A1_MONDAY_IN_THE_NURSERY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_BC7A1E75_ru_intl[] = {
    0x0000, // Мы спускаемся на самый нижний этаж, ещё ниже того вестибюля, где я встретил Муто.
    0x0093, // Как и везде в этой школе, в столовой много свободного места, а её современное убранство контрастирует со старинной архитектурой самого здания.
    0x0199, // Большие арочные окна смотрят во двор, в сторону главных ворот.
    0x020B, // Это – столовая~!
    0x0229, // Энергичное утверждение столь очевидного факта заставляет людей вокруг оглянуться на нас, но Мише, кажется, всё равно, и мы спокойно встаём в очередь.
    0x033A, // Меню поражает меня широтой ассортимента, но вскоре я понимаю, что большинство блюд предназначены для учеников с определённой диетой.
    0x042F, // Как мило. Я будто снова попал в больницу, где порции отмерялись с математической точностью, чтобы выдать нужную пациенту дозировку.
    0x0520, // Я выбираю себе что-то наугад и, последовав за Сидзунэ к столику, сажусь напротив неё.
    0x05BA, // Пока я безразлично ковыряюсь в еде, которую предпочёл бы вовсе не есть, Миша толкает меня в бок и указывает на Сидзунэ.
    0x0692, // …
    0x0696, // Я не знаю языка жестов, так что всё равно ничего не понимаю.
    0x0702, // Но, может быть, так принято – смотреть не на переводчика, а на того, кто к тебе обращается?
    0x07A5, // Ты хочешь о чём-нибудь узнать?
    0x07DC, // Например?
    0x07EE, // О чём угодно! Ведь мы твои проводники, так что не стесняйся спрашивать, если есть о чём~!
    0x088D, // Девочки начинают оживлённо жестикулировать, косясь на меня, но Миша воздерживается от перевода.
    0x093E, // Может, обсуждают какие-то девчачьи секреты?
    0x098E, // …
    0x0992, // Я быстро понимаю, что беседы на языке жестов недостаточно, чтобы заполнить тишину.
    0x0A29, // Мы рано возвращаемся в класс, но, оказывается, мы там уже не первые.
    0x0AA3, // Темноволосая девочка, которую я заметил ранее, склонилась над своей партой в последнем ряду.
    0x0B4D, // Она слегка вздрагивает, когда Миша вламывается в класс с изяществом носорога.
    0x0BDC, // Она ещё глубже вжимается в стул. Я издалека чувствую исходящее от неё напряжение, будто из-за нашего присутствия она медленно превращается в камень.
    0x0CEC, // Не обратив на это никакого внимания, Сидзунэ и Миша проходят мимо неё на свои места, не переставая жестикулировать.
    0x0DBF, // Но я продолжаю думать о ней, пока класс медленно заполняется учениками и, наконец, не приходит учитель.
    0x0E7B, // Странно вновь вливаться в ритм школьной жизни: будто мой мозг помнит, что это такое, но тело позабыло, как это делается.
    0x0F54, // К концу занятий я начинаю зевать и считать оставшиеся минуты.
    0x0FC5, // Нехорошо так уставать в первый же день.
    0x100D, // Наверное, всё дело в долгом пребывании в больнице. Я физически ощущаю вялость и бессилие.
    0x10B0, // Наконец-то звенит последний звонок.
    0x10F2, // Занятия на сегодня окончены.
    0x1127, // Сидящие рядом Миша и Сидзунэ обмениваются несколькими жестами. После небольшой заминки Миша поворачивается ко мне.
    0x11FC, // …
    0x1200, // К сожалению, мы не сможем остаться и показать тебе окрестности, Хиттян. У нас много работы на сегодня, поэтому нам уже пора.
    0x12E0, // …
    0x12E4, // Ты и сам найдёшь дорогу, я не сомневаюсь.
    0x132E, // Эй, постойте! Учитель сказал, что мне надо зайти в медкабинет. Где он находится?
    0x13BE, // Вот как? Ну, думаю, это мы сможем тебе показать~!
    0x1414, // Пошли, у медиков отдельное здание, так что нам надо выйти на улицу.
    0x148D, // Мы присоединяемся к потоку учеников, спускающихся вниз по лестнице и далее, на улицу. По пути девочки показывают кабинеты других старших классов, находящиеся на нашем этаже.
    0x15CB, // Выйдя на улицу, они направляются к небольшому строению рядом со школой.
    0x164E, // Оно построено в том же стиле, что и главное здание, поэтому кажется его частью.
    0x16DD, // …
    0x16E1, // Это административный корпус. Внутри – много важных служебных помещений, таких как офис интерната «Ямаку» и медкабинет. Тут даже бассейн есть!
    0x17E6, // Это тоже служебное помещение?
    0x181D, // …
    0x1821, // Не глупи, Хиттян! Он нужен для физиотерапии, конечно.
    0x1881, // В общем, медицинские кабинеты тоже находятся тут. Кабинет, который тебе нужен, – на первом этаже.
    0x1932, // Дальше ты и сам найдёшь дорогу, да~? Тогда мы пойдём! До завтра!
    0x19A3, // Ага, спасибо. Пока.
    0x19C5, // Целое здание для персонала, никак не связанного с обучением?
    0x1A34, // Наверное, для такого места это необходимо.
    0x1A82, // Я вхожу внутрь, надеясь, что это и правда будет лишь краткий визит, как говорил учитель.
    0x1B21, // На белой двери с зелёным крестом прибита табличка с надписью «Главный фельдшер» и именем.
    0x1BC6, // Я стучу в дверь, и тут же из-за неё раздаётся неразборчивый возглас.
    0x1C41, // Приняв его за приглашение войти, я открываю дверь.
    0x1C9D, // Комната небольшая, и в ней странно пахнет. Когда я вхожу, ко мне разворачивается сидящий в офисном кресле приветливый мужчина.
    0x1D84, // На его столе порядок, но под ним стоит корзина, переполненная использованными медицинскими принадлежностями, на столе виднеется по меньшей мере дюжина следов от кружки с кофе.
    0x1EC7, // Добрый день! Чем могу помочь?
    0x1EFC, // Он выглядит молодо и немного сурово, однако ямочки на щеках стирают это впечатление, когда он улыбается.
    0x1FBB, // Кхм, это вы фельдшер?
    0x1FE1, // Он улыбается с видом человека, который не раз слышал подобный вопрос.
    0x2060, // Ну да. Так написано на двери, разве нет?
    0x20A7, // Можешь обращаться ко мне по имени или просто «фельдшер», как и все остальные.
    0x2134, // Конечно. Я прогоняю смущение, поняв, что мне следует пожать протянутую им руку.{w} Его рукопожатие оказывается крепким и дружеским.
    0x2222, // Да… эм-м, я новый ученик, и мой классный руководитель сказал зайти к вам. Меня зовут Хисао Накай.
    0x22D1, // Он оживляется и щёлкает пальцами.
    0x230F, // А, тот самый Накай! Я читал твою медицинскую карту с утра.
    0x2377, // Хроническая аритмия и врождённый порок сердца, не так ли?
    0x23E0, // Он жестом указывает мне сесть в кресло напротив него.
    0x2442, // Ну да.
    0x244D, // Отлично. Думаю, тебе уже вкратце рассказали о школе, так что я быстренько пройдусь по основным пунктам.
    0x2509, // У нас тут имеются все необходимые службы, в основном предназначенные для физиотерапии и тому подобного.
    0x25C8, // Поблизости всегда есть кто-нибудь из персонала, даже ночью, так что не стесняйся обращаться к нам, если возникнут проблемы.
    0x26A9, // Тот самый знаменитый медперсонал с круглосуточным дежурством.
    0x271D, // Ух ты, прямо как в больнице.
    0x274F, // Ну, не совсем. К примеру, мы здесь не проводим операции на мозге.
    0x27C3, // Его шутка столь неуместна, что я не понимаю, зачем он вообще это сказал.
    0x2845, // Да уж… Просто мне непривычно такое количество медперсонала в школе.
    0x28C3, // Скоро привыкнешь.
    0x28E4, // Я не так в этом уверен, однако не считаю нужным оповещать его об этом.
    0x2962, // Давай-ка я снова найду твою медкарту…
    0x29A8, // Пока он ищет что-то в компьютере и тасует пачки бумаг на столе, я осматриваюсь вокруг.
    0x2A44, // Обстановка представляет собой воплощённую заурядность.
    0x2AAC, // Бежевые стены и потолок, пол, покрытый тёмно-серым ламинатом, и оборудование, которое ожидаешь увидеть в кабинете у школьного медработника.
    0x2BAC, // А на стенах висят нелепые плакаты, призывающие меня правильно питаться – три раза в день и полным набором продуктов.
    0x2C82, // Фельдшер с довольной улыбкой извлекает из кипы бумаг толстенную папку и открывает её.
    0x2D20, // Так, ты уже принимаешь лекарства от аритмии, просто не забывай делать это утром и вечером, иначе от них будет мало пользы.
    0x2DFD, // Помимо этого… ты занимаешься спортом? Активным? Например, не знаю… боксом?
    0x2E87, // Он улыбается собственной шутке, но я её игнорирую.
    0x2EE3, // Ну, я, бывало, играл в футбол с одноклассниками.
    0x2F39, // Ясно. Боюсь, мне придётся порекомендовать тебе воздержаться от этого, по крайней мере на время обучения здесь.
    0x3003, // Угу.
    0x300B, // Он приподнимает брови в ответ на мою вялую реакцию, но сейчас меня и в самом деле не особенно заботит запрет пинать мяч.
    0x30E5, // Думаю, я делал это не из-за горячей любви к спорту, а просто чтобы убить время.
    0x3172, // Любой удар в область сердца для тебя очень опасен, и рисковать схлопотать очередной приступ было бы не очень хорошей идеей.
    0x3254, // Предыдущий приступ тоже был вызван ударом? В бумагах об этом не упоминается.
    0x32E0, // Ну… не совсем.
    0x32FB, // Я уклоняюсь от ответа, и он серьёзно смотрит на меня поверх бумаг.
    0x3373, // Но всё равно тебе нужно поддерживать форму и кое-какие упражнения пойдут на пользу.
    0x340C, // Как я уже сказал, у нас есть кабинет физиотерапии, но я не думаю, что в твоём случае она столь необходима.
    0x34CA, // Просто регулярно выполняй простые упражнения.
    0x3520, // Небольшие прогулки или даже бег трусцой, скакалка и тому подобное. Например, плавание. У нас тут есть бассейн.
    0x35E8, // Мне уже сказали.
    0x3606, // Да? Очень хорошо.
    0x3625, // В любом случае, хоть я и уверен, что тебе это уже говорили, будь осторожен и не переутомляйся.
    0x36CE, // Он грозит пальцем, чтобы подчеркнуть важность своих слов. Впрочем, я действительно слышал это уже тысячу раз.
    0x3796, // Никакого ненужного риска. Береги себя.
    0x37DD, // Хорошо.
    0x37EB, // Он ещё раз пробегает глазами по моим бумагам и откладывает их на край стола, по-видимому удовлетворённый.
    0x38AC, // Хорошо. Тогда всё. Приходи, если ещё что-нибудь понадобится.
    0x3919, // Меня выпроваживают так быстро, что я даже не успеваю опомниться. И правда, краткий визит.
    0x39BB, // Хм, интересно…
    0x39D7, // Спросить о библиотеке.
    0x3A01, // Спросить о глухоте Сидзунэ.
    0x3A34, // Думаю, я уже знаю всё, что мне нужно.
};

#endif // KS_A1_MONDAY_IN_THE_NURSERY_RU_TL_INDEX