#ifndef KS_A1C3O1_RU_TL_INDEX
#define KS_A1C3O1_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1D83B_ru_intl[] = {
    0x0000, // Она или издевается надо мной, или пытается спровоцировать.
    0x006C, // Но мне нечего терять, поэтому следует на самом деле попробовать новую тактику.
    0x00FC, // Может, если я распределю свои силы и попробую контролировать больше территорий, то смогу получить преимущество?
    0x01CA, // Сидзунэ сосредоточилась на завоевании целых народов, так что если я пожертвую своими владениями на материке, то смогу завоевать больше маленьких стран.
    0x02E2, // Стоит попытаться.
    0x0303, // Но через несколько ходов я всё равно проигрываю.
    0x035C, // Сидзунэ поправляет очки и празднует победу, торжествующе взмахнув в воздухе кулачком.
    0x03FB, // …
    0x03FF, // Я победила, я победила~! Ура~!
    0x0433, // Спасибо, я и без перевода понял.
    0x046D, // Ва-ха-ха~! Не расстраивайся так, Хиттян! Ты, как мне кажется, старался изо всех сил!
    0x0501, // Однако твоих сил пока недостаточно~! Уж кто-кто, а я в таком разбираюсь! Ты неплохо справлялся, особенно учитывая то, что сегодня играл впервые!
    0x0605, // …
    0x0609, // Хиттян, атаковать Исландию и Северную Африку одновременно было смелым ходом. Ситтян впечатлена~!
    0x06BB, // …
    0x06BF, // Великие люди – это те, кто отваживаются на смелые ходы и преодолевают все препятствия~! Полпути уже пройдено; разве это не замечательно, Хиттян?
    0x07C6, // …
    0x07CA, // Но одного лишь потенциала недостаточно! В нём нет смысла, если ты не осмелишься сделать первый шаг и идти вперёд. Я хотела бы увидеть больше.
    0x08CA, // Ты права, Ситтян~, но ты так требовательна…
    0x0919, // …
    0x091D, // …
    0x0921, // Сидзунэ подаётся вперёд, и её игривость внезапно сменяется той серьёзностью, которую я от неё ожидал с самого начала.
    0x09F8, // …
    0x09FC, // Хиттян, ты хочешь присоединиться к Школьному совету?
    0x0A5D, // Не теряет время попусту, да? Но…
    0x0A98, // Я в школе только второй день и сомневаюсь, что стоит так скоро делать какой-либо выбор.
    0x0B36, // Я ещё даже не взглянул на остальные кружки.
    0x0B85, // Хотя я был бы не прочь проводить время с Сидзунэ и Мишей.
    0x0BEC, // Мне нужно больше времени, прежде чем я смогу решить наверняка.
    0x0C5E, // Возможно. Я сообщу попозже.
    0x0C90, // …
    0x0C94, // Хорошо, Хиттян~! Но я надеюсь, ты сказал это не для того, чтобы не расстраивать нас.
    0x0D29, // Ни в коем случае.
    0x0D48, // Правда~?
    0x0D57, // Хиттян, если ты соберёшься сказать это, это должно быть окончательное решение и безо всяких сомнений~!
    0x0E12, // Знаю, знаю. Я по меньшей мере должен взять реванш за сегодняшнее.
    0x0E88, // Сидзунэ озорно улыбается, поворачивая нож в ране, которую нанесло мне поражение.
};

#endif // KS_A1C3O1_RU_TL_INDEX