#ifndef KS_CHOICE_KICK_SHIZU_RU_TL_INDEX
#define KS_CHOICE_KICK_SHIZU_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_6F488CFB_ru_intl[] = {
    0x0000, // Да уж, на этот раз они переступили черту. Пронырливые надоеды.
    0x0071, // Ничего.
    0x007F, // Правда~, Хиттян? А по мне, так не похоже, что «ничего».
    0x00DF, // …
    0x00E3, // Такой длинный ряд бутылок, правда~? Правда~! Что это такое, Хиттян?
    0x015A, // Просто кое-какие вещи.
    0x0183, // …
    0x0187, // Похоже, что это больше, чем «просто кое-какие вещи»…
    0x01E7, // Я не могу винить их за такое поведение. Миша просто говорит за Сидзунэ, а Сидзунэ просто по природе своей любопытна. И всё же я предпочёл бы, чтобы они перестали уже копать под меня и поняли намёк. Но Миша его не улавливает, а Сидзунэ – не слышит.
    0x03A3, // Поэтому они продолжают напирать.
    0x03E0, // Это вас совершенно не касается.
    0x041A, // Вам разве не пора идти? Моя комната – моё личное пространство, знаете ли.
    0x049F, // Сидзунэ, похоже, воспринимает это как вызов.
    0x04F0, // …
    0x04F4, // Что это значит, Хиттян? Когда кто-то видит что-то интересное, первое желание – спросить, что это, это ведь очевидно. Что в этом плохого?
    0x05E8, // Я ведь уже сказал, здесь не на что смотреть.
    0x0637, // Хиттян, я думаю, Ситтян просто беспокоится.
    0x0686, // То, что находится в моей комнате, – абсолютно не ваше дело, вот и всё.
    0x0703, // Но…
    0x070B, // Чёрт возьми! Иногда мне хочется, чтоб вы просто перестали дурачиться. Это не всегда весело, вам это известно?
    0x07D1, // Я говорю это намного более резко, чем хотел, почти крича Мише прямо в лицо. Она вздрагивает и останавливается на полужесте, и даже Сидзунэ реагирует на это, хоть и не слышит меня.
    0x0914, // Полагаю, моё злобное лицо говорит само за себя.
    0x096A, // После того как Миша медленно заканчивает перевод, девушки с сожалением смотрят друг на друга.
    0x0A16, // …
    0x0A1A, // Ладно, Хиттян, мы оставим тебя в покое.
    0x0A60, // Впервые я слышу, как Миша говорит без своей привычной скачущей интонации. Это так странно, что у меня возникает желание извиниться, но они уже повернулись к выходу.
    0x0B8B, // Когда наступает тишина, я начинаю всё больше и больше жалеть о своих словах.
    0x0C16, // Девушки молча уходят, и, постояв в своей комнате ещё немного, я одеваюсь и отправляюсь вслед за ними.
};

#endif // KS_CHOICE_KICK_SHIZU_RU_TL_INDEX