#ifndef KS_A1C6O1_RU_TL_INDEX
#define KS_A1C6O1_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1E37E_ru_intl[] = {
    0x0000, // Когда я не знаю, что делать, я стараюсь занять себя чем-нибудь привычным.
    0x0084, // Как и сейчас.
    0x009C, // Я уже начал читать одну из библиотечных книг и принёс её с собой в школу, чтобы скоротать время между уроками.
    0x0164, // Я нахожу страницу со сложенным уголком-закладкой и начинаю оттуда.
    0x01DF, // Миша и Сидзунэ всё ещё возбуждённо спорят, может быть до сих пор о ресторанах.
    0x026D, // Если я сейчас попытаюсь заговорить с ними, они просто втянут меня в свой спор или, того хуже, опять попытаются затащить в Школьный совет.
    0x0366, // Поскольку поблизости нет никого, кто мог бы присоединиться к их беседе, Миша перестаёт озвучивать дискуссию.
    0x042E, // Интересно, почему её тянет переводить на язык жестов даже то, что Сидзунэ знать необязательно, или, что ещё удивительнее, когда её даже нет рядом? Любопытная привычка.
    0x055E, // Мне становится сложно сосредотачиваться на книге, перерыв манит меня прочь из скучного класса. Я повинуюсь его зову и отправляюсь в столовую.
    0x0662, // Миша и Сидзунэ, кажется найдя компромисс, следуют за мной, продолжая энергично разговаривать.
};

#endif // KS_A1C6O1_RU_TL_INDEX