#ifndef KS_A1_THURSDAY_EVENT_HORIZON_RU_TL_INDEX
#define KS_A1_THURSDAY_EVENT_HORIZON_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_F31BA167_ru_intl[] = {
    0x0000, // Может, сачкует где-нибудь~! Бесполезная женщина~!
    0x0059, // Ханако резко кивает и торопливо уходит, видимо во избежание дальнейших контактов с Сидзунэ. К сожалению, это вновь переключает всё их внимание на меня.
    0x016E, // Но Хиттян не бесполезный, правда? Правда? Он сам так сказал~! Ва-ха-ха~!
    0x01EC, // Я понимаю, к чему они клонят, и после вчерашнего совсем не хочу в этом участвовать.
    0x0282, // Ну, удачи вам с подготовкой…
    0x02B7, // Я начинаю собирать портфель, готовый рвануть к выходу.
    0x031B, // К сожалению, он находится в противоположном конце комнаты.
    0x0387, // Короткая дистанция до двери кажется мне бескрайней пустыней.
    0x03F8, // Сидзунэ с Мишей не спеша выполняют манёвр, с тревожной предусмотрительностью отрезая мне путь к отступлению, как при перестрелке между кораблями.
    0x0505, // Думаю, Ситтян хочет сказать, что тебе следует нам помочь, Хиттян~!
    0x057C, // Ничего себе, а я бы и не понял! Она так хорошо скрывает свои намерения.
    0x05FB, // Но~! В этом её намерение и заключается, поэтому, пожалуйста, помоги. Мы не успеваем, нам нужно собрать киоски для фестиваля, почти все из них – самим, представляешь?
    0x0724, // Сколачивать доски, снова и снова, часами, – это очень трудно!
    0x0793, // Я настолько привыкла к этим движениям, что махала руками так, будто держу молоток, прямо на уроке, и даже не заметила!
    0x0868, // Она демонстративно стучит по парте.
    0x08AA, // Так монотонно, ненавижу! А вчера я сколотила все лежащие друг на друге доски…
    0x0938, // Получилась просто пачка прибитых друг к другу досок, мне пришлось их разъединять, притом все на меня ругались и смеялись надо мной~!
    0x0A29, // Эм…
    0x0A31, // Так что…
    0x0A42, // Она хватает меня за плечо и ухмыляется, озорно проводя языком по зубам.
    0x0AC4, // У тебя есть на сегодня планы, Хиттян?
    0x0B07, // Хотела бы я знать~.
    0x0B29, // Разумеется, у меня есть планы…
    0x0B62, // Правда~?
    0x0B71, // Ты собираешься нам помочь, да?
    0x0BA8, // Я замечаю, что её руки постоянно двигаются.
    0x0BF7, // Она переводит всё, что мы говорим, чтобы Сидзунэ могла понять.
    0x0C68, // Сидзунэ какая-то тихая. Она всё ещё злится? Ну, хоть немного – наверняка. Это по глазам видно. Но это может оказаться лишь ещё одним способом внушить мне чувство вины и заставить помочь ей.
    0x0DBE, // Надо найти какой-нибудь выход.
    0x0DF6, // Эй, мне уже пора, в библиотеку. Понимаете, домашка…
    0x0E53, // Мне надо идти, ясно? Мне надо быть прилежным, потому что я новенький и нужно произвести хорошее впечатление, верно? Да…
    0x0F2C, // В общем, увидимся!
    0x0F4D, // Я поворачиваюсь, чтобы дёрнуть к двери, но Сидзунэ преграждает мне путь со скрещенными на груди руками и безжалостным выражением на лице.
    0x1049, // Она грозит мне пальцем и принимается жестикулировать Мише с видом командира отряда, отдающего приказания солдатам.
    0x111E, // Не было похоже, чтобы ты особо торопился в библиотеку, Хиттян~!
    0x1190, // Вот именно, Ситтян~, очень похоже, что он собирался бездельничать весь остаток дня.
    0x1227, // Ха-ха-ха~! Ва-ха-ха~! Ты окружён~!
    0x125F, // …
    0x1263, // Пойдём в кабинет Школьного совета~!
    0x12A4, // Она издаёт смешок, а затем разражается хохотом.
    0x12FB, // Прости, Хиттян, мне немножко стыдно, но ведь так будет лучше для всех, правда?
    0x1387, // …
    0x138B, // Правильно, Ситтян! Да~, и это тоже аргумент.
    0x13D9, // …
    0x13DD, // Да, это всем выгодно, это решает все наши проблемы.
    0x1439, // …
    0x143D, // Да, да~!, Я тоже надеялась, что он оценит наши усилия.
    0x149B, // Они придвигаются всё ближе друг к другу, будто собираясь наброситься.
    0x151B, // Эй, народ, ну ведь двое на одного – нечестно?
    0x156C, // …
    0x1570, // Она продолжает невозмутимо смотреть на меня, а затем зловеще улыбается.
    0x15F4, // Ну давай, у нас много работы! Пойдём в кабинет Школьного совета~!
    0x1669, // Блин, даже не знаю…
    0x168D, // Миша смеётся.
    0x16A6, // Дежавю~?
    0x16B5, // Она сдавленно хихикает, прежде чем снова засмеяться.
    0x1716, // Ха-ха-ха, знаешь, в гороскопе было сказано, что у меня сегодня будет удачный день.
    0x17A9, // И теперь, когда тебе придётся помогать—{w=.5}{nw}
    0x17FD, // Сидзунэ делает несколько быстрых жестов.
    0x1849, // Точно~! Я имела в виду, что теперь, когда ты исключительно по собственной воле решил нам помочь, я смогу немного расслабиться! Повезло~, да?
    0x1944, // Я открываю рот, чтобы возразить, но понимаю, что в этом нет никакого смысла.
    0x19CD, // Я снова начинаю придумывать выход из всего этого. Нет, их действия явно спланированы, нет смысла пытаться с ними дискутировать.
    0x1AB6, // Нельзя договориться с сумасшедшим. Я хмурюсь, но они даже не замечают моего недовольства, подтверждая этим мои подозрения.
    0x1B97, // Сейчас они довольно расслаблены. Наверное, думают, что уже победили, поэтому ослабили бдительность.
    0x1C4E, // Весьма самонадеянно.
    0x1C75, // Они проходят передо мной вперёд и выходят за дверь.
    0x1CD3, // А я тайком отступаю обратно в класс, в момент, когда они, шагая в коридор, поворачивают к лестнице.
    0x1D85, // Я облегчённо вздыхаю и поспешно начинаю собирать остальные вещи, чтобы сбежать.
    0x1E18, // Дверь класса резко захлопывается.
    0x1E57, // …
    0x1E5B, // Не очень красиво с твоей стороны. Ха-ха-ха, но ты нас подловил. Правда, Ситтян?
    0x1EE7, // …
    0x1EEB, // Точно, точно… …Ха-ха-ха!
    0x1F18, // Зачем ты так? Я думала, ты сказал, что поможешь нам!
    0x1F74, // И тут же решил слинять! Думал, тебе это так просто сойдёт с рук, да?
    0x1FEC, // Негодование проходит, и она начинает истерически хохотать, успокаиваясь только после раздражённого взгляда Сидзунэ.
    0x20C4, // А, ой… Да~, ты думал, что тебе это сойдёт с рук! Но преступник всегда возвращается на место преступления!
    0x2181, // Во-первых, я даже не успел выйти из класса. Нет, постойте; во-первых, я даже не соглашался помогать.
    0x2233, // Не слишком ты сообразительный, да, преступничек? Думал, что так просто сможешь увильнуть от обязанностей… Как низко, Хиттян~!
    0x2318, // Я – преступник? Что я сделал? Каково обвинение? В чём я виноват?
    0x238B, // Это суду решать, преступник! Не думаю, что мы обязаны тебе рассказывать!
    0x240E, // Кроме того, преступник тут ты, так что сам знаешь, что ты сделал!
    0x2482, // Ты читала «Процесс» Кафки?
    0x24B3, // Нет, что это, Хиттян~? Какое это имеет отношение к нашему случаю?
    0x2527, // Я его прочитал несколько месяцев назад. Это о людях, которые устроили инсценированный суд парню, который просто хотел жить своей жизнью. Они не захотели оставить его в покое, а он не мог бороться с властью.
    0x269D, // …
    0x26A1, // …
    0x26A5, // Хиттян, к чему это вообще?
    0x26D4, // Эй~! Что это значит?
    0x26F7, // Она снова поворачивается ко мне после продолжительного обмена жестами с Сидзунэ.
    0x278D, // Знаешь, мы обе в тебе разочарованы. Ты нас подвёл, Хисао.
    0x27F3, // …
    0x27F7, // Всю команду.
    0x280E, // …
    0x2812, // Не оправдал доверия. И надежд~.
    0x284A, // …
    0x284E, // Разве так можно обращаться с людьми? Убегать от ответственности, бросать товарищей?
    0x28E8, // Мы думаем, что ты нам задолжал соблюдение своих обязательств.
    0x2959, // Что? Но я ни на что не подписывался~!
    0x299A, // У меня перехватывает дух от такой несправедливости, и я тут же начинаю задыхаться.
    0x2A31, // …
    0x2A35, // Это неправда, Хиттян! Ты сказал, что ты не бесполезный, ты точно так сказал, точно, точно, точно~!
    0x2AE2, // Отвечай за свои слова~! Докажи, что ты парень не бесполезный!
    0x2B50, // Если попытаешься увильнуть, твоя честь окажется навсегда запятнана~!
    0x2BCF, // Так что весь остаток дня мы проведём вместе, втроём, и будем усердно работать!
    0x2C5D, // …
    0x2C61, // Ты нас не обманешь!
    0x2C84, // Ты должен быть счастлив, что сослужишь своей школе отличную службу. Спрашивай не что школа может сделать для тебя…
    0x2D57, // А что ты можешь сделать для школы!
    0x2D95, // Ха-ха-ха!
    0x2DA5, // Ха-ха-ха-ха-ха-ха-ха!
    0x2DC9, // Как угнетающе.
    0x2DE4, // Взбодрись, взбодрись, Хиттян!
    0x2E1A, // Она хлопает меня по спине достаточно сильно, чтобы вышибить воздух из лёгких. Я пытаюсь перевести дух.
    0x2ED5, // К тому же разве ты не рад тому, что тебе удастся провести день с двумя прелестными девушками?
    0x2F7E, // Ха-ха-ха-ха!
    0x2F93, // Наверное, они правы. Кто меня только за язык тянул?
    0x2FEF, // Смирившись с судьбой, я следую за ними в кабинет Школьного совета…
    0x306A, // …И забиваю последний гвоздь в киоск. Это заняло весь день, и время обеда почти прошло. Но теперь всё готово.
    0x312E, // Сидзунэ достаёт рулетку и небольшой уровень и принимается тщательно проверять его.
    0x31C8, // Она довольно улыбается и подзывает Мишу.
    0x3213, // …
    0x3217, // Она говорит, что ты молодец. Ты даже заслужил подарок.
    0x3279, // Ого, я тоже впечатлена. И так быстро! Ты раньше этим занимался?
    0x32EA, // Нет. Никогда.
    0x3302, // Никогда раньше.
    0x331F, // И больше никогда не буду.
    0x334D, // …
    0x3351, // Ну, наш норматив – шесть киосков в день. Через несколько минут мы с Ситтян закончим вот этот.
    0x33FA, // Значит~… ещё четыре!
    0x3420, // Она говорит, у нас хороший темп~!
    0x345B, // Разве не весело?
    0x3479, // Что?
    0x3481, // Я бы мог придумать для себя миллион других занятий, но полагаю, что каждый должен внести свою лепту в подготовку к фестивалю, даже я.
    0x3572, // Вам крупно повезло, что я вам помогаю: если бы я захотел, то с лёгкостью бы уклонился от всего этого.
    0x3627, // …
    0x362B, // Правда, Хиттян?
    0x3647, // …
    0x364B, // Ва-ха-ха~! Ситтян думает, что ты просто треплешь языком! У японцев нет рефлекса «бороться или бежать»~!
    0x3704, // Сидзунэ с хитрым видом складывает пальцы домиком.
    0x3760, // …
    0x3764, // Точно~! Точно, точно~! Если бы ты захотел сбежать, то сделал бы это сразу~! Тем и отличаются решительно настроенные люди: у них нет сомнений, нет сожалений!
    0x387A, // …
    0x387E, // Может, говорить тебе это было плохой идеей, поскольку теперь Хиттян знает, что делать в следующий раз~.
    0x3939, // Но уже то, что она спокойно мне это говорит, показывает, что она сомневается в моей решимости.
    0x39E3, // Это только подзуживает меня, так как я уже жду возможности, чтобы снова взбунтоваться. Но, если это случится, она может суметь опять меня как-нибудь подловить.
    0x3B04, // …
    0x3B08, // Ситтян говорит, что теперь она довольна.
    0x3B52, // Гораздо, гораздо позже этим вечером мы смотрим на шесть готовых киосков.
    0x3BD7, // Гордые проделанной работой, мы сидим и молча взираем на плоды своих трудов. Просто любуемся.
    0x3C80, // Я понимаю, что мне сильно хочется пить.
    0x3CC7, // Эй, а в коридоре ведь есть торговый автомат? Они весь день включены, да?
    0x3D48, // Да, и напитки очень дешёвые. В такие дни мы обычно что-нибудь берём оттуда.
    0x3DCF, // Я шарю в кармане и нахожу монетку в сто иен.
    0x3E1E, // Этого хватит? Меня жажда замучила.
    0x3E5D, // Сто иен? Тебе хватит на любой напиток.
    0x3EA2, // Хорошо, очень хорошо.
    0x3EC9, // …
    0x3ECD, // А, подожди секундочку.
    0x3EF6, // М-м? Что такое, Ситтян? Хочешь, чтобы он и тебе купил попить? Ха-ха-ха!
    0x3F71, // …
    0x3F75, // Хиттян, ты сегодня нам очень помог, поэтому я – то есть Ситтян – тебя угощу.
    0x3FFF, // Эй, а меня?
    0x4012, // …
    0x4016, // Что бы ты хотел? Я и сама пить хочу?
    0x4055, // Я тоже!
    0x4062, // М, не знаю. Что угодно. Пусть будет газировка со вкусом дыни.
    0x40CF, // …
    0x40D3, // Эй, погоди, Ситтян! Я тоже хочу!
    0x410B, // Ну-у!..
    0x4116, // Знаешь, в такие моменты я думаю, что она меня просто дразнит.
    0x4184, // Наверное, так и есть. Уверен, она и тебе что-нибудь принесёт, так?
    0x41F9, // Да, обычно приносит. Но… как знать…
    0x423B, // Хех.
    0x4243, // Сидзунэ возвращается с двумя дынными газировками и банкой фруктового сока.
    0x42CE, // Она протягивает одну газировку мне, другую – Мише.
    0x432B, // Спасибо, Ситтян~! Я искренне верила, что ты и мне принесёшь, я знала, что могу на тебя рассчитывать! Ва-ха-ха-ха!
    0x43F2, // Но как ты догадалась, что это именно то, чего я хотела? Я обычно покупаю что-нибудь другое.
    0x4495, // …
    0x4499, // Что? Ты знала, что я захочу попробовать? И что мне нравятся такие детские напитки? Ха-ха-ха-ха!
    0x4542, // Ха-ха-ха-ха!
    0x4557, // Я кивком благодарю Сидзунэ, а она, улыбаясь, кивает в ответ.
    0x45C3, // …
    0x45C7, // Эй, Хиттян…
    0x45DD, // Что?
    0x45E5, // …
    0x45E9, // Мы уже провели вместе много времени. И уже успели сделать так много.
    0x4665, // Надо уже перестать ходить вокруг да около. Я хочу сказать, что…
    0x46D9, // Звучит так, будто она собирается пригласить меня на свидание, но этого не может быть. Тем не менее сердце у меня колотится, как отбойный молоток. Чёрт, напоминает похожую сцену, произошедшую ранее в этом году.
    0x4854, // Я пытаюсь что-то сказать, но мозг не может решить, то ли останавливать её, то ли просить продолжать.
    0x4908, // Я чувствую, что краснею до кончиков ушей.
    0x4953, // …
    0x4957, // Я пытаюсь сказать…
    0x497B, // Не хочешь ли ты вступить в Школьный совет?
    0x49C8, // Блин, вот облом.
    0x49E5, // Ха-ха-ха! Ха-ха-ха-ха! Ха-ха-ха-ха-ха! Ва-ха-ха! Ха-ха-ха-ха!
    0x4A49, // Ты думал, она хочет пригласить тебя на свидание, Хиттян?
    0x4AAF, // Ха-ха-ха-ха! Ха-ха-ха! Ха-ха-ха! Ха-ха-ха-ха!
    0x4AF9, // Ха-ха-ха-ха-ха-ха-ха-ха!
    0x4B22, // Мне очень неловко, я чувствую, как краснею ещё больше.
    0x4B84, // Сидзунэ тоже пытается скрыть румянец после Мишиного перевода, а потом кладёт передо мной несколько листов бумаги.
    0x4C56, // …
    0x4C5A, // Ну так как? Все бланки здесь.
    0x4C8E, // И ты всё равно уже сидишь. И ты как дома. Напитки и всё такое~!
    0x4CFC, // …
    0x4D00, // Что скажешь?
    0x4D17, // Она немного успокаивается и спрашивает чуть более торжественно.
    0x4D8E, // Хиттян, каково твоё решение?
    0x4DC2, // Тебе ведь не так уж всё это не понравилось, правда?
    0x4E1E, // Я более чем удивляюсь такой внезапной смене тона. Даже не совсем понимаю, как следует реагировать.
    0x4ED2, // Прежде всего, она не орёт без соблюдения какого-либо такта.
    0x4F3E, // Прежде, я уверен, она заранее знала, что я отвечу «нет».
    0x4FA2, // В этот раз, похоже, она настроена серьёзно.
    0x4FF0, // Думаю, тебе всё же стоит вступить. Не только чтобы помогать нам, а… ты ведь всё равно с нами тусуешься.
    0x50AA, // Думаю, Ситтян тоже была бы рада, если б ты вступил. Ты ведь нас не ненавидишь, правда?
    0x5143, // Никому не станет хуже, если ты вступишь. И мне будет приятно.
    0x51B1, // Похоже, она с трудом подбирает слова, что кажется странным для обычно столь разговорчивой Миши.
    0x5260, // По какой-то причине от этого меня охватывает чувство, близкое к тревоге.
    0x52E4, // Я перевожу взгляд на Сидзунэ, которая неуверенно на меня смотрит, рассеянно стирая грязь с ногтей.
    0x5398, // Если ты не захочешь вступать, обещаю, что больше мы не будем упрашивать, но если бы ты вступил, то мы были бы очень счастливы.
    0x547A, // И Сидзунэ, и Миша, кажется, не могут посмотреть мне прямо в глаза.
    0x54F0, // Не стану врать: я бы не смог отказаться от возможности побыть рядом с такими милыми девушками.
    0x559C, // Не хотелось бы столько работать каждый день, но после фестиваля, я уверен, дел будет поменьше.
    0x5647, // По крайней мере, я на это надеюсь.
    0x5684, // Хорошо. Думаю, хуже не будет, так почему бы и нет?
    0x56DC, // …
    0x56E0, // Чудесно. Чудесно! А-ха-ха-ха~!
    0x5714, // Сидзунэ удовлетворённо складывает пальцы домиком.
    0x5772, // …
    0x5776, // Она всё заполнит, Хиттян. Поздравляю, теперь ты официальный член Школьного совета!
    0x580D, // Здорово. Надеюсь, работы не будет много.
    0x5856, // Честно говоря, я никогда раньше не занимался подобной деятельностью.
    0x58D5, // Но, может быть, это станет хорошим опытом?
    0x5921, // Миша начинает хлопать в ладоши, при этом неудержимо хохоча.
    0x598E, // Поздравляю, Хиттян!
    0x59B2, // …
    0x59B6, // Поздравляю!
    0x59CC, // …
    0x59D0, // Поздравляю!
    0x59E6, // …
    0x59EA, // Поздравляю!
    0x5A00, // Я уже понял.
    0x5A16, // Я, не сдержавшись, улыбаюсь их по-детски милому проявлению радости.
    0x5A91, // У Школьного совета всегда дела! Но на сегодня мы закончили. До завтра, Хиттян!
    0x5B1E, // У нас ещё осталась работа, так что мы на тебя рассчитываем!
    0x5B89, // Я выхожу из комнаты, чувствуя себя выжатым как лимон. Окрестности пустынны, и школа в такое позднее время выглядит весьма зловеще. Свет горит только в окне кабинета Совета.
    0x5CC3, // Такими будут будни Школьного совета? Моё тело может не выдержать.
};

#endif // KS_A1_THURSDAY_EVENT_HORIZON_RU_TL_INDEX