#ifndef KS_A1_WEDNESDAY_SIP_P1_RU_TL_INDEX
#define KS_A1_WEDNESDAY_SIP_P1_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_499432E5_ru_intl[] = {
    0x0000, // Лилли и Ханако немедля принимаются за подготовку к ланчу.
    0x006A, // Не успеваю я развязать свой узелок с едой, как Лилли достаёт термос и чайные пакетики, а Ханако раскладывает ланч.
    0x013A, // Так вот зачем вы приходите сюда почти каждый день.
    0x0196, // Да, мы с Ханако обычно едим здесь. Для нас обеих это место – лучшее, что можно найти.
    0x022E, // Учитывая то, как Ханако реагировала на мои попытки пообщаться последние пару дней, я понимаю, что она права. К тому же так Лилли удаётся урвать несколько минут тишины вдали от своего класса.
    0x0388, // Я сажусь за стол последним, когда мой чай уже налит.
    0x03E6, // Чем больше времени провожу я с ними, тем больше вижу в них полную противоположность Мише и Сидзунэ.
    0x049B, // Резкая и прямолинейная манера общения Сидзунэ заметна даже без голоса, а Миша может найти общий язык с кем угодно. В то время как Лилли являет собой воплощение мягкости и учтивости, а Ханако – самая застенчивая девочка из всех, кого я знаю.
    0x0650, // Как тебе живётся в «Ямаку», Хисао? Кажется, тебя что-то беспокоило.
    0x06C9, // Я время от времени теряюсь, и на меня налетают в коридорах. В остальном всё не так уж и плохо…
    0x0773, // Ты… ты очень плохо выглядел после столкновения. Ты точно… в порядке?
    0x07F2, // На какой-то момент меня охватывает желание рассказать им о своей болезни, но я сдерживаюсь.
    0x0899, // Почему-то мне неловко говорить об этом малознакомым людям, пусть они и настолько дружелюбны.
    0x0943, // Ерунда, просто опешил от неожиданности.
    0x098C, // Судя по выражению их лиц, они не верят мне. Но всё равно не настаивают. Должно быть, из уважения к моей частной жизни.
    0x0A5F, // Полагаю, это одно из местных негласных правил: «не спрашивай». Даже если проблема очевидна, как, например, у Ханако, всё равно есть рамки и история её возникновения находится за ними.
    0x0BAB, // У каждого есть что-то, о чём ему неудобно говорить, и, думаю, все здесь это понимают.
    0x0C42, // Так, эм… вы давно здесь учитесь? Похоже, вы тут неплохо ориентируетесь.
    0x0CC4, // Хм… ну, я здесь с начала старшей школы, но переехала в общежитие только год назад.
    0x0D59, // Ханако тоже перевелась в начале старшей школы и сразу переехала в общежитие, если мне не изменяет память.
    0x0E1A, // Верно. Со… старшей школы.
    0x0E49, // Тогда же вы и познакомились?
    0x0E7D, // Именно. Ханако живёт в соседней комнате, так что это вполне естественно, правда?
    0x0F0F, // П-правда.
    0x0F20, // Да, конечно.
    0x0F36, // Соседство с кем-то, возможно, является уже достаточной причиной, чтобы подружиться, хотя думаю, что слепота Лилли тоже сыграла в этом не последнюю роль.
    0x104B, // Не могу себе представить, чтобы Ханако легко подружилась с кем-то, кому пришлось бы нарочно отводить взгляд от её шрамов.
    0x1128, // Беседа иссякает, и мы принимаемся за ланч.
    0x1175, // Проходит немного времени, и звон колокола возвещает окончание перерыва. Девушки убирают свои ланчи так же быстро, как и доставали, и я следую их примеру.
    0x128C, // Думаю, мне пора идти. Ты пойдёшь с Хисао, Ханако?
    0x12E3, // Ханако смотрит на меня, и несколько мгновений ясно видно, что она подумывает пропустить урок, просто чтобы не входить в класс вместе со мной.
    0x13E4, // Д-да.
    0x13ED, // Даже не знаю, что и думать. Ханако действительно очень легко задеть, если неправильно взглянуть на неё. От этого я тоже начинаю немного нервничать, но стараюсь отогнать это чувство, пытаясь вести себя как можно более естественно.
    0x158F, // Тогда нам надо торопиться. Судя по звонку, урок уже начался.
    0x15FC, // Наклоняясь за тростью, Лилли кивает нам на прощание, и мы с Ханако выходим первыми.
    0x1693, // Мы быстро идём пустыми коридорами к нашим классам.
    0x16F0, // Когда мы достигаем дверей класса 3-2, в котором учится Лилли, та поворачивается ко мне.
    0x178C, // Хисао, спасибо за то, что разделил с нами сегодня трапезу.
    0x17F5, // И тебе спасибо, Лилли.
    0x181D, // На этом наши пути расходятся; Лилли заходит в свой класс, оставив нас с Ханако, которая всё ещё выглядит так, будто хочет сбежать.
    0x1908, // Ну что, ты уверена, что хочешь пойти на урок?
    0x1958, // Д-да.
    0x1961, // Тогда ладно.
    0x1978, // Мне хочется сказать ей что-нибудь ещё, но сложно придумать что-то уместное, да к тому и безопасное.
    0x1A2B, // И Лилли была права: чем дольше мы будем мешкать, тем больше потом придётся объяснять.
    0x1AC6, // Я открываю заднюю дверь класса и вхожу.
    0x1B0E, // Учитель смотрит на меня и открывает рот, чтобы что-то сказать.
    0x1B7F, // Но, когда за мной входит Ханако, он просто кивает нам и продолжает урок.
    0x1C01, // Вот уже в третий раз опоздание Ханако игнорируется. Определённо, этому должно быть какое-то объяснение.
    0x1CBF, // Мы идём к своим местам, и я замечаю, что Миша и Сидзунэ тоже отсутствуют.
    0x1D42, // Интересно, это какое-то неофициальное соглашение с персоналом или своего рода прерогатива для особых учеников этой школы?
    0x1E23, // Стараясь не шуметь, я достаю из портфеля нужный учебник и начинаю нагонять остальных.
    0x1EC0, // Урок проходит спокойно.
};

#endif // KS_A1_WEDNESDAY_SIP_P1_RU_TL_INDEX