#ifndef KS_A1_FRIDAY_FOOT_AND_MOUTH_RU_TL_INDEX
#define KS_A1_FRIDAY_FOOT_AND_MOUTH_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_D29AF3D8_ru_intl[] = {
    0x0000, // Лестница на крышу выглядит заброшенной, но её явно недавно использовали.
    0x0086, // Она ведёт к двери, на которой отсутствует замок.
    0x00DE, // Интересно, что за храбрец снял замок?
    0x0122, // Эми толкает дверь и бодро выходит на залитую солнцем крышу.
    0x018F, // Внезапно словно из ниоткуда перед нами возникает высокая тёмная фигура незнакомца. Эми отступает назад, едва не падая с лестницы.
    0x027D, // Ух! Ты меня напугала, Рин!
    0x02AB, // Постой, а это, случайно, не…
    0x02DE, // Привет.
    0x02EC, // Заметив, что Рин обращается ко мне, Эми с любопытством на меня смотрит.
    0x036D, // Вы знакомы?
    0x0382, // Я смущённо гляжу на Эми.
    0x03AE, // Это она – твоя подруга?
    0x03D9, // Рин переключает взгляд на облака, проплывающие в небе над школой.
    0x0451, // Не знала, что ты знакома с этим человеком, Эми.
    0x04A5, // …
    0x04A9, // Неловкое молчание длится всего пару секунд, а затем Эми хихикает, словно подобное совпадение – сущая мелочь.
    0x0571, // Я пригласила Хисао на ланч. Если ты его знаешь, это даже к лучшему.
    0x05E9, // А. Значит, мне еды не достанется? Или ты его пригласила на ланч без ланча?
    0x066D, // Эм… ни то, ни другое – у меня еды на троих.
    0x06BA, // Предусмотрительно.
    0x06DE, // Пока я стою под башней с часами и проникаюсь здешней атмосферой, девушки отходят на противоположный конец крыши.
    0x07AD, // Кроме нас, тут никого нет. Думаю, в этой школе крыша не так популярна, как в остальных.
    0x0848, // По краям расставлено несколько обветшалых скамеек и столиков. Вероятно, кто-то сделал попытку придать этому месту не такой заброшенный вид.
    0x0949, // Мелкий гравий, покрывающий крышу, шуршит под ногами.
    0x09A9, // Я бросаю взгляд на школьный двор и окрестности школы через сетчатое заграждение.
    0x0A3E, // По двору и перед столовой прогуливаются парочки и группки учеников.
    0x0ABB, // На территорию продуктового магазина, расположенного неподалёку, заезжает несколько грузовиков.
    0x0B6D, // Откуда-то доносится лай сторожевой собаки.
    0x0BBC, // Когда я гляжу на панораму, на меня почему-то накатывает почти осязаемое ощущение нахождения в маленьком городке.
    0x0C8B, // Суматошная жизнь больших городов кажется здесь чужой и далёкой, никому не приходится мчаться, чтобы успеть на автобус, будто это вопрос жизни и смерти, или терпеть мерцание неоновых ламп и дорожные пробки.
    0x0E03, // Я гляжу на новый родной город, даже если он останется таковым только на какой-то год, и при мысли об этой новой жизни на меня накатывает волна оптимизма.
    0x0F18, // Внезапная болезнь и вынужденный переезд свалились на меня словно снег на голову, так что у меня не было времени подумать, как я к этому отношусь.
    0x1020, // Выходя из тени башни, я спиной чувствую тёплое прикосновение солнечных лучей.
    0x10AF, // На чистом лазурном небосводе ярко светит солнце.
    0x1109, // Прохладный порыв ветра заставляет меня поёжиться, но лишь на миг.
    0x1181, // Он несёт ароматы деревьев и цветов, а не смог и выхлопные газы, как было ещё пару недель назад.
    0x122C, // Эми с Рин садятся на скамейку, и Эми достаёт из портфеля три контейнера: один большой и два поменьше.
    0x12E3, // Давай же, Хисао! Чего ты ждёшь?
    0x131A, // Двигаясь, чтобы освободить немного места на маленькой скамеечке, она приглашает меня присоединиться.
    0x13D5, // Я сажусь с самого края, чтобы не стеснять остальных. На такой крохотной лавке каким-то чудом мы умещаемся втроём.
    0x14A3, // Впечатляющий вид.
    0x14C4, // Подавляя смешок, Эми ставит одну коробку с едой перед Рин, а вторую протягивает мне.
    0x155D, // Вот! Ланч, как и обещала!
    0x1589, // Ничего себе, домашнего приготовления. Я впечатлён.
    0x15E6, // Ого. Выглядит просто здорово.
    0x161C, // Спасибо! Я сама их готовлю, когда есть время.
    0x166D, // Разговор затухает, когда я принимаюсь жевать.
    0x16C1, // Съев пару кусков, я поднимаю взгляд и вижу, как Рин, ловко открыв коробку, суёт в рот вилку с едой, орудуя только ногами.
    0x1799, // Для меня это уже не в диковинку, но я всё равно поражаюсь той ловкости, с которой она всё это делает.
    0x184E, // Это лишний раз напоминает мне о том, где я нахожусь.
    0x18AC, // Привыкну ли я когда-нибудь к подобным зрелищам?
    0x1903, // Я вообще не уверен, хорошо или плохо привыкать к такому.
    0x1969, // Не будет ли это означать для меня полную потерю надежды на возврат к обычной жизни?
    0x1A01, // Или только то, что я стану лучше понимать окружающих?
    0x1A62, // От этих мыслей меня отвлекает вид Эми, которая набрасывается на еду так, словно та оскорбила её предков.
    0x1B20, // Похоже, ты голодная.
    0x1B45, // Она поднимает взгляд, энергично при этом жуя, затем проглатывает и кивает.
    0x1BCD, // Утренние пробежки всегда пробуждают аппетит.
    0x1C21, // И это здорово: благодаря ему еда усваивается быстрее.
    0x1C83, // Это помогает мне поддерживать стройную девичью фигуру.
    0x1CE9, // А что случится, если ты её потеряешь? Станешь мужиком?
    0x1D4B, // Мне каким-то чудом удаётся не подавиться, сдерживая смех.
    0x1DB4, // Это фигура речи.
    0x1DD2, // А твоей фигуре тоже приходится бегать по утрам?
    0x1E29, // Вы всегда так разговариваете?
    0x1E60, // Вот и ответ на мой вопрос.
    0x1E8F, // А, неважно.
    0x1EA3, // Так, э…
    0x1EB1, // Мне трудно придумать тему для беседы, и я решаю задать очевидный вопрос.
    0x1F35, // Как вы познакомились?
    0x1F5D, // Похоже, Рин не против, чтобы об этом рассказала Эми.
    0x1FBB, // Кто-то в жилищном отделе решил, что мы прекрасно друг друга дополним, и поселил нас в соседние комнаты.
    0x2076, // Дополните друг друга?
    0x209E, // Как костюм и туфли.
    0x20C1, // А?
    0x20C5, // Видя моё замешательство, Эми весело хихикает.
    0x2119, // Вместе у нас полный комплект конечностей, понимаешь?
    0x217A, // А…
    0x2180, // Так что я начала помогать Рин собираться по утрам – вот и познакомились!
    0x2205, // В смысле, нельзя ведь помогать кому-то каждое утро одеваться и при этом не подружиться.
    0x22A4, // Понятно.
    0x22B4, // Рин, воспользовавшись моментом, вставляет слово.
    0x230E, // У меня проблема с рубашками.
    0x2342, // Да, это… скажем, очевидно.
    0x2372, // Правда?
    0x2380, // Типа того…
    0x2395, // До Рин никак не доходит, но Эми вся эта сцена, очевидно, веселит.
    0x2409, // В сочетании с искренним недоумением Рин, это помогает мне говорить более свободно, но в то же время сбивает с толку.
    0x24DC, // Понимаешь, у тебя же нет рук.
    0x2510, // Так что, эм, одевание рубашки попадает в категорию вещей, которые тебе… трудновато делать.
    0x25B6, // Знаете что? Лучше мне заткнуться прямо сейчас.
    0x260B, // Это убережёт меня от кучи проблем в дальнейшем.
    0x2662, // Рин с серьёзным видом кивает, словно изображая мудреца.
    0x26C8, // Понятно.
    0x26D8, // Я снова переключаюсь на еду, и разговор затухает.
    0x2732, // Ланч действительно очень вкусный.
    0x2771, // Эми доедает первой и с довольным видом вздыхает.
    0x27CA, // Ох, вкуснятина какая.
    0x27F1, // Пока она убирает за собой, Рин обращается к ней.
    0x2848, // Я хочу пить.
    0x285E, // Ой! Я чуть не забыла! Извини…
    0x2893, // Она торжественно вытягивает из портфеля три пакета сока.
    0x28FC, // Бросает мне клюквенный, Рин даёт вроде бы клубничный, а себе оставляет розовый пакет с каким-то ещё.
    0x29B2, // Рин ловко протыкает пакет соломинкой и начинает пить.
    0x2A15, // И вновь я дивлюсь её гибкости и ловкости, но в этот раз воздерживаюсь от комментария.
    0x2AB0, // Мне почему-то кажется, что Эми и Рин особенно не задумываются над тем, как они обходят ограничения, накладываемые их инвалидностями.
    0x2BA2, // Особенно Рин.
    0x2BBB, // В самом деле, она создаёт впечатление, будто ей и вовсе невдомёк, что у неё отсутствуют какие-либо конечности.
    0x2C83, // Другой вопрос – сознательно ли она решила игнорировать этот факт или нет.
    0x2D0B, // Я, честно говоря, не знаю.
    0x2D39, // Ну так что, Хисао, нравится тебе здесь?
    0x2D7F, // Хм?
    0x2D85, // Да, тут довольно мило. Люблю высокие места за открывающийся вид.
    0x2DFA, // Спасибо, что пригласила меня сюда.
    0x2E39, // И за еду спасибо.
    0x2E58, // Эми улыбается яркой, как тысяча лампочек, улыбкой, явно довольная моим ответом.
    0x2EE9, // Всегда пожалуйста!
    0x2F0C, // Если захочешь, приходи с нами поесть и в следующий раз, ладно?
    0x2F7C, // Ланч я тебе не приготовлю, но ты можешь принести свой.
    0x2FDE, // Еды не будет? Ну, тогда не знаю…
    0x3018, // Эми изображает обиду.
    0x3040, // Пытаешься воспользоваться моей добротой?
    0x308D, // Какая наглость!
    0x30AA, // Она хихикает.
    0x30C3, // Ну, если таков твой ответ, то, думаю, мы с Рин продолжим есть в одиночестве…
    0x314C, // Меня внезапно атакует самый душераздирающий щенячий взгляд, который я только видел.
    0x31E7, // Шутка! Я пошутил!
    0x3206, // Я бы с радостью ещё тут поел.
    0x323A, // Хорошее место, да и компания – ничего.
    0x3280, // Эми немного хмурится на моё «ничего», но кажется довольной тем, что я принял её приглашение.
    0x3328, // Полагаю, мы теперь друзья.
    0x3358, // Или хотя бы приятели.
    0x337F, // Звенит колокол, призывающий спускаться обратно.
    0x33D8, // Рин, ты опять не доела!
    0x3401, // Я не сильно проголодалась.
    0x3432, // Если ты не будешь есть больше, то скоро совсем исчезнешь!
    0x349A, // Рин пожимает плечами, показывая тем самым, что готова пойти на такой риск.
    0x3521, // Давайте, пора уже идти.
    0x354B, // Мы втроём спускаемся по лестнице.
    0x3589, // Дневные уроки заканчиваются. У меня снова нет никаких планов, поэтому я направляюсь в библиотеку, чтобы вернуть пару прочитанных книг.
    0x3680, // Войдя, я замечаю, что сегодня здесь так же мало учеников, как и во вторник, что подчёркивает практически абсолютная тишина, царящая в помещении.
    0x3786, // Когда я отправляю книги в лоток для возврата, вделанный в прилавок, из-за него внезапно выскакивает Юко, испуганная раздавшимся грохотом книг, упавших в тележку рядом с ней.
    0x38C2, // О, прости, Юко. Я не хотел тебя напугать.
    0x390A, // Нет-нет. Всё в порядке. Такое случается… часто. Я уже привыкла.
    0x397C, // М, чем я могу помочь?
    0x39A1, // Всё нормально, я думаю, что уже знаю, где тут что. Но спасибо.
    0x3A0E, // Стоит, наверное, прихватить ещё пару книжек, раз уж я здесь. Делать особо больше нечего, да и после того, как я так много прочитал, пока лежал в больнице, чтение стало трудноискоренимой привычкой.
    0x3B70, // Я дохожу до отдела с художественной литературой в противоположном конце библиотеки, осматривая полки на предмет чего-нибудь интересного.
    0x3C6E, // По дороге я заглядываю за угол, где в прошлый раз сидела Ханако, не ожидая, однако, кого-нибудь там увидеть.
    0x3D30, // …Тем не менее, к моему удивлению, она находится там, полностью поглощённая чтением довольно толстой книги. Я решаю ей не мешать, как в прошлый раз, а продолжить поиски чтива.
    0x3E6C, // Поизучав какое-то время полки, я наконец останавливаю свой выбор на парочке книг и забираю их с собой.
    0x3F26, // Я торопливо подхожу к прилавку, оформляю книги, убираю их в портфель и отправляюсь восвояси.
    0x3FCF, // Покидая здание, я замечаю, что приближается закат. В школе ещё остаются ученики, но большинство уже разошлось по домам или общежитиям.
    0x40C4, // У неё такое забавное выражение лица, что я с трудом сдерживаю смех.
    0x413E, // Эми хихикает то ли над собой, то ли над чем-то ещё, то ли и вовсе без причины. Мне нравится её смех.
    0x41EE, // Жизнерадостный, бойкий характер Эми помогает отвлечься от засевшей в подсознании ссоры с Сидзунэ и Мишей.
    0x42B1, // Я выбрасываю из головы мысли об этом и позволяю себе впервые за сегодняшний день улыбнуться.
    0x435B, // В обычный день я присоединился бы к этому потоку и сам взял бы себе ланч, но сегодня всё иначе.
    0x4406, // Сегодня я приглашён на ланч на крыше.
    0x444A, // Странное место, но мне сказали пойти именно туда.
    0x44A4, // К счастью, мне удаётся найти укрытие от бури возле приоткрытой двери в класс.
    0x4531, // Наконец поток редеет и я осторожно выхожу в коридор.
    0x4591, // И тотчас встречаю Эми, несущуюся по коридору, словно пушечное ядро.
    0x460C, // Эй! Привет, Хисао! Как удачно мы повстречались!
    0x4661, // У меня сегодня с собой суперский дополнительный ланч, как я и обещала! Пойдём наверх!
    0x46FC, // Хисао!
    0x4708, // Только сегодня я собираюсь предложить тебе супер-эксклюзивный ланч!
    0x4786, // Ланч от Эми и привилегия насладиться им в приватной обстановке в компании двух сногсшибательных красоток!
    0x484A, // Её игривое приглашение эхом раскатывается по коридору, даже несмотря на то, что он полон народу.
    0x48FA, // Эми принимает уверенную позу и, будто пытаясь обыграть свой забавный внешний вид, выпячивает довольно скромную грудь, показывая пальцами знак победы – «V».
    0x4A18, // Звучит заманчиво. Чему обязан чести быть приглашённым?
    0x4A7D, // Ты стоял здесь с таким одиноким и печальным видом, что я подумала, что компания тебе не помешает.
    0x4B2D, // Самая удручающая из причин, которую только можно представить.
    0x4B9F, // Ну так как? Ты, наверное, действительно одинок и иначе всё равно пойдёшь в столовую есть эту жуткую еду в полном одиночестве.
    0x4C82, // Э-э-э…
    0x4C8E, // Я шучу, шучу!
    0x4CA5, // Конечно, я приму твоё предложение. С удовольствием.
    0x4D03, // Пойдём на крышу!
    0x4D21, // На крышу?
    0x4D32, // Почему на крышу?
    0x4D50, // Потому что там мы едим!
    0x4D7A, // И если я туда не поднимусь, то она, вероятно, уйдёт и, я уверена, останется голодной, потому что никогда не приносит еду с собой!
    0x4E60, // Ты о ком?
    0x4E70, // Пойдём!
    0x4E7E, // Так и не ответив на мой вопрос и не дождавшись ответа от меня, она хватает меня за руку и тащит по коридорам.
    0x4F42, // По дороге я пытаюсь завести разговор.
    0x4F87, // Откуда у тебя лишний ланч?
    0x4FB7, // Эми виновато улыбается.
    0x4FE3, // На самом деле это вчерашний.
    0x5017, // На перемене я пошла бегать и забыла его съесть.
    0x506D, // Вот оно как.
    0x5083, // Чувствуя себя в крайней степени измотанным, я направляюсь в свою комнату, чтобы почитать взятые книги. Для одного дня событий и волнений мне уже достаточно.
    0x51A1, // Первой я достаю «Алису в Стране Чудес». Я, конечно же, знаю эту историю, но не читал саму книгу.
    0x524C, // Она оказывается такой же психоделической, как и история, насколько я её помню: с чокнутыми персонажами и абсурдным сюжетом.
    0x532E, // Я и себя представляю в виде своего рода Алисы, беспомощно падающей через кроличью нору в эту Страну Калек.
    0x53F0, // …Нет, это я, конечно, загнул. Но всё равно, уединённое местоположение и то, как умело все в школе приспосабливаются абсолютно ко всему, поражает воображение. Здесь словно совсем иной мир.
    0x5544, // Непонятно, почему же меня никак не покидает ощущение того, что я здесь чужой, как и Алиса, несмотря на то, что большинство окружающих приветливы и дружелюбны со мной?
    0x5671, // Когда я переворачиваю ещё одну страницу, мысли начинают уплывать от сюжета книги всё дальше. В комнате так тихо, что я слышу, как бьётся моё сердце под рубашкой.
    0x5795, // Мне от этого почему-то становится очень плохо, как в тот раз, когда я был с Иванако в лесу. Как будто я заперт в одной клетке с чем-то мерзким и страшным.
    0x58A7, // Я откладываю книгу и принимаюсь смотреть в потолок, ожидая, когда это чувство пройдёт.
    0x5945, // Двумястами страницами спустя я засыпаю.
};

#endif // KS_A1_FRIDAY_FOOT_AND_MOUTH_RU_TL_INDEX