#ifndef KS_A1_FRIDAY_MIND_YOUR_STEP_RU_TL_INDEX
#define KS_A1_FRIDAY_MIND_YOUR_STEP_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_03DA99B5_ru_intl[] = {
    0x0000, // Думаю, надо сходить за продуктами. Я не могу постоянно обходиться едой из столовой и из забегаловок.
    0x00B7, // Когда я выхожу к воротам, несколько раз шумно потягиваюсь в попытке сбросить с себя накопившуюся за неделю усталость.
    0x018F, // Выйдя за ворота и завернув за угол, я замечаю одинокую фигуру, спускающуюся с холма по направлению к городу. Цвет её волос и постукивания тростью ни с чем не спутаешь.
    0x02BE, // Я поспешно догоняю её, что, кажется, привлекает её внимание без всяких слов.
    0x0348, // Привет, Лилли.
    0x0362, // Она немного поворачивает голову, чтобы уловить источник голоса и распознать человека, которому он принадлежит.
    0x042F, // …Хисао?
    0x043E, // Ага, это я.
    0x0451, // У неё хорошая память на голоса. То, что она запомнила мой, оказывается приятным сюрпризом.
    0x04F5, // Добрый вечер. Что тебя сюда привело?
    0x0537, // Она снова отвешивает лёгкий вежливый поклон. А я снова отвечаю ей тем же, не успевая сообразить, что это не обязательно.
    0x0611, // Просто иду в город. А ты?
    0x063D, // Боже, боже, какое совпадение.
    0x0672, // Идёшь туда же, да?
    0x0692, // М-м. Я всегда хожу в магазин по пятницам.
    0x06DB, // Некоторое время она молчит и вдруг обретает потерянный вид.
    0x0749, // И обычно Ханако ходит в город со мной…
    0x0790, // А… Не потерянный – просто взволнованный. Они ведь вроде бы довольно близки. Удивляет, что Ханако может вот так забыть о Лилли.
    0x0877, // Я видел, как она читала в библиотеке. Может, её просто увлекла книга?
    0x08F3, // Она облегчённо вздыхает.
    0x0921, // Спасибо. У неё есть такая привычка.
    0x0961, // Заядлая читательница?
    0x098A, // Верно. Она не любит бывать среди людей, и чтение вдали ото всех её немного расслабляет.
    0x0A28, // Хоть в намерения Лилли наверняка не входило напоминать об этом, мне не удаётся удержаться от того, чтобы сделать кислую мину, вспоминая свою первую встречу с Ханако.
    0x0B56, // Не горя желанием поднимать эту тему, я продолжаю молчать, пока мы шагаем по тихой дороге.
    0x0BF8, // Тук, тук. Тук, тук.
    0x0C18, // Благодаря отсутствию на дороге машин и тому, что ученики «Ямаку» остаются всё дальше и дальше позади нас, сейчас слышен только тихий шелест листвы и размеренное постукивание трости Лилли по тротуару.
    0x0D87, // Что просто здорово, особенно если сравнить эту тишину с толкотнёй и суетой города, в котором я жил раньше.
    0x0E48, // Это настолько умиротворяет, что я ненароком широко и громко зеваю.
    0x0EC2, // Устал?
    0x0ECE, // Да уж, в последнее время совсем с ног сбился.
    0x0F1F, // Это мягко говоря. Переход в новую школу сам по себе труден, а тут ещё такое…
    0x0FA9, // Ну, будем надеяться, что всё скоро устроится. Из-за фестиваля все сейчас как белки в колесе, и ты угодил прямо в гущу событий.
    0x108B, // Я немного колеблюсь, но, учитывая то, как она любит открытость, решаю поделиться с ней своими мыслями относительно всего.
    0x1168, // Наверное. Однако в «Ямаку» всё по-другому. То есть формальности на каждом шагу, изолированное расположение школы… Не говоря уже о самом очевидном отличии.
    0x1284, // Здесь у всех совсем другой образ мышления. Но думаю, что со временем я привыкну.
    0x1315, // Она утвердительно кивает, видимо довольная моим ответом. Кажется, она сейчас включила меня в паству, состоящую из учеников, о которых заботится, включающую класс 3-2 и Ханако.
    0x1452, // Я не возражаю. В любом случае приятно свалить с плеч гору мыслей.
    0x14C8, // Есть и положительный момент: можно воспринять это как шанс начать всё заново. Тебе стоит ценить возможность завести новых друзей.
    0x15B6, // Оптимистично. Думаю, что иметь такой позитивный настрой – это замечательно.
    0x1642, // Верно подмечено.
    0x1661, // Продолжая идти по дороге, она, кажется, начинает волноваться. Прежде чем я успеваю поинтересоваться, в чём дело, она вновь принимает уверенный вид и меняет тему.
    0x1786, // А куда ты конкретно собирался пойти в городе?
    0x17D9, // Вопрос на самом деле неплохой. Хорошо бы пойти купить еды, но я до сих пор абсолютно незнаком с городом.
    0x1895, // Я намеревался просто побродить по округе и найти какой-нибудь магазинчик, но, поскольку закат близится и вскоре стемнеет, это не самое мудрое решение.
    0x19A8, // Придётся мне спросить у неё дорогу. Опять.
    0x19F5, // Я собирался купить еды… но, когда ты спросила, вдруг понял, что не знаю, куда мне идти.
    0x1A91, // В таком случае это большая удача. Я тоже как раз собиралась идти в продуктовый магазин.
    0x1B30, // Кажется, тебе снова придётся взять меня под крыло. Спасибо.
    0x1B9C, // И мы вместе отправляемся в магазин. Я замедляюсь, чтобы держаться рядом. По сравнению с моей обычной походкой, её шаги заметно медленнее. Тому есть причина, конечно.
    0x1CC8, // Через несколько минут ходьбы я примечаю нашу цель. Городок действительно маленький.
    0x1D63, // Мы без лишних проволочек проходим внутрь под приветствие кассира.
    0x1DDD, // Ты не против, если я увяжусь за тобой? Обычно Ханако мне помогает, но поскольку её сейчас нет…
    0x1E88, // Я не сразу осознаю, о чём она.
    0x1EBD, // Учитывая, что она не в состоянии прочитать ни одной этикетки, поход за покупками без помощи окажется для неё сущей мукой.
    0x1F9A, // К тому же меня не покидает ощущение, что она задумала это сразу же, как только я сказал, что направляюсь сюда.
    0x2060, // Конечно. Буду рад.
    0x2081, // Я беру из стопки у входа пару красных видавших виды корзинок и протягиваю одну из них Лилли.
    0x2129, // Опустив корзинку на пол, Лилли кладёт в неё портфель, складывает трость, отправляет её туда же и берёт корзинку в правую руку.
    0x220E, // Стоп, если она будет без трости…
    0x224A, // Не успеваю я закончить мысль, как она своими тонкими пальцами берёт меня за манжету формы.
    0x22EF, // Ты не возражаешь?
    0x230F, // А, нет, конечно.
    0x232B, // У меня нет причин отказываться. Есть вещи и похуже, чем ходить по магазину с симпатичной девушкой, держащейся за меня, пусть даже и из необходимости.
    0x243A, // Мы передвигаемся меж рядов, и никто из случайно проходящих мимо покупателей и бровью не ведёт при виде нас.
    0x24FE, // Учитывая то, как близко находится «Ямаку», для местных жителей наверняка является обычным делом видеть учеников оттуда.
    0x25DB, // Каждый раз, когда мы подходим к очередному ряду, я выясняю у Лилли, что ей нужно. Я беру это, а также и то, что нужно мне, и раскладываю продукты по корзинкам.
    0x26F5, // Наверное, для них с Ханако всё это обычное дело.
    0x274C, // Так, мне осталось только хлеб купить. Тебе ещё что-нибудь нужно, Лилли?
    0x27CC, // Нет, это всё.
    0x27E3, // Ну, тогда на выход.
    0x2805, // Быстренько заглянув в хлебный отдел, мы направляемся к кассам.
    0x2878, // Очереди, к счастью, почти нет. Вскоре мы, расплатившись, выходим за дверь.
    0x28FD, // Пока Лилли достаёт и раскладывает свою трость, я, держа обе наши сумки, поднимаю взгляд в ночное небо.
    0x29B6, // Я пытаюсь выпустить изо рта облачко пара, но летняя жара не хочет мне в этом содействовать.
    0x2A5C, // Наконец Лилли выпрямляется, быстро потягивается и берёт у меня свою сумку.
    0x2AE5, // Ты тоже устала?
    0x2B01, // Подготовка к фестивалю – сущий хаос. И то, что Сидзунэ дышит мне в затылок, не очень-то помогает.
    0x2BB0, // Эй, она всего лишь старается всё организовать. Лучше сейчас, чем когда будет поздно, верно?
    0x2C55, // Думаю, да. Завтра я буду расслабляться в городе, это уж точно.
    0x2CC4, // Наверное, подготовка к фестивалю сказывается на них обеих.
    0x2D30, // Мы шагаем по тихой улице с сумками, полными покупок, беседуя между собой.
    0x2DB5, // …Постойте-ка, а это что?
    0x2DE1, // Я замечаю довольно необычную фигуру, приближающуюся к нам в свете уличных фонарей.
    0x2E79, // Сначала кажется, что это мальчик из моего класса, но, как только он, а точнее она, подходит поближе, я сразу её узнаю.
    0x2F4B, // Рин? Что ты тут делаешь так поздно?
    0x2F8A, // Рин?
    0x2F92, // Лилли поднимает голову, прислушиваясь. Я вдруг осознаю, что, наверное, мне стоит описать для неё происходящее.
    0x305B, // Это Рин… по фамилии вроде бы Тедзука. Из нашей школы.
    0x30BC, // Услышав имя, она напрягается и её лицо обретает сложное выражение: нечто вроде сочетания натянутой улыбки и мученической боли.
    0x31A5, // А. Понятно.
    0x31B9, // Думаю, Лилли тоже знает Рин.
    0x31EC, // Рин поворачивается к нам. Кажется, она абсолютно не в себе. Я не могу понять: она не узнаёт нас или всё же узнаёт, но не подаёт виду?
    0x32D8, // Она выглядит как зомби. Или как статуя. Статуя зомби.
    0x3338, // Но мало-помалу в её тёмных глазах начинают появляться признаки зарождающегося света понимания: она должна как-то отреагировать на мои слова.
    0x343B, // Рин моргает. Очень медленно.
    0x346F, // Привет.
    0x347D, // …
    0x3481, // Наступает неловкая пауза; каждый из нас ждёт, пока кто-нибудь что-нибудь скажет.
    0x3513, // Что ты делаешь здесь в такой поздний час?
    0x355E, // …
    0x3562, // Я…
    0x3568, // Я тоже задала себе этот вопрос. Только что.
    0x35B6, // Кто-то из прохожих спрашивал об этом совсем недавно. Полагаю, их интересовало то же самое.
    0x365A, // Я не знала. И они не знали. Я спрашивала. Поэтому я и задаюсь этим вопросом.
    0x36E1, // Вот и вся история. Это убийственная загадка, только без убийства.
    0x3758, // …
    0x375C, // Они направлялись в ту сторону.
    0x3794, // Она поворачивается вправо, демонстрируя направление, в котором ушли прохожие, будто это имеет значение, потом – обратно, как механическая кукла на замысловатых часах.
    0x38C7, // Для замкнутого человека Рин использует слишком много слов для описания довольно второстепенных вещей.
    0x3985, // Не будучи уверенным в том, что она закончила, я продолжаю молчать. Как и Лилли, у которой, похоже, пропал дар речи.
    0x3A52, // Видимо, мы просто боимся, что ответ может спровоцировать продолжение истории.
    0x3AE1, // Отсутствие реакции с нашей стороны совсем не волнует Рин. Она меряет нас выжидающим взглядом, лицо её практически ничего не выражает, кроме спокойствия.
    0x3BF9, // Такой она, похоже, человек. Всегда расслаблена.
    0x3C4F, // Как будто по её венам вместо крови течёт лошадиная доза успокоительного.
    0x3CD5, // У тебя амнезия? Хотя я не припоминаю у тебя ничего подобного…
    0x3D46, // Нет, думаю, что дело не в этом.
    0x3D7C, // Но те прохожие, видимо, волновались. Ты действительно выглядишь потерянной, стоя вот так посреди улицы.
    0x3E39, // А, понятно.
    0x3E4D, // Может быть, в таком случае мне следовало принять какую-нибудь другую позу?
    0x3ED5, // Я размышляю, стоит ли мне распространяться на эту тему дальше или сдаться ради сохранения остатков собственного рассудка.
    0x3FB6, // В итоге склоняюсь ко второму варианту.
    0x3FFD, // Похоже, не стоит слишком уж вслушиваться в болтовню Рин.
    0x4064, // Разговор с Рин похож на игру в шахматы с суперкомпьютером, который делает случайные ходы, будто насмехаясь надо всеми шахматными правилами. Здесь то же самое, только взаимодействие идёт с человеком.
    0x41D0, // И даже победа в таком случае имеет привкус поражения.
    0x4232, // Чёрт, это напоминает речь Кендзи. Даже когда я выигрываю, то проигрываю. Это особая способность девушек из «Ямаку»?
    0x4304, // …
    0x4308, // Я отбрасываю эту мысль как опасную для дальнейшего обдумывания. Наверное, это просто антиженская пропаганда Кендзи оказывает на меня такое воздействие в минуты слабости.
    0x4442, // Да, может быть, если бы ты приняла другую позу, это бы сработало.
    0x44B6, // Так что, у тебя нет мыслей насчёт того, что ты здесь делаешь?
    0x4523, // Она хмурится, явно очень недовольная то ли моим вопросом, то ли его последствиями, то ли ответом, который она собирается дать.
    0x4608, // У меня есть. Кое-какая мысль. Только не могу сказать, что за мысль.
    0x467F, // Ну, хоть какой-то прогресс.
    0x46B0, // Слова Лилли звучат так, будто она обнаружила возможность вывести разговор в нормальное русло. Не могу сказать, что я разделяю её оптимизм.
    0x47AD, // Да, какая-то есть. Определённо. Остальные придут попозже.
    0x4815, // Я в этом уверена. У меня всегда есть… причины.
    0x4869, // Последовавшее молчание буквально стирает с лица Лилли остатки надежды. Недолго музыка играла.
    0x4917, // Не принимая во внимание беспочвенные, насколько я могу судить, заверения Рин… как лучше в такой ситуации поступить?
    0x49EC, // Мы можем оставить её наедине с её затеями, какими бы они ни были… но время позднее и я не думаю, что нас по головке погладят, если найдут Рин, стоящую здесь среди ночи.
    0x4B1A, // А она ведь и будет стоять, если только не вспомнит, зачем сюда пришла.
    0x4B98, // Как по мне, так шансы угадать, что происходило у неё в голове, когда она решила отправиться навстречу этому приключению, равны шансам выиграть в лотерею.
    0x4CAF, // Несколько раз подряд.
    0x4CD7, // Лилли тоже необычайно молчалива. В этом разговоре я был бы рад помощи со стороны, тем более раз Лилли знакома с Рин ближе, чем я.
    0x4DBF, // Но ничего не поделаешь. Похоже, причина её нерешительности кроется именно в том, что она слишком хорошо с ней знакома.
    0x4E96, // Ну, я предполагаю, что ты куда-то шла, только не в школу… есть догадки куда?
    0x4F1E, // Она в шоке округляет глаза и отшатывается столь неестественно, что кажется, будто это движение было специально отрепетировано для подобных ситуаций.
    0x5031, // Ты экстрасенс? Это и есть твоя инвалидность? Оригинально!
    0x509A, // Нет… Что? С чего ты взяла?
    0x50C9, // Ты понял, что я делала.
    0x50F2, // Ну, я основывался на фактах. Мы недавно шли по этой же улице в обратном направлении, в магазин.
    0x519D, // Если бы ты шла в школу, наши пути бы не пересеклись.
    0x51FA, // А…
    0x5200, // Она выглядит слегка разочарованной.
    0x5243, // Как и Кендзи, Рин, похоже, скора на абсурдные умозаключения.
    0x52B0, // Может быть, что-то не так с местной водой? Я делаю мысленную заметку на будущее: запастись напитками.
    0x5367, // Знаешь, меня уже второй раз на этой неделе спрашивают, не экстрасенс ли я.
    0x53ED, // Я действительно произвожу такое впечатление?
    0x5441, // Рин только пожимает плечами в ответ.
    0x5484, // Знаешь—{w=0.3}{nw}
    0x549F, // Может быть, вернёшься вместе с нами в школу?
    0x54EF, // Лилли вмешивается как раз в тот момент, как я собираюсь развенчать миф о своих сверхспособностях. Она кажется весьма обеспокоенной, и вымученная улыбка это плохо скрывает.
    0x562A, // Возможно, она пришла к тому же выводу, что и я. Ради всеобщего блага я бросаю бессмысленную тему про экстрасенсов.
    0x56F9, // Да, Лилли права. Если ты не можешь вспомнить, то нет смысла здесь оставаться.
    0x5784, // Рин раздумывает над этим довольно простым выводом, а затем кивает.
    0x57FE, // Хорошо.
    0x580C, // Мы снова направляемся к школе, потратив из-за этой сцены куда больше времени, чем следовало.
    0x58B4, // Рин идёт по краю тротуара своей неровной походкой, похожая на помесь лунатика с канатоходцем, а Лилли держит одну руку на моём плече, постукивая по земле тростью.
    0x59DC, // Тук, шарк-шарк, тук-тук, шарк-шарк-шарк.
    0x5A22, // Не считая этого и отрывочных вступлений в беседу, нас окутывает молчание. При этом тишина не такая умиротворяющая, как та, что была по дороге в город.
    0x5B32, // Ну что, как продвигается фреска?
    0x5B6D, // Нас настигнет невезение. Никогда не говори о незаконченных работах.
    0x5BEA, // Я уверена, она будет превосходна.
    0x5C27, // Невезение.
    0x5C3B, // Тук, шаг, тук, шаг. Она не любит говорить об этом. А вежливость Лилли впервые оказывается не к месту. Шарк, шарк, шарк.
    0x5D0D, // Холм, на вершине которого расположен интернат «Ямаку», в этом месте довольно крутой. Мы замедляем шаг, но я всё равно чувствую, как учащается мой пульс, а дыхание становится всё тяжелее.
    0x5E5F, // Почти пришли, уже видны ворота.
    0x5E98, // Помимо этого, однако, я замечаю, что пальцы Лилли немного крепче сжимаются на моём плече. Восприняв это как знак того, что она хочет о чём-то спросить, я подаю голос.
    0x5FC2, // Что-то не так, Лилли?
    0x5FE7, // При этом я еле сдерживаюсь, чтобы не добавить: «Не считая нашего попутчика?»
    0x6072, // Она, кажется, колеблется несколько секунд, сомневаясь, стоит ли ей вообще заводить этот разговор, но всё же начинает его.
    0x614E, // Всё… в порядке?
    0x616B, // В порядке? О чём ты?
    0x618E, // Моя неспособность понять её невероятно расплывчатый вопрос на мгновение ставит её в тупик.
    0x6236, // Просто… похоже, что ты очень устал.
    0x6277, // При этих её словах я замечаю, что моё дыхание стало невероятно тяжёлым. Прогулка в гору меня здорово вымотала.
    0x6340, // Прости, просто я не в лучшей форме.
    0x637F, // Мне не очень хочется об этом говорить.
};

#endif // KS_A1_FRIDAY_MIND_YOUR_STEP_RU_TL_INDEX