#ifndef KS_A1_FRIDAY_NO_RECOVERY_RU_TL_INDEX
#define KS_A1_FRIDAY_NO_RECOVERY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_C2A7D689_ru_intl[] = {
    0x0000, // В коридорах так же тихо, как и во дворе, – естественно, все ведь на уроках. Я легонько стучу в дверь класса 3-3 и, когда Муто отзывается, открываю её.
    0x0109, // Извините за опоздание.
    0x0133, // Ко мне поворачиваются пятнадцать пар глаз.
    0x0182, // Доброе утро, Накай.
    0x01A5, // Муто, кажется, немного сбит с толку моим поздним приходом, будто я прервал ход его мыслей.
    0x0248, // Судя по тому, какими бессистемными бывают его лекции, дело, скорее всего, именно в этом.
    0x02E7, // Я протягиваю ему записку от фельдшера. Муто кивает, берёт её и пробегает по ней глазами.
    0x0387, // Он поднимает брови и окидывает меня строгим взглядом, но ничего не говорит, а только снова важно кивает.
    0x0445, // Я пожимаю плечами, и он жестом указывает мне садиться, что я, естественно, и делаю.
    0x04DA, // Вопреки обычаю, я прихожу на утренний урок далеко не одним из первых.
    0x0558, // Напротив, почти все, кажется, уже здесь. Большинство одноклассников я уже знаю в лицо, хотя их имена всё ещё ускользают из памяти.
};

#endif // KS_A1_FRIDAY_NO_RECOVERY_RU_TL_INDEX