#ifndef KS_A1_WEDNESDAY_LUNCH_EVOLUTION_THEORY_RU_TL_INDEX
#define KS_A1_WEDNESDAY_LUNCH_EVOLUTION_THEORY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_218E383D_ru_intl[] = {
    0x0000, // Этим утром я чувствую себя сильно утомлённым, возможно из-за того, что вчерашний день был столь утомительным. Кроме того, я сегодня проснулся раньше времени.
    0x011F, // Я поспешно здороваюсь с Сидзунэ и Мишей и принимаюсь решать задания с доски. Кажется, над примерами сегодня придётся попотеть.
    0x0207, // Но я не возражаю. Сидзунэ и Миша могут начать требовать от меня ответа по поводу вступления в Школьный совет, хоть и прошёл всего день.
    0x02FC, // С них ведь станется. А ответить я пока не смогу, поэтому нынешняя ситуация вполне меня устраивает.
    0x03AF, // Минут через десять после начала урока входит Ханако и молча занимает своё место. Никто не смотрит на неё, даже учитель не обращает внимания на её опоздание.
    0x04CC, // Он объявляет, что мы снова делимся на группы.
    0x051E, // Повернувшись, я вижу, что Сидзунэ и Миша смотрят на меня. Сидзунэ мило, но в то же время угрожающе улыбается мне, как бы говоря: «Вот ты и попался. Теперь не уйдёшь».
    0x0646, // Хиттян~, выходит, мы снова вместе! Ур-ра~!
    0x068F, // Миша поворачивается ко мне, а Сидзунэ тем временем передвигает свою парту поближе к моей. Действительно, сбежать теперь можно лишь прыгнув в окно.
    0x079B, // Увы, это неприемлемый вариант.
    0x07D3, // …
    0x07D7, // Что-то не так, Хиттян?
    0x07FE, // …
    0x0802, // А! Хиттян, ты уже решил по поводу вчерашнего? Ты ведь обещал подумать о вступлении в Школьный совет.
    0x08B7, // Всё в порядке, Хиттян. Вчера мы с Ситтян решили, что было бы невежливо требовать от тебя ответа так скоро, верно? Верно~!
    0x098F, // Ха-ха-ха-ха-ха-ха~!
    0x09AF, // Очень рад, что вы нашли новую мишень для своих шуток. И ещё больше – тому, что вам известно, насколько настырными вы можете быть.
    0x0A98, // Вновь переключившись в «серьёзный режим», Сидзунэ демонстративно хлопает по учебнику тыльной стороной ладони.
    0x0B65, // Я пробегаю глазами по заданию: нам предстоит в основном чтение, собственно задачек там всего две.
    0x0C17, // Меня так и подмывает высказать что-нибудь относительно того, насколько излишня её спешка, учитывая объём работы. Правда, Сидзунэ, видимо, известно, насколько он мал, но её это попросту не волнует.
    0x0D7B, // Похоже, её волнует не столько количество, сколько сам факт наличия работы. Она ко всему приступает с одинаковым рвением.
    0x0E57, // Отвлекаясь от чтения, я натыкаюсь взглядом на Ханако. Она решает задачи. Судя по всему, в одиночку.
    0x0F0A, // Не припоминаю, чтобы она хоть раз работала с кем-нибудь.
    0x0F70, // Неудивительно, учитывая, насколько она застенчива.
    0x0FCE, // Эй, а вон та девушка…
    0x0FF5, // А? Кто, Хиттян?
    0x100F, // Вон та. Ханако. Она всегда работает одна?
    0x1059, // Думаю, да, Хиттян. Тебе её из-за этого жалко?
    0x10A8, // Я просто подумал, не могла бы она поработать с нами, например?
    0x1118, // М-м-м-м… Нет, не думаю, что это хорошая идея, Хиттян.
    0x1175, // Почему же?
    0x1188, // Ситтян с ней не поладит.
    0x11B4, // Почему?
    0x11C2, // Миша уходит от ответа, издав странный смешок: нервный, но всё с той же обычной для неё скачущей интонацией.
    0x1284, // По кочану, Хиттян.
    0x12A5, // В этот момент Сидзунэ отвлекается на наш разговор; я только сейчас замечаю, что всё это время Миша беспрестанно жестикулировала.
    0x1391, // …
    0x1395, // Что, Ситтян? «Друг моего врага – мой враг»? Звучит слишком резко, я не буду этого говорить.
    0x1439, // Ты это уже сказала.
    0x145C, // Знаю, Хиттян, это ничего, что ты подслушал~!
    0x14AA, // Видимо, так Миша обеспечивает справедливость в общении, ведь без неё я бы ни за что не понял, что хочет сказать Сидзунэ. И наоборот.
    0x1598, // Выходит, ещё одна причина, по которой Миша постоянно жестикулирует, – она хочет, чтобы Сидзунэ была в курсе всех разговоров, идущих вокруг неё.
    0x169D, // …
    0x16A1, // Как бы то ни было, пора решать задачи, Хиттян.
    0x16F3, // Мы заканчиваем раньше времени, и я решаю спросить, есть ли поблизости местечко с меню поаппетитнее, чем в нашей столовой.
    0x17D0, // На что Сидзунэ и Миша принимаются спорить о том, какой из местных ресторанов лучше. Все они находятся в городе, и мы вряд ли успеем сходить туда до начала следующего урока. И потом там наверняка дорого.
    0x193E, // Или они спорят ради удовольствия?
    0x197C, // Они настолько увлечены, что не замечают начала большой перемены.
    0x19F3, // Я смотрю в конец класса через плечо.
    0x1A35, // …Похоже, она пересматривает свои конспекты с прошлого урока.
    0x1AA6, // Странное зрелище, на фоне того, как остальные заняты перерывом на ланч.
    0x1B28, // Болтают, сплетничают, сдвигают парты. Те, у кого еда была с собой, общаются с остальными, иногда прерываясь, чтобы отправить в рот очередную порцию.
    0x1C34, // По мере наблюдения за Ханако начинает казаться, что я единственный, кто её замечает. Как будто она невидима для остальных; будто прячется у всех на виду.
    0x1D4A, // Над ней издеваются? Или она отгородилась ото всех по собственному желанию?
    0x1DD3, // Я замечаю, как она смотрит через плечо на заднюю дверь класса.
    0x1E44, // И она не перелистывает страницу с тех пор, как я начал за ней наблюдать.
    0x1EC6, // Думаю, она ждёт кого-то.
    0x1EF1, // Почитать свою книгу.
    0x1F17, // Попробовать заговорить с Ханако.
    0x1F54, // Подождать, пока Сидзунэ и Миша примут решение.
};

#endif // KS_A1_WEDNESDAY_LUNCH_EVOLUTION_THEORY_RU_TL_INDEX