#ifndef KS_A1_SUNDAY_PROMISE_OF_TIME_RU_TL_INDEX
#define KS_A1_SUNDAY_PROMISE_OF_TIME_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_F5ACEAB8_ru_intl[] = {
    0x0000, // …Точно. Я знаю, что мне делать. Пусть это лишь один человек, но я сделаю фестиваль более приятным для неё.
    0x00BF, // Я кладу чашу на прилавок и зову Лилли.
    0x0104, // А, Хисао. Возвращаешь её, да?
    0x0137, // Да, вот.
    0x0145, // Я сую плошку ей в руки, и она передаёт её тем, кто, видимо, отвечает за мойку посуды. Прежде я их не видел, так что это, вероятно, наказанные за опоздание.
    0x0257, // Хм, Лилли?
    0x0269, // Снова услышав мой голос, она поднимает голову и возвращается к прилавку, осознав, что я ещё тут.
    0x0317, // Хочешь, пойдём получше посмотрим на фестиваль?
    0x036D, // Она неодобрительно надувает щёки. Выглядит довольно мило, представляя собой полную противоположность её обычной сдержанной натуре.
    0x0461, // Требуется несколько секунд, прежде чем до меня доходит, в чём дело. Опаньки.
    0x04EB, // Ой… я имел в виду, не…
    0x0514, // Лилли хихикает, показывая, что это был лишь розыгрыш.
    0x0575, // Ты всё ещё не привык к школе, да?
    0x05AF, // Она меня подловила.
    0x05D3, // Но всё же… Мне, пожалуй, надо остаться за прилавком. Нам только сейчас удалось наконец всё распаковать.
    0x0690, // Думаю, её нежелание не должно меня слишком удивлять, учитывая, сколько труда она в это вложила.
    0x073D, // Но сейчас-то всё уже в порядке. Да и к тому же к тебе пришла подмога.
    0x07B7, // Парень, занятый приготовлением лапши соба, ухмыляясь, поворачивается к нам.
    0x0842, // Давай, Лиль, ты заслужила передышку. Мы пока удержим форт.
    0x08AB, // Раз ты так говоришь, то я думаю, что можно…
    0x08F9, // Но если будет нужна какая-либо помощь…
    0x0941, // То мы тебя позовём. Иди, у нас всё схвачено.
    0x098F, // Он машет на Лилли своей лопаточкой, и она наконец прекращает сопротивляться. На ощупь обходя прилавок, она подбирает по дороге свою трость.
    0x0A8E, // Пожалуй, первым делом нам нужно поискать Ханако. Лилли, видно, волнуется за неё, да и я сомневаюсь, что в её характере в одиночку гулять среди толпы.
    0x0B9A, // Так, я думаю, мы должны поискать Ханако. Откуда начнём?
    0x0BFD, // Хм…
    0x0C05, // Мы оба на миг замолкаем, раздумывая.
    0x0C47, // Может, в её комнате в общежитии?
    0x0C81, // Вряд ли. У неё там мало вещей, так что ей нечего там делать.
    0x0CEB, // …А! Библиотека?
    0x0D08, // Не самое плохое место для поисков заядлой читательницы, я полагаю.
    0x0D82, // Значит, библиотека. Проверим сначала там.
    0x0DCE, // За исключением приглушённых звуков толпы, просачивающихся снаружи, внутри школа кажется почти заброшенной.
    0x0E95, // Видимо, чтобы обеспечить всех достаточным простором, все мероприятия были устроены снаружи, на школьных угодьях. Они действительно очень велики по меркам любой другой школы.
    0x0FD5, // Здесь тихо и уютно, не правда ли?
    0x1010, // Ага. Куда уютнее, чем тот шум и гам снаружи.
    0x105E, // Мы не торопимся и медленно проходим по первому этажу школы, добираясь в итоге до лестницы на второй этаж.
    0x111E, // Я замечаю, что Лилли словно знает, когда на её пути появится дверь или какое-нибудь препятствие, не шевеля тростью, но скользя рукой вдоль перил коридора.
    0x1236, // Ты в самом деле знаешь школу наизусть, да?
    0x1282, // Она улыбается и сразу кивает.
    0x12B8, // Я здесь уже несколько лет, поэтому знаю, где что находится.
    0x1323, // Хотя общежития иногда сбивают меня с толку. Я не так часто там бываю, и планировка у них не такая продуманная, как в главном здании.
    0x1411, // Если я правильно помню, они раньше были бесхозным строениями, прежде чем их подновили и открыли в них общежития.
    0x14DE, // Это объясняет, почему мужские и женские корпуса выглядят по-разному и почему комнаты в них довольно необычной для своего назначения планировки.
    0x15E7, // Я предполагал, что она жила в общежитии с тех пор, как начала ходить в школу, но сейчас припоминаю сказанное ей вчера.
    0x16BC, // Да, точно, ты уже упоминала об этом.
    0x16FC, // Я полагал, что большинство учеников жили в общежитиях с самого момента их зачисления. Или что таких по крайней мере немало.
    0x17DD, // На лице Лилли появляется выражение, которое я не могу прочитать, – своим вопросом я, видимо, задел деликатную тему.
    0x18AF, // Хм… Как бы лучше выразиться…
    0x18E6, // У всех… свои причины.
    0x190E, // Что-то мне подсказывает, что одной из таких, «имеющих свои причины», является Ханако, вот Лилли и осторожничает с ответом. Моё собственное положение служит ещё одним примером.
    0x1A4E, // Полагаю, это выбор, который каждый делает для себя… или же, как в моём случае, подобный выбор делают за них.
    0x1B11, // Думаю, тут ничего не поделаешь. По крайней мере, «Ямаку» кажется вполне милым местом.
    0x1BAC, // Рада слышать это от тебя. Я боялась, ты возненавидишь «Ямаку».
    0x1C1D, // А что насчёт тебя?
    0x1C3E, // Мой вопрос, заданный в ответ на утверждение Лилли, застаёт её врасплох.
    0x1CC0, // Я здесь уже давно, так что…
    0x1CF2, // Я не об этом. Ты кажешься довольно расстроенной из-за Акиры.
    0x1D5F, // Хм~
    0x1D65, // Это ещё что за выражение?
    0x1D93, // Акира занята. Извини, Хисао.
    0x1DC6, // Лилли не видит, как быстро я подношу ладонь к лицу от этого её обвинения.
    0x1E4A, // Эй, я беспокоился за тебя. Так не отвечают на заботу.
    0x1EA9, // Она награждает меня усмешкой, в то время как мы проходим коридор и входим в библиотеку.
    0x1F48, // Сделав это, мы без труда обнаруживаем Ханако, ведь больше в комнате никого нет.
    0x1FD8, // А раз никого из сотрудников поблизости тоже не наблюдается, то и нужды соблюдать обычные библиотечные правила нет.
    0x20AB, // Эй, Ханако.
    0x20BF, // Ханако тут?
    0x20D4, // Услышав наши голоса, Ханако поднимает голову из-за книги, вероятно той же самой, что она читала в пятницу.
    0x2194, // Хисао? Лилли?
    0x21AC, // Да вот, решили заглянуть. Лилли только что удалось сбежать из лапшичного киоска… с небольшой помощью.
    0x2267, // Это был не совсем побег…
    0x2295, // Ханако хихикает, на мгновение удивляя нас обоих.
    0x22EE, // Я как раз беспокоилась о том, что… Лилли сейчас может не веселиться на фестивале.
    0x2383, // Ну, теперь мы можем наслаждаться им вместе, да?
    0x23D8, // Они обе радостно кивают, и мы выходим из библиотеки навстречу веселью.
    0x2459, // Я передаю немного мелочи девушке за кассой и беру два пластиковых стаканчика с чаем. Я кланяюсь чуть ниже, чем следует, так как девушка явно глуха.
    0x2564, // Если подумать, мне, наверное, стоило попросить этих двоих помочь мне, а не оставлять их в сквере, а самому идти за напитками.
    0x2645, // Жонглировать двумя стаканами с горячим чаем (для них) и банкой кофе (из автомата, для меня) не очень-то просто.
    0x270C, // С помощью осторожных манёвров мне удаётся сохранить всё в стабильном и вертикальном положении к тому моменту, как я подхожу к скамейке, на которой сидят и болтают Лилли и Ханако.
    0x2852, // Это довольно неплохое место. Освещённое лишь лунным светом, оно находится на некотором удалении от самой гущи событий.
    0x292C, // По сравнению с тем, каким знойным оно было днём, сейчас тут довольно прохладно.
    0x29BC, // Не то чтобы это что-то значило. Большинство посетителей ушли поближе к месту запуска фейерверков или поднялись на холм, чтобы получше увидеть запланированное представление.
    0x2AFB, // С возвращением, Хисао.
    0x2B24, // У неё хороший слух. Я довольно далеко, и даже Ханако меня ещё не видит.
    0x2BA3, // Вот, держите. Извините, что из пакетика, но это всё, что у них осталось.
    0x2C22, // Ханако осторожно берёт стакан из моей правой руки, и я аккуратно вкладываю второй в протянутую руку Лилли.
    0x2CE5, // Понравился тебе фестиваль, Хисао?
    0x2D23, // Да, было довольно весело.
    0x2D51, // Отвечаю я честно. Большая часть еды была не ахти, но зато под конец было и правда весело, особенно с Ханако и Лилли.
    0x2E21, // На самом деле я думаю, эти двое повеселились даже больше моего. Из-за нашего с Лилли присутствия замкнутость Ханако, обычно проявляющаяся в окружении других людей, уменьшилась настолько, что она начала получать удовольствие от происходящего.
    0x2FDD, // Пока мы сидим и пьём, раздаётся первый залп фейерверка, взрывающегося ярким дождём синих искр на фоне ночного неба, провозглашая начало конца фестиваля.
    0x30F5, // Его приветствуют весёлые крики из групп отдыхающих, разбросанных тут и там по школьной территории.
    0x31AB, // Мы с Ханако несколько минут наблюдаем за фейерверками в небе, а Лилли спокойно слушает их с закрытыми глазами.
    0x3275, // Красные, зелёные, жёлтые, в форме звёзд, кругов и узоров всех форм и расцветок, один за другим они наполняют воздух, танцуя по небу.
    0x3362, // Нигде рядом с моим прежним жильём не устраивалось такое щедрое представление. Фестивали, подобные этому, в больших городах канули в лету.
    0x345E, // Наблюдать подобное зрелище вместе с ними… Наверное, это лучшее, что со мной случалось за последнее время.
    0x3520, // Ну, вот и всё. Фестиваль подходит к концу.
    0x356B, // Ага.
    0x3573, // Она грустно вздыхает.
    0x359B, // Как бы я ни жаловалась на то, что на нас свалилось много хлопот, всё-таки жаль, что нам предстоит выпуститься до следующего фестиваля «Ямаку».
    0x369D, // Я делаю несколько шагов вперёд, подходя к Лилли, и мягко кладу руку ей на плечо.
    0x372D, // Не волнуйся. Мы в этом году ещё успеем сходить на Танабату, верно?
    0x37A4, // Ты прав. Было бы здорово сходить на этот праздник вместе.
    0x380C, // Проходят минуты молчания, сопровождаемые лишь взрывами фейерверков.
    0x388B, // Глядя на них двоих, я вспоминаю совет, который Лилли дала мне, когда мы вместе ходили в город.
    0x3934, // «Тебе стоит ценить возможность завести новых друзей», а?
    0x399C, // Эй, Лилли?
    0x39AE, // Она слегка поворачивает голову, показывая, что слушает. Ханако тем временем по-прежнему не отрывает взгляда от сочных цветов фейерверка над головой.
    0x3ABF, // Ты не против, если я и впредь буду пить с вами чай?
    0x3B19, // Улыбка на её лице служит мне наилучшим ответом.
    0x3B70, // Буду рада, Хисао.
};

#endif // KS_A1_SUNDAY_PROMISE_OF_TIME_RU_TL_INDEX