#ifndef KS_A1_SATURDAY_PROPER_EXERCISE_RU_TL_INDEX
#define KS_A1_SATURDAY_PROPER_EXERCISE_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_5D6C79F7_ru_intl[] = {
    0x0000, // Значит, пойдём и принесём ещё.
    0x0037, // Я открываю рот, чтобы сказать, что для такой простой задачи, как поиск ещё одной банки прусской лазури, не требуются двое, но Эми хватает меня за руку и тащит за собой.
    0x0165, // Я машу Рин, которая, кажется, вообще не замечает, что мы уходим.
    0x01D7, // Ну, она заметит, когда ей понадобится прусская лазурь и она её не найдёт.
    0x025B, // Наверное.
    0x026D, // …
    0x0271, // А может, и нет.
    0x028B, // Пока я размышляю о том, какая Рин странная, Эми тащит меня в кабинет рисования.
    0x031A, // Я чувствую, что начинаю задыхаться.
    0x035B, // Что за спешка?
    0x0375, // А?
    0x0379, // Эми бросает на меня оценивающий взгляд, будто пытаясь в чём-то разобраться.
    0x0403, // Просто кажется, что ты спешишь.
    0x043C, // Не уверен, что угонюсь за тобой.
    0x0476, // Её лицо озаряет понимание.
    0x04A7, // Ты ведь не выдохся, а?
    0x04CE, // В её тоне слышится игривость с нотками осуждения.
    0x0529, // Сначала меня так и подмывает возразить, но тут я понимаю, что тяжело дышу с того самого момента, как мы остановились.
    0x05FD, // Полагаю, всё довольно очевидно.
    0x0637, // Немного. Не могут же все быть в хорошей форме.
    0x068A, // Люди разные бывают, понимаешь?
    0x06C2, // Эми хмурится. Это не предвещает ничего хорошего.
    0x071B, // Э… в общем…
    0x0732, // Мне надо… прийти в форму?
    0x0761, // Я, честно говоря, уже давно решил попробовать.
    0x07B5, // После того приступа на стадионе я понял, что и правда стоит завести привычку бегать.
    0x084F, // Всё-таки я неплохо себя чувствовал до той ложной тревоги.
    0x08B8, // Ну, по правде говоря, нет. Но это было… весело?
    0x090C, // Тем временем моя реплика подталкивает Эми к какому-то выводу.
    0x097D, // Тогда решено.
    0x0996, // Она глядит на меня со всей серьёзностью.
    0x09E0, // Ты присоединишься ко мне.
    0x0A0F, // …
    0x0A13, // Прости?
    0x0A21, // По утрам.
    0x0A32, // Мы с тобой теперь напарники по бегу.
    0x0A74, // Я уже составила подробную программу. На самом деле…
    0x0AD4, // Она достаёт скомканный листок бумаги.
    0x0B1A, // Она у меня как раз с собой.
    0x0B4A, // Я беру листок и пробегаюсь по нему глазами.
    0x0B99, // Время, даты, круги – всё расписано.
    0x0BD9, // Медленный рост от нескольких кругов в день до…
    0x0C30, // Господи, она собирается заставить меня бегать марафоны?
    0x0C97, // И где она только нашла время всё распланировать?
    0x0CF0, // И вообще, в какой момент она этим занялась?
    0x0D3E, // Твоя идея?
    0x0D51, // В некоторой степени.
    0x0D77, // Но на самом деле это идея фельдшера!
    0x0DB9, // Он попросил меня присматривать за тобой, чтобы убедиться, что ты выполняешь упражнения, как он тебе и велел!
    0x0E7E, // Глобальный заговор?
    0x0EA3, // Может, Кендзи в чём-то и прав…
    0x0EDA, // Выглядит слишком обстоятельно для «присматривания за мной».
    0x0F4A, // Ну, если честно, я давно уже искала партнёра для утренних пробежек.
    0x0FC4, // О господи, Кендзи! Если б ты только знал, какой тут развернулся хитрый план!
    0x104D, // А зачем тебе вообще напарник?
    0x1083, // Легче заставить себя заниматься, когда ты не один это делаешь.
    0x10F5, // Разве не очевидно?
    0x1117, // Ты с меньшей вероятностью бросишь, если кто-то ещё будет рассчитывать на то, что ты придёшь, верно?
    0x11CA, // Понятно. И это не только заставит тебя продолжать, но и послужит гарантией того, что я тоже буду бегать.
    0x1286, // Значит, я буду исполнять волю фельдшера…
    0x12D2, // …а я буду за тобой присматривать, как он и просил!
    0x132D, // Ты быстро схватываешь, Хисао.
    0x1363, // А если я откажусь?
    0x1384, // Я, конечно, не собираюсь отказываться.
    0x13CA, // Но я должен хотя бы продемонстрировать признаки сопротивления так мастерски осуществлённому плану.
    0x1483, // Ну, если откажешься, то я буду дуться.
    0x14C7, // И тебе придётся жить, зная, что это ты заставил Эми Ибарадзаки дуться.
    0x1546, // Ты ведь не хочешь, чтобы подобное тяготило твою совесть, да?
    0x15B3, // Эми для наглядности начинает дуться.
    0x15F7, // Это самое очаровательное и душераздирающее зрелище, что мне когда-либо приходилось видеть.
    0x169F, // Хорошо! Я согласен!
    0x16C2, // Только… не делай так больше!
    0x16F7, // Я чувствую себя так, будто ударил щеночка!
    0x1744, // Значит, решено, да?
    0x1766, // Ты будешь моим напарником по бегу?
    0x17A5, // Соблюдать программу?
    0x17CC, // И режим питания?
    0x17EA, // Режим питания?
    0x1805, // Да, режим питания!
    0x1826, // Надо ведь переходить на здоровую пищу, если хочешь прийти в форму!
    0x189F, // Я внимательнее всматриваюсь в план.
    0x18E1, // Я не вижу тут режима питания.
    0x1916, // А, точно! Забыла тебе его дать!
    0x194D, // На свет появляется ещё один смятый листок.
    0x199B, // Уже не такой подробный.
    0x19C6, // Его мне помог составить фельдшер.
    0x1A04, // Фельдшер чуть ли не всего себя посвящает цели сохранить меня в добром здравии.
    0x1A94, // Не много я знаю сотрудников школы, которые бы подсылали своих учеников шпионить за мной, а уж тем более помогали бы составить для меня режим питания.
    0x1BA4, // Но, с другой стороны, я ведь не в обычной школе.
    0x1BF9, // И, наверное, это не так уж плохо.
    0x1C33, // Но всё же этот режим, похоже, собирается лишить меня всего, что будут предлагать завтра на фестивале.
    0x1CEB, // Хм.
    0x1CF1, // И когда начинаются пробежки?
    0x1D26, // После фестиваля.
    0x1D45, // Сразу после? А если я там что-нибудь съем? Живот ведь заболит.
    0x1DB4, // Я имела в виду, что на следующий день после фестиваля.
    0x1E16, // Так и знал.
    0x1E2A, // Разве мы не должны были что-то сделать?
    0x1E71, // А! Надо ведь найти ту краску для Рин, да?
    0x1EB9, // О нет! Из головы выскочило!
    0x1EEA, // Нам удаётся раздобыть краску, но по возвращении к фреске выясняется, что Рин уже ушла.
    0x1F87, // Ну и ладно.
    0x1F9B, // Мы с Эми расходимся, оставив краску на земле.
    0x1FED, // Рин её найдёт, когда вернётся.
    0x2024, // Фестиваль уже завтра. Честно говоря, я жду его с лёгким нетерпением.
    0x20A0, // Но в то же время эта неделя меня порядком вымотала, так что я недолго читаю и ложусь спать.
};

#endif // KS_A1_SATURDAY_PROPER_EXERCISE_RU_TL_INDEX