#ifndef KS_A1_SUNDAY_MOVEMENT_RU_TL_INDEX
#define KS_A1_SUNDAY_MOVEMENT_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_B5F8B4E8_ru_intl[] = {
    0x0000, // Только мы расставляем фигуры, как вдруг до нас доносится стук в дверь.
    0x0080, // Добрый день.
    0x0097, // Лилли…
    0x00A5, // О… С возвращением, Лилли. Ты уже закончила?
    0x00F4, // Значит, вы здесь? Чудесно. Учитель попросил помочь других ребят, так что мне наконец-то удалось освободиться. Вы тут с тех пор, как ты ушёл, Хисао?
    0x01FB, // Большую часть времени. Мы немножко поиграли в шахматы.
    0x025F, // Н-не хочешь выпить чашечку чая?
    0x0298, // Если честно, у меня появилась, как мне кажется, довольно неплохая идея: прогуляться за пределы школы…
    0x0352, // Ханако мгновенно падает духом, что сразу же отражается на её лице, хоть она ничего и не говорит.
    0x0400, // Я почему-то чувствую себя обязанным озвучить отражённые на лице Ханако мысли, которые ясно вижу я, но не может увидеть Лилли.
    0x04E4, // Мне… мне кажется, что нам стоит остаться здесь…
    0x053D, // В самом деле? Сейчас в школе слишком людно, и поэтому я подумала, что мы могли бы сходить в расположенный неподалёку чайный дом.
    0x0625, // Ты имеешь в виду «Ш-Шанхай»?
    0x0658, // Именно. Пока все на фестивале, там должно быть практически пусто.
    0x06CF, // Чайный дом?
    0x06E4, // Ах да, кажется, мы тебе о нём ещё не рассказывали.
    0x073D, // Этот чайный дом находится совсем неподалёку отсюда, и мы посещаем его время от времени.
    0x07DD, // А что, неплохая идея. Ханако, как думаешь?
    0x0828, // Вовлечённая в разговор против своей воли, Ханако слегка вздрагивает, но зато сосредотачивается.
    0x08D9, // Ес… если в «Шанхай», то ладно.
    0x0910, // В таком случае решено. Пойдёмте.
    0x094B, // Мы с Ханако встаём из-за стола, прерывая шахматную партию.
    0x09B5, // Не успеваю я и глазом моргнуть, как Ханако собирает фигурки в маленький ящичек и убирает доску.
    0x0A63, // Похоже, теперь мы готовы. Пожалуйста, ведите.
    0x0AB5, // Ханако встаёт рядом с Лилли, и мы выходим в коридор.
    0x0B13, // Девушки проводят меня через несколько незнакомых дверей, и мы выходим на улицу с противоположной от места проведения фестиваля стороны.
    0x0C0E, // Приглушённый толстыми каменными стенами здания шум, исходящий от столпотворения людей, затухает до невнятного шёпота.
    0x0CE9, // Странно, я думал, что в такое-то время люди уже начнут расходиться…
    0x0D64, // Они, наверное, всё ещё здесь из-за фейерверка.
    0x0DB7, // Фейерверка?
    0x0DCD, // Да. Похоже, школа приготовила настоящее представление. Множество горожан прибыло именно ради того, чтобы на него посмотреть.
    0x0EB2, // Теперь мне становится понятным решение Лилли покинуть территорию школы. Сложно представить, как Ханако справилась бы с тем, что население всего города свалилось на школу как снег на голову. Или, применительно к «Ямаку», поднялось.
    0x1058, // С момента моего перевода сюда мы с Лилли уже во второй раз спускаемся по этой дороге.
    0x10F3, // Лишь теперь, когда я едва могу слышать оставшийся позади непрекращающийся гул фестиваля, становится понятно, насколько же он был оглушительным. В тишине вечернего воздуха я замечаю незначительный звон в ушах, восстанавливающихся от оказанного на них днём давления.
    0x12DB, // Ханако, пусть и вцепившись в Лилли, всё-таки умудряется вести её по дороге. Поэтому, а также из-за любопытных взглядов случайных прохожих, она вновь полностью замыкается.
    0x1411, // Она редко отрывает взгляд от дороги перед собой, и от неё не слышно ни слова.
    0x149C, // С другой стороны, Лилли, как и в школе, придерживается своего обычного чопорного и благопристойного образа. Очевидно, что она намеренно выставляет свою внешность напоказ, а не старается её скрыть, подобно Ханако.
    0x1620, // Удивительно, насколько же по-разному они держатся за пределами «Ямаку». И очевидно, что они обе существенно изменяются.
    0x16FB, // {vspace=90}Каждый в «Ямаку» – «особенный», что сводит на нет всю эту «особенность».
    0x178B, // Однако, стоит лишь выйти за пределы школьных ворот, мы вновь ощущаем себя «изгоями».
    0x1825, // Особенно если мы идём в своей школьной форме. Будто вешаем себе на шею объявление, побуждающее людей заинтересоваться, что же с нами не так.
    0x1924, // Я удивляюсь тому, что большинство учеников выходит за пределы школы, не снимая её. Правда, многие из них передвигаются с помощью трости или инвалидной коляски, поэтому она поясняет то, что и так очевидно.
    0x1A97, // {vspace=30}Или, быть может, я единственный, кто воспринимает нашу форму как клеймо? Возможно, я привыкну к ней через некоторое время, как и к любой другой школьной форме.
    0x1BC1, // Снаружи чайный дом выглядит довольно обыкновенно: кафе с типичной вывеской над входом.
    0x1C61, // Оно похоже на одно из тех мест, мимо которого вы пройдёте не задумываясь, не обратив внимания на очередное заурядное кафе средь морской пучины тысяч подобных заведений.
    0x1D96, // Если бы Ханако не направила Лилли ко входу, я бы продолжил идти по дороге, так и не узнав о его существовании.
    0x1E5C, // Интерьер выполнен в традиционном стиле. Всё выглядит так, словно выпилено из одного бруска дерева, начиная с прилавка и скамеек и заканчивая креслами с высокими спинками вдоль стен.
    0x1FA9, // Но самой поразительной особенностью этого помещения является его безлюдность. На кухне за стеной вроде бы что-то кипит, но помимо этого стоит тишина.
    0x20BB, // Не услышав какого-либо приветствия, мы просто стоим рядом со входом, вежливо повинуясь надписи «Пожалуйста, подождите, вас проводят».
    0x21B0, // Э-э, тут что, сегодня закрыто?
    0x21E5, // Звук упавшего стула эхом разносится по помещению, и тут же из-за стойки появляется голова.
    0x228A, // Я не спала, и добро пожаловать в «Шанхай»!
    0x22D6, // Юко, одетая в пастельный передник и держащая в руках меню, бросается нам навстречу. Съехавшие очки и растрёпанные волосы заставляют усомниться в её предыдущем утверждении.
    0x2412, // Но спала она или нет – отнюдь не первый вопрос, что возникает у меня в голове.
    0x249F, // Ты теперь здесь работаешь? А как же библиотека?
    0x24F5, // А? Лилли? Хисао?
    0x2511, // Добро пожаловать в «Шанхай»!
    0x2546, // Ещё просыпающаяся Юко в неистовом поклоне сбивает с себя очки.
    0x25B9, // А?! Мои очки…
    0x25D1, // Пока я поднимаю их с пола, Лилли всё объясняет.
    0x2626, // Юко работает здесь на полставки, как и в библиотеке. И это одна из причин, по которой мы любим проводить здесь время.
    0x26F9, // Юко забирает у меня очки и дрожащими руками возвращает их на место.
    0x2774, // Да… это так… спасибо…
    0x279F, // Могу я проводить вас к столику?
    0x27D8, // Посетителей сейчас больше нет, так что вы можете занять любой понравившийся вам столик и сразу же сделать заказ. Но всё же вам придётся немного подождать, потому что готовить буду я сама…
    0x292F, // Ничего, Юко. Нам чайничек чёрного чая и тарелку бутербродов, пожалуйста.
    0x29B3, // Хорошо! Я сейчас же займусь!
    0x29E6, // Юко устремляется во внутреннюю часть кафе, оставив нас стоять у входа.
    0x2A67, // Она раздвигает дверки-половинки, когда вспоминает, что так и не усадила нас.
    0x2AF2, // Извините! Извините! Пожалуйста, усаживайтесь там, где понравится! Я скоро вернусь!
    0x2B88, // Последовав её совету, я подвожу Лилли к ближайшей кабинке. Ханако шагает следом.
    0x2C1B, // Присаживаясь рядом с Лилли, я понимаю, насколько это место подходит Ханако.
    0x2CA5, // Высокие стенки кабинки полностью отделяют нас от остального помещения, и не похоже, что здесь бывает много посетителей.
    0x2D81, // Все предметы обстановки, от подушек на скамейках до подставок для приправ, выглядят старыми, но не изношенными.
    0x2E4D, // Интересно, осознанно ли Лилли выбирает подобные места для провождения времени с Ханако? Создаётся впечатление, что она готова пойти куда угодно, лишь бы её подруга не испытывала дискомфорта.
    0x2FAB, // Итак, Хисао, я и не знала, что ты играешь в шахматы…
    0x3008, // Не сказать, что я мастер, но правила знаю.
    0x3053, // Полагаю, логично будет спросить… кто победил?
    0x30A8, // Невинная улыбка Лилли ставит меня в тупик. Я совершенно не желаю кичиться своей победой над Ханако.
    0x315E, // Х-хисао.
    0x316D, // Да… но, м-м, с небольшим преимуществом…
    0x31B6, // Проклятие. Теперь я чувствую себя так, словно совершил что-то ужасное.
    0x3236, // Отлично, Хисао. Ты сделал то, в чём я постоянно терпела неудачу.
    0x32A9, // Э-э, спасибо. Я давным-давно не играл, потому было здорово сыграть вновь.
    0x332C, // Д… да… Было здорово.
    0x3353, // Ханако в волнении поправляет волосы и отводит взгляд, но лёгкая улыбка всё же появляется на её лице.
    0x340A, // Реакция несколько более яркая, чем я ожидал, но по-своему милая.
    0x347E, // Она застигает меня врасплох. И лишь подобное стихийному бедствию появление Юко возвращает мне дар речи.
    0x353D, // Ты в порядке, Юко? Может, тебе помочь?
    0x3580, // Всё в порядке, всё в порядке, всё в порядке. Я всё сделаю, это моя работа.
    0x3602, // С крайне сосредоточенным лицом Юко устремляет взгляд на поднос, который несёт, словно просто лишь глядя на него она способна удержать его содержимое на месте.
    0x3725, // К сожалению, это не производит никакого эффекта: чашки и блюдца медленно начинают танцевать по кругу, позвякивая при каждом столкновении друг с другом.
    0x383B, // С большой осторожностью Юко ставит поднос на стол. В итоге посуда на нём лишь слегка дзынькает.
    0x38E9, // Вот видите!
    0x38FE, // Э-эм, молодец.
    0x3917, // Спасибо, Юко.
    0x392F, // Прежде чем ответить, Юко склоняет голову в фирменном поклоне.
    0x39A0, // Всегда пожалуйста.
    0x39C3, // Может, присоединишься к нам? Я хотела бы обсудить с тобой мой недавний заказ, если можно…
    0x3A66, // А ведь и правда, когда я впервые встретился с Ханако, Лилли и Юко обсуждали какие-то книги.
    0x3B0A, // Какую-то литературу для Лилли на Брайле…
    0x3B56, // Ах… да. У нас так и не было возможности перебрать их, так ведь?
    0x3BC7, // Юко спешно садится рядом с Ханако.
    0x3C06, // Очевидно, преданность Юко работе не сильнее сосредоточенности; стоит ей лишь немного пошатнуться, и она тут же забывает про неё.
    0x3CF1, // Я буду в библиотеке завтра днём, если захочешь попробовать ещё раз…
    0x3D6E, // Замечательно, тогда я встречусь там с тобой после уроков.
    0x3DD7, // М-м… Л-Лилли…
    0x3DF1, // Боже мой, точно. Завтра понедельник, как я могла забыть?
    0x3E56, // Не совсем понимаю, о чём они толкуют. Что и неудивительно: я здесь всего неделю, так что с распорядком каждого ученика едва ли могу быть знаком.
    0x3F5A, // В таком случае нам стоит заново договориться.
    0x3FAE, // Юко, а ты будешь в библиотеке в другие дни недели?
    0x4008, // Хм, может быть, но будет слишком поздно…
    0x4052, // И-и мне кое… кое-что надо…
    0x4083, // Это может быть проблематично…
    0x40BC, // Лилли на секунду задумывается, но затем отвечает.
    0x4117, // Интересно, сможем ли мы попросить кого-нибудь нам помочь, если будет нужно?..
    0x41A2, // М-м, что будет нужно? Я как-то потерял нить разговора…
    0x4204, // Не люблю, когда меня в добровольно-принудительном порядке заставляют заниматься чем-то, о чём я не имею ни малейшего понятия.
    0x42E9, // А я-то думал, что мне удалось вырваться из объятий Школьного совета и их неоднократных попыток меня завербовать.
    0x43B7, // О, конечно. Как-то на днях я помогала Юко сортировать новые книги на Брайле, поступившие в библиотеку.
    0x4470, // Но по понедельникам мы с Ханако обычно ходим по магазинам: меньше народа, чем в выходные.
    0x4512, // На прошлой неделе мы не смогли пойти, потому что я была занята подготовкой к фестивалю. И хотя мне удалось вырваться в конце недели, но тогда уже не смогла Ханако.
    0x4639, // И, так как я всё равно не понимаю шрифт Брайля, полагаю, ты хотела бы, чтобы я сходил с Ханако по магазинам?
    0x46F9, // Правильно. Ты бы очень мне этим помог.
    0x473E, // Думаю, мне это по плечу. Ханако, что скажешь?
    0x478E, // Е-если ты не против…
    0x47B4, // Конечно же нет. Я всё ещё не знаком с магазинами в округе, так что, думаю, это неплохая идея.
    0x4859, // Х-хорошо.
    0x486A, // Теперь, когда мы всё решили, может быть чаю?
    0x48B9, // И тут я понимаю, что мой чай за время беседы отнюдь не становился горячее.
    0x493F, // Это моя вина! Позволь налить тебе другой…
    0x498C, // Юко протягивает дрожащие руки, но я останавливаю её: не похоже, что она в состоянии управиться с кипятком.
    0x4A4D, // Всё в порядке, оставь. Раз ты уже сделала чай и бутерброды, то выполнила свои обязанности официантки, верно?
    0x4B11, // П… полагаю, что да.
    0x4B34, // Юко немного успокаивается, но всё ещё напряжённо наблюдает, как я делю бутерброды.
    0x4BCB, // Я собираюсь откусить кусок бутерброда, но тут снаружи раздаётся громкий низкий грохот одновременно со вспышкой света.
    0x4CA5, // А, полагаю, фейерверк начался.
    0x4CDC, // Взглянув в окно, только сейчас я понимаю, что на смену сумеркам на город опустилась ночь.
    0x4D7E, // Искры взрывающихся снарядов образуют фонтаны фейерверков, напоминающие огромные цветы.
    0x4E21, // Пойдёмте посмотрим!
    0x4E46, // Ой… извини, Лилли…
    0x4E6A, // Пожалуйста, обо мне не беспокойтесь. Я слышала, что из этого кафе на салют открывается довольно неплохой вид.
    0x4F31, // Мы все, за исключением Лилли, несёмся к окну небольшой чайной, чтобы посмотреть фейерверк.
    0x4FD6, // Вспышки цветных огней играют на лицах Ханако и улыбающейся Юко, и я даже на секунду забываю о том, что собирался смотреть на происходящее за окном.
    0x50E2, // Даже в этом совершенно новом мире есть несколько вещей, что остаются неизменными.
    0x5178, // Наверное, потому школа и создала такой ажиотаж вокруг этого фестиваля, что он даёт шанс показать сходство между всеми людьми.
    0x525E, // Представление заканчивается слишком быстро; фейерверки дорогие и бьют по карману даже хорошо финансируемым школам.
    0x5334, // Прежде чем вернуться к чаю с бутербродами, Ханако поворачивается ко мне.
    0x53B9, // М-м, с-спасибо за сегодняшний день…
    0x53FA, // …и за завтрашний.
    0x541B, // Всё хорошо. Не думаю, что я и сам любитель потолкаться в толпе народа.
    0x5499, // Такой день, как этот, намного приятнее проводить где-нибудь далеко ото всех, правда же?
    0x5537, // А-ага.
    0x5542, // Однако наше чаепитие слишком затянулось, поэтому давай вернёмся к столу.
    0x55C8, // Т-точно.
    0x55D7, // Мы возвращаемся в нашу кабинку, к бутербродам.
    0x562C, // Звучало впечатляюще. По меньшей мере громче, чем в прошлом году.
    0x56A1, // Ага, было здорово! Ни разу не видела, чтобы они организовывали такое представление.
    0x5739, // С каждым годом оно становится всё лучше.
    0x5783, // Всё же боюсь, что за это время чай остыл.
    0x57CC, // О нет! Позволь мне налить новый! Это моя вина!
    0x581E, // Успокойся, Юко, в этом никто не виноват.
    0x5866, // Я делаю глоток из своей чашки, просто чтобы подтвердить её слова.
    0x58DD, // Остыв, этот чай не стал плохим. Лишь стал похож на чай со льдом.
    0x594F, // Правда?
    0x595D, // Да, правда. А если ты добавишь немного сахара, то станет просто отличным.
    0x59E1, // Ты уверен?
    0x59F4, // Абсолютно. Давай ты присядешь и попьёшь его с нами?
    0x5A51, // Х-хорошо.
    0x5A62, // Не похоже, что я убедил Юко, но она всё же садится.
    0x5ABC, // Она аккуратно насыпает пять чайных ложечек сахара себе в чашку.
    0x5B31, // Э-э, я сказал «немного» сахара…
    0x5B6B, // Знаю, но мне нравится, когда чай сладкий.
    0x5BB5, // Я с любопытством заглядываю в её чашку. Как я и предполагал, такое количество сахара отказывается растворяться в остывшей жидкости.
    0x5CA7, // Дважды помешав ложечкой, она поднимает чашку и одним глотком выпивает всё содержимое.
    0x5D45, // Ты прав, он не так уж и плох!
    0x5D77, // Э-э, хорошо…
    0x5D8E, // Я поворачиваюсь к Лилли и Ханако. Пока я наблюдал за Юко, они уже закончили есть.
    0x5E20, // Не желая всех задерживать, я следую примеру Юко и допиваю остатки своего чая одним глотком.
    0x5EC7, // Кажется, теперь мы закончили.
    0x5EFD, // Возвращаемся, или кто-то хочет повторить?
    0x5F49, // На лице Юко ясно отражается, что это плохая идея.
    0x5FA2, // Думаю, лучше бы нам уже возвращаться в школу.
    0x5FF4, // В конце концов, мы должны вернуться до отбоя.
    0x6046, // Ох, в этом определённо есть смысл.
    0x6084, // Встретимся завтра, Юко.
    0x60AF, // Буду ждать, Лилли. До свидания, ребята.
    0x60F5, // Мы выходим из маленькой чайной, погружаясь в ночную темноту.
    0x6164, // Ханако вновь цепляется за Лилли. Сейчас, под покровом темноты, она кажется не такой напряжённой, как по пути сюда.
    0x6233, // Навстречу нам начинают попадаться группы людей, покидающих территорию школы. Чтобы избежать встречи с ними, Ханако ведёт нас в обход.
    0x6328, // Дойдя до общежитий, мы замечаем, что школа кажется необычайно тихой в сравнении с гулом фестивального дня.
    0x63EB, // Спасибо за сегодня. Думаю, я узнал много нового.
    0x6442, // Всегда пожалуйста. А теперь, боюсь, мне пора откланяться. Сегодня был длинный день.
    0x64D9, // И правда, Лилли весь день провела на ногах; представляю, как должна была утомить её прогулка за пределы школы.
    0x65A1, // Я ощущаю укол вины, вспомнив, что я, наверное, единственный в школе, кто встал сегодня около десяти.
    0x6655, // Без проблем.
    0x666C, // В таком случае увидимся с вами завтра. Спокойной ночи.
    0x66CF, // Спокойной ночи, Хисао.
    0x66F8, // С… спокойной.
    0x6712, // Мы с девушками расходимся по общежитиям.
};

#endif // KS_A1_SUNDAY_MOVEMENT_RU_TL_INDEX