#ifndef KS_CHOICE_NOT_GOOD_CONDITION_RU_TL_INDEX
#define KS_CHOICE_NOT_GOOD_CONDITION_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_5116FB4A_ru_intl[] = {
    0x0000, // Всё в порядке, надо только перевести дух. Последнее время я не в лучшей форме.
    0x008D, // А…
    0x0093, // Это что-то… связанное с твоим переводом сюда? То есть…
    0x00F8, // Она довольно резко себя обрывает, возможно поняв, что проявила назойливость. Но у неё чуткая интуиция, и, хоть я и не люблю говорить на эту тему, врать вовсе ни к чему.
    0x0225, // Думаю, я не против, если об этом спрашивает Лилли.
    0x027F, // Просто я в последнее время немного ослабел.
    0x02CF, // Ханако сказала, что ты выглядишь довольно… здоровым, так что я подумала…
    0x0356, // Лилли снова прерывает себя на середине предложения, с долей беспокойства оставляя эту тему.
    0x03FF, // Её нахмуренный лоб заставляет меня сказать ещё что-то, чтобы её успокоить.
    0x0487, // Удивительно, что она так деликатна, учитывая её прямое и открытое отношение к собственной слепоте. Она, видимо, понимает, что не всем комфортно говорить о таких вещах.
    0x05B7, // Нет, всё в порядке.
    0x05D9, // У меня… думаю, лучше всего сказать, что сердце моё… барахлит. Аритмия.
    0x065A, // Не так давно у меня случился сердечный приступ, и я провёл большую часть весны в больнице. Угодил в «Ямаку» по распоряжению врача.
    0x0747, // Она молча кивает.
    0x0767, // Однако мой ответ заставляет Лилли нахмурить лоб ещё сильнее. Похоже, она не знает, как реагировать, учитывая, что мы не так уж близко знакомы.
    0x0868, // Я не могу её за это винить, у меня у самого такая же реакция.
    0x08D4, // Хоть мне и хочется унять её беспокойство, говорить об этом желания тоже нет.
    0x095F, // Не беспокойся об этом.
    0x0988, // Я пытаюсь обнадёживающе улыбнуться, но осознаю бесполезность этого действия. Не зная об этом, Лилли успокаивающе улыбается мне и ничего больше не произносит.
    0x0AAA, // Когда мы подходим к общежитиям, Рин останавливается перед своей фреской как громом поражённая. Она была так тиха на протяжении всей обратной дороги, что я почти забыл о её присутствии.
    0x0BFB, // Сегодня ведь пятница, да?
    0x0C29, // Да… пятница, восьмое июня.
    0x0C5A, // Плохо дело.
    0x0C6F, // Плохо? Почему?
    0x0C89, // Кажется, я сейчас приму позу зародыша и проблююсь. Возможно, в обратном порядке.
    0x0D1B, // Что-то случилось?
    0x0D3B, // Нет. Ничего не случилось. Сегодня пятница, и пока ничего не случилось. Фреска, её надо закончить к воскресенью. Значит, всё в порядке.
    0x0E2C, // У вас есть наркотики? Или машина времени?
    0x0E77, // Это нехорошо. Нехорошо.
    0x0EA2, // Значит, она отстаёт от графика. Вспомнив недовольство Сидзунэ беззаботным отношением Рин к проекту несколько дней назад, я не знаю, что и думать.
    0x0FAB, // Она напросится на «тебе же говорили», если не справится со всем к воскресному утру.
    0x1043, // Рин продолжает смотреть на свою фреску с невероятно подавленным видом.
    0x10C6, // Оставьте меня. Мне нужно немного поработать.
    0x1118, // Я смотрю на Лилли, ожидая, что она обменяется со мной скептическими взглядами и я закачу глаза, но потом осознаю, что она этого не сделает.
    0x1213, // Оставьте меня.
    0x122E, // Мы, конечно, так и делаем, чтобы не раздражать её ещё сильнее.
    0x129D, // В животе у меня начинает шевелиться нехорошее чувство. У Рин определённо талант заставлять людей волноваться о ней.
    0x1372, // Она похожа на человека, которого нельзя оставлять одного.
    0x13DC, // Может, нам следует кого-нибудь позвать? Голос у неё был такой, будто она вот-вот впадёт в истерику или вроде того.
    0x14A9, // Уверена, с ней всё будет в порядке. Просто она… э… как бы сказать…
    0x1523, // Лилли немного запрокидывает голову, пытаясь придумать вежливый способ назвать Рин сумасшедшей, не называя её сумасшедшей.
    0x1605, // Своеобразная?
    0x161F, // Да, весьма своеобразная личность.
    0x165D, // Наверное, можно и так сказать.
    0x1694, // Она мелодично хихикает, кивая в знак согласия.
    0x16E9, // Извини, что не поддержала твою беседу с ней. Я… не совсем её понимаю, поэтому держусь подальше.
    0x1796, // Значит, я был прав. Лилли чуть виновато улыбается, будто бы сожалея о том, что её несовершенство не позволило ей сблизиться с Рин.
    0x1881, // Я не могу её винить. Совсем.
    0x18B3, // Лилли глубоко вздыхает, возможно скрывая таким образом зевок. Наверняка она так же измотана, как и я.
    0x196B, // Я, наверное, пойду, отдам продукты Ханако. Спасибо за компанию, Хисао.
    0x19E9, // Она очаровательно улыбается мне. Как-то иначе, чем обычно, несмотря на то, что улыбается она часто.
    0x1A9C, // Не могу точно понять, в чём именно заключается разница. Просто по-другому.
    0x1B23, // Я бы сказал, расслабленно, но, возможно, это просто облегчение, оттого что удалось избавиться от Рин. Наверное.
    0x1BEC, // Угу… спокойной ночи. Передавай привет Ханако.
    0x1C41, // Передам. Спокойной ночи.
    0x1C6E, // К моему удивлению, её лицо вдруг озаряет понимание.
    0x1CCC, // Постой… так, значит, в тот раз, когда вы с Эми столкнулись в коридоре?..
    0x1D4C, // Я криво усмехаюсь. Не думал, что она способна настолько быстро складывать детали в общую картину.
    0x1DFE, // Да. Наверное, я прямо-таки ходячая книжная иллюстрация к тому, зачем существуют правила насчёт бега по коридорам.
    0x1ECD, // Мои слова звучат куда холоднее, чем я рассчитывал. Из-за них у Лилли явно пропадает желание развивать тему.
};

#endif // KS_CHOICE_NOT_GOOD_CONDITION_RU_TL_INDEX