#ifndef KS_A1_FRIDAY_NO_FREE_LUNCH_RU_TL_INDEX
#define KS_A1_FRIDAY_NO_FREE_LUNCH_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_63FD258B_ru_intl[] = {
    0x0000, // Оказавшись в кабинете Совета, я оглядываюсь по сторонам и вижу, что он пуст.
    0x008A, // Значит, работы осталось немного, да? Раз никого больше нет, и вообще.
    0x0106, // Здесь всегда так, Хиттян~!
    0x0135, // Это подтверждает мои догадки, которые мне доселе нечем было подкрепить: Сидзунэ и Миша – это и есть Школьный совет. Весь, целиком.
    0x0222, // Проклятье! Значит, это правда. В Школьном совете действительно только вы двое.
    0x02B1, // Сидзунэ выглядит так, будто не может определиться: устыдиться или взорваться от злости, а Миша в той же степени разрывается между смехом и попытками остановить Сидзунэ.
    0x03E6, // …
    0x03EA, // Что ж, Хиттян, ты будешь рад узнать, что поскольку нас всего трое, то работы для нас полно! Полно~! Полно~ полно~ полно~…
    0x04C0, // Это меня не радует.
    0x04E3, // Но, похоже, очень радует Сидзунэ.
    0x051F, // Ва-ха-ха~!
    0x0530, // Шучу-шучу!
    0x0543, // …
    0x0547, // На самом деле не так уж много, Хиттян~. Поэтому~, можно сначала позволить себе небольшой ланч.
    0x05F0, // Ха-ха-ха~!
    0x0601, // У обеих будто из воздуха появляются пластиковые контейнеры.
    0x0670, // Хм~ хм~… Тут куриные отбивные с помидорами и ростками соевых бобов~! Разве не аппетитно звучит, Хиттян?
    0x072B, // Приготовлено только сегодня утром, и всё ещё тёплое, так что ешь-ешь-ешь~!
    0x07B0, // Я беру один из контейнеров и открываю его. Выглядит симпатично и пахнет приятно. То, что я очень голоден, только усиливает эффект.
    0x089C, // Ого, выглядит здорово. Где вы это достали?
    0x08E8, // …
    0x08EC, // Это неважно, Хиттян!
    0x0911, // Предполагалось сделать киоск, продающий бэнто, но девушка, которая собиралась им заведовать, вдруг сказала, что не сможет. Ситтян сказала: «Какое расточительство, ведь так сложно было заманить Хиттяна сколотить его~»—
    0x0AA1, // Эй, какого лешего…
    0x0AC4, // …Так что~! Ситтян решила попробовать свои силы в этом, но потом решила, что не стоит, да, Ситтян~?
    0x0B72, // Сидзунэ сердито дуется, сверля Мишу недовольным взглядом. Кажется, эта история не предназначалась для моих ушей.
    0x0C41, // Это ваши пробники?
    0x0C63, // …
    0x0C67, // Я тоже это ем, Хиттян~!
    0x0C8F, // И Ситтян тоже~!
    0x0CAA, // Это не ответ на мой вопрос!
    0x0CDB, // И всё же я разламываю пару палочек, которые протягивает мне Сидзунэ, подцепляю кусок отбивной и засовываю его в рот.
    0x0DAF, // На удивление вкусно. Не ожидал, что Сидзунэ так хорошо готовит.
    0x0E22, // Сидзунэ кладёт палочки, чтобы резко прожестикулировать Мише, которая с трудом заглатывает свою отбивную, чтобы озвучить её слова.
    0x0F11, // Хиттян~! Не говори с набитым ртом~!
    0x0F4F, // Не очень-то мне это и нравится. А вот ты излучаешь просто материнскую заботу…
    0x0FDD, // …
    0x0FE1, // Ты даже есть правильно не можешь, Хиттян~! Вот и всё~!
    0x1040, // Это тупик. Я не могу есть, чтобы говорить с Сидзунэ, которая не может есть, чтобы критиковать меня за неумение есть. Миша оказывается втянутой в ту же ситуацию и выглядит из-за этого наиболее несчастной.
    0x11B0, // К тому же наша еда остывает с каждой секундой, а она изначально не была такой уж горячей. Как только мы осознаём это, тут же возвращаемся к трапезе.
    0x12BB, // Вскоре звонит колокол, но Миша даже не пытается сообщить об этом Сидзунэ, из чего я делаю вывод, что они собираются пропустить уроки и снова провести здесь остаток дня.
    0x13ED, // …
    0x13F1, // Хиттян, у тебя есть какие-нибудь планы на фестиваль?
    0x1450, // Нет, не особо. В конце концов, я здесь всего неделю, какие планы я мог построить за это время?
    0x14F7, // Ва-ха-ха~! Хиттян, ты ведь нам так здорово помог, не будь о себе такого плохого мнения!
    0x1591, // Хорошо.
    0x159F, // …
    0x15A3, // Мы серьёзно~!
    0x15BB, // Хорошо!
    0x15C9, // Они возмущаются по самым невероятным поводам.
    0x161E, // …
    0x1622, // Но ты же пойдёшь, да, Хиттян? Ты должен хотя бы посмотреть на то, что мы о—существили?.. Все должны иметь возможность увидеть результаты своих трудов, так они могут в полной мере насладиться сделанным, я так считаю~! И ты не исключение!
    0x17CA, // Хиттян, ты обязательно должен пойти~! Если у тебя нет никаких планов, то мы даже можем пойти вместе~!
    0x187F, // Вам не хватает рук? Если вам понадобится помощь, я буду не прочь её оказать.
    0x1908, // Я чувствую себя гораздо более непринуждённо, чем раньше; все мои беспокойства и страхи без следа испарились. Веселясь вот так с Сидзунэ, до этого момента я и не вспоминал об эксцессе, случившемся утром.
    0x1A78, // Веселясь с Сидзунэ… Сама мысль об этом кажется странной, но, если взглянуть со стороны, я, несмотря ни на что, действительно наслаждаюсь тем временем, что провожу вместе с Сидзунэ и Мишей в последние несколько дней.
    0x1C00, // Если мы пойдём вместе, то я, наверное, могу себе позволить ещё немного побыть с ними. И я полагаю, что это лучше, чем сидеть на уроке.
    0x1CEE, // …
    0x1CF2, // Правда, Хиттян? Отлично~! Мы будем считать, что так ты с нами рассчитываешься за бесплатный ланч~!
    0x1DA2, // Здорово, это здорово, очень~ очень~ здорово~! Ситтян всё равно собиралась позже это предложить! А-ха-ха-ха~! Ва-ха-ха-ха-ха-ха~!
    0x1E82, // Это вовсе не бесплатный ланч. В другой ситуации я бы из-за такого разозлился или как минимум немного расстроился, но моё настроение значительно поднялось, поэтому я не обращаю на это внимания.
    0x1FE1, // Оказалось, что помощь состоит в основном в проштамповывании форм и изготовлении здоровенных стопок копий каждого из пятидесяти бюджетных отчётов.
    0x20F0, // Это не сложно, но ужасно скучно и, по словам Миши, является простейшей из стоящих перед ними задач.
    0x21A3, // Я чувствую, что устаю всё сильнее и сильнее, и вместе с тем всё меньше горю желанием вернуться на урок. Это особенно плохо, потому что чем дольше я нахожусь за пределами класса, тем сложнее, кажется, встать и вернуться.
    0x232E, // Эти двое оказывают ужасное влияние. Они подают никудышный пример. Не сказать, что меня это так уж сильно волнует, и я уверен, что никто не воспринимает их как образцы для подражания, но всё же…
    0x248C, // …
    0x2490, // Готово~!
    0x249F, // Ого, быстро. Думаю, я до конца этого урока тоже закончу.
    0x2503, // Нет, нет, Хиттян, всё готово. Значит, ты тоже заканчиваешь~!
    0x256D, // Чушь какая-то! Вы что, утверждаете, что делать это было не обязательно и вы держали меня тут просто шутки ради?
    0x2635, // Нет~…
    0x2640, // …
    0x2644, // Но мы продержали тебя достаточно долго~! Тебе нужно вернуться на урок, Хиттян~! На большую его часть ты ещё успеешь!
    0x2715, // А как же вы?
    0x272A, // …
    0x272E, // Конечно, мы тоже пойдём, само собой. Прямо за тобой!
    0x278B, // Успокоившись, я направляюсь обратно в класс. Но прошла уже почти половина урока, так что на полпути я решаю, что это бессмысленно, и коротаю время до следующего урока, попивая сок в коридоре.
    0x28E5, // Я поглядываю на дверь кабинета Совета, но она не открывается. Что они там копаются? Доделывают мою часть работы? Ну, это не должно занять много времени, если только там нет ещё работы и они просто хотели, чтобы я ушёл.
    0x2A6D, // Чем дольше я об этом думаю, тем больше в этом уверяюсь.
    0x2AD0, // Сидзунэ… далеко не глупа, но она определённо не способна говорить о таких вещах прямо.
    0x2B6F, // Возможно, это потому, что она не может говорить и для неё это труднее. У неё есть Миша, но, в общем, несмотря на напускную лёгкость, между языком жестов и обычной речью есть разница.
    0x2CB5, // Я собираюсь вернуться и посмотреть, что они там делают, но раздаётся звонок и мне приходится идти в класс.
    0x2D76, // Они тоже приходят через несколько минут, и мои былые мысли растворяются в рутине школьной жизни.
    0x2E27, // А к тому моменту, как я вспоминаю о них, школьный день заканчивается и накопившаяся усталость не оставляет мне иного выбора, кроме как пойти к себе в комнату, сделать уроки и лечь спать.
    0x2F78, // Работой оказывается сортировка и перепроверка внушительного количества бумаг, необходимых для проведения школьного фестиваля.
    0x3065, // Мозг сломаешь со всей этой бюрократией.
    0x30AE, // Но мы успеваем всё закончить как раз к большой перемене.
    0x3115, // Отлично~, теперь можно и немного отдохнуть! Но не очень долго, после полудня нас ждёт ещё больше работы~!
};

#endif // KS_A1_FRIDAY_NO_FREE_LUNCH_RU_TL_INDEX