#ifndef KS_CHOICE_SHIZUNE_LUNCH_RU_TL_INDEX
#define KS_CHOICE_SHIZUNE_LUNCH_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_6BD34F2C_ru_intl[] = {
    0x0000, // Хорошо, я пойду с вами, только отстаньте от меня до конца урока, ладно?
    0x007F, // Договорились, Хиттян~!
    0x00A8, // По дороге в кабинет Совета я вижу суетящихся на школьном дворе учеников, возможно занятых подготовкой своих проектов.
    0x0181, // Фестиваль уже на носу. Это значит, что могут быть только две причины, по которым им может понадобиться моя помощь.
    0x0250, // Либо осталось совсем немного работы и им просто нужна помощь, чтобы закончить стандартные проверки, которые они обязаны провести.
    0x033F, // Либо осталась гора работы и Сидзунэ не показывает вида, в то время как лавина нагромождавшейся отложенной работы угрожает всех нас смести.
};

#endif // KS_CHOICE_SHIZUNE_LUNCH_RU_TL_INDEX