#ifndef KS_A1_SUNDAY_CLOUDS_IN_MY_HEAD_RU_TL_INDEX
#define KS_A1_SUNDAY_CLOUDS_IN_MY_HEAD_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_D116B561_ru_intl[] = {
    0x0000, // Ну, я вступил в кружок рисования, так что, думаю, я пойду с ними.
    0x0072, // Что ты сделал?
    0x008C, // Вступил в кружок рисования.
    0x00BF, // Чувак, это был неверный ход. Совсем неверный. Ты не представляешь, что за девушки в кружке рисования. Грустные, застенчивые милашки, которые вырвут твоё сердце и проглотят его.
    0x01FF, // Я уже знаю одну из кружка рисования и не могу представить, чтобы Рин вдруг стала убийцей-психопатом.
    0x02B6, // Звучит неправдоподобно.
    0x02E3, // Не говори так. Не обманывай себя. Ты и понятия не имеешь, с чем столкнулся, чувак. Такие хуже всех.
    0x0393, // Они тебя втянут своими выкрутасами, а потом, когда меньше всего ждёшь, – БАМ!
    0x041F, // Что – «бам»?
    0x0436, // Мой скептицизм немного сбивает Кендзи с толку, но он выглядит всё таким же безумным.
    0x04D0, // Это неважно.
    0x04E7, // Будь осторожен, чувак, будь осторожен.
    0x052D, // Когда я заставляю себя выйти за парадную дверь, снаружи меня встречает радостный гомон толпы.
    0x05D9, // Территория школы за один день и одно утро превратилась в площадку для праздника.
    0x066D, // Красочные плакаты выстроились вдоль главной дорожки от основного входа к зданию школы.
    0x070E, // Кто-то ещё перетаскивает снаряжение, но за большей частью прилавков уже стоят ученики, расслабленные и готовые к бою.
    0x07E5, // Большинству сегодня пришлось встать пораньше, чтобы закончить приготовления.
    0x0875, // Чувство вины набрасывается на меня, но скоро уходит прочь.
    0x08E0, // Я, в конце концов, перевёлся совсем недавно.
    0x0930, // Посетители уже прогуливаются между рядами.
    0x0980, // Я вижу несколько молодых семей, в которых озабоченные родители стараются утихомирить своих веселящихся чад…
    0x0A4A, // …некоторое количество наших учеников в сопровождении родителей…
    0x0AC5, // …и множество старого и малого люда, чью причину появления здесь я не могу даже представить.
    0x0B6D, // Из системы школьного вещания доносится звон колоколов, и директор объявляет скрипучим голосом об открытии праздника.
    0x0C46, // Все вежливо аплодируют, пусть и без особого энтузиазма.
    0x0CAC, // Школьный фестиваль… В моей прежней школе они не проводились. Мне это кажется чем-то старомодным, особенно учитывая то, из какой школы я перевёлся, но всё же немного захватывающим.
    0x0DF4, // Выходной день кажется слаще после первой недели тяжёлой работы, хоть я и пролежал до того четыре месяца на больничной койке.
    0x0ED8, // Помнится, во время своего заточения в больнице я мечтал оказаться пусть даже на уроке математики, лишь бы не на койке.
    0x0FAF, // Не могу вспомнить программу фестиваля, несмотря на то что Муто как-то рассказывал о ней на уроке.
    0x1060, // Я начинаю спускаться по ступенькам общежития, собираясь обойти весь праздник и попробовать всё, что он может мне предложить, но добираюсь лишь до основания лестницы.
    0x1190, // Несколько человек изучают фреску Рин, а сама художница стоит, прислонившись к стене в нескольких шагах от неё, выглядя при этом так, будто тихо-мирно умирает со скуки.
    0x12C0, // Доброе утро.
    0x12D7, // Привет.
    0x12E5, // Как идут дела?
    0x12FF, // Никак не идут.
    0x1319, // Я застряла.
    0x132E, // В смысле «застряла»?
    0x1354, // Это значит, что я не могу ходить. Думаю, мои ноги после вчерашнего вышли из строя.
    0x13E7, // Больно?
    0x13F5, // Сложно сказать. Наверное.
    0x1424, // Нагрузка во время работы над фреской была больше, чем она давала понять. Я думаю, она просто слегка перегрузила мышцы или что-то вроде того. Я хочу расспросить её подробней, но Рин плавно меняет тему.
    0x158E, // Друзья учителя заходили.
    0x15BC, // Потом они собрались в город на обед и пригласили меня. Хорошо, что мои ноги настолько устали.
    0x1665, // Но ты осталась сидеть тут? Это плохо.
    0x16A8, // Я просто жду, пока снова смогу ходить. Это должно рано или поздно произойти.
    0x1732, // Учитель был рад, что я закончила фреску.
    0x177B, // А как иначе?
    0x1791, // Но я не знаю, на самом ли деле она закончена.
    0x17E1, // Вот как?
    0x17F0, // Вчера я думала, что сделала всё, но сейчас уже не уверена. Мне надо было нарисовать больше деталей. Может быть. Наверное. Очень трудно сказать наверняка.
    0x1905, // Законченная или нет, в ярком дневном свете фреска выглядит великолепно.
    0x1989, // Основной её элемент – разные части человеческого тела, в большинстве своём искажённые, снова и снова повторяющиеся в причудливых вариациях.
    0x1A8C, // Они кажутся грубыми, будто их бессмысленно разбросали и коряво покрасили, но в каждую деталь вложено много мысли и труда.
    0x1B6A, // А у этого из головы растёт лягушка?
    0x1BAA, // Это золотая рыбка.
    0x1BCC, // А что это?
    0x1BDE, // Ничего.
    0x1BEC, // Ну и ладно…
    0x1C02, // Стена настолько широка, что мне приходится крутить шеей влево-вправо, чтобы разглядеть всю картину.
    0x1CB9, // Это сложно оценить как единую композицию. Кажется, что части не подходят друг к другу, но я полагаю, что они всё же объединяются в целое.
    0x1DB0, // Пусть я понятия не имею, что изображает эта абстракция, но выглядит она красиво. И мне этого достаточно.
    0x1E6D, // Я устраиваюсь рядом с Рин, прислонившись к стене так же, как и она.
    0x1EE5, // Весёлые звуки фестиваля становятся громче по мере прибытия всё новых и новых горожан.
    0x1F83, // Общежития находятся далеко от основных аттракционов в главном здании и киосков, расположившихся в школьном дворе, так что большинство посетителей сюда ещё не добралось.
    0x20BB, // На лице Рин появляется какое-то утомлённо-скучающее выражение, из-за чего она кажется отстранённой от всего, что происходит вокруг.
    0x21AC, // Она удивительно немногословна. Может, виной тому сильная боль?
    0x221F, // Ну так что люди искусства сказали о твоей фреске?
    0x2279, // Мой вопрос пробуждает Рин ото сна. Она лениво поворачивается ко мне.
    0x22F6, // Я не уверена.
    0x230E, // Я думаю, она им понравилась? Наверное, так и есть.
    0x2367, // А ты сама? Ты довольна фреской? Раз я в некотором роде поучаствовал, то было бы ужасно, если бы ты осталась недовольна.
    0x243D, // Рин качает головой, прикусив нижнюю губу.
    0x2489, // Думаю, получилось сносно. Не плохо, но и не хорошо. Просто… получилось. У меня в голове нет никаких мыслей по этому поводу, ну и пусть.
    0x257B, // Можно ещё спросить? Что на самом деле изображено на картине? Я думал об этом вчера, когда ты сказала, что ничего.
    0x2646, // Но это же логическая ошибка, ведь так? Нельзя создать что-то из ничего, даже в искусстве.
    0x26E6, // Рин хмурится и, повернув голову, глядит на облака.
    0x2741, // Я не знаю. У меня не очень-то получаются объяснения. Это просто фреска, в ней нет ничего особенного. Я говорила.
    0x280A, // Мои расспросы её, похоже, раздражают.
    0x284E, // Я не знала, что я буду рисовать, поэтому решила нарисовать просто фреску.
    0x28D3, // На этой фреске изображена фреска.
    0x2911, // Нет, постой. Я сейчас подумала, что лучше сказать так: «Она изображает саму себя».
    0x29A5, // Значит… её фресочность на максимуме, настолько, насколько у меня получилось; так что если ты думаешь, что в ней есть некий смысл, то он примерно вот такой.
    0x2ABE, // Это бессмыслица.
    0x2ADD, // Значение… Я чувствую, как уголки моего рта поднимаются вверх, складываясь в улыбку с лёгкой тенью озабоченности.
    0x2BAD, // Я никогда не понимал живопись в полном смысле слова.
    0x2C0D, // Мне знакомы основы – она является средством для обмена идеями и мыслями.
    0x2C93, // Однако я не учился тому, как надо воспринимать предметы живописи, как прочувствовать то, что художник намеревался выразить посредством неё.
    0x2D94, // Я знаю, что тут не нужно никакого специального умения, но мой мозг почему-то не может связать картину с чем-то иным, кроме воспринимаемого моими глазами. Всё, что я вижу, – лишь фреска.
    0x2EE1, // Я могу восхититься мастерством рисунка, в конце концов даже я знаю разницу между плохой живописью и средней, между средней и хорошей.
    0x2FD5, // Но я не способен ни на что большее, так что не спрашивай меня о её значении, Рин.
    0x3065, // После её ответа у меня пропадает желание расспрашивать её дальше.
    0x30DE, // Так чем займёшься, когда встанешь на ноги?
    0x312B, // Ничем.
    0x3137, // Ничем? Но сейчас же фестиваль, разве тебе не хочется повеселиться?
    0x31B0, // Мне и так хорошо.
    0x31CF, // Ты не очень-то общительна, да?
    0x3205, // Думаю, сейчас я больше убеждаю её, чем себя. Хотя меня и самого фестиваль не особо волнует, мне слегка любопытно поглядеть, на что он похож, только и всего.
    0x331D, // Её ответ меня не удивляет.
    0x334D, // Нет, не общительна.
    0x3370, // Да и я, в общем-то, тоже…
    0x339C, // Если тебе хочется, то иди.
    0x33CB, // Знаю, но я могу составить тебе компанию. Я ещё не привык ко всему этому, так что никуда торопиться не собираюсь.
    0x3495, // Но могу и уйти, если ты хочешь побыть одна.
    0x34E2, // Я была бы рада, если бы ты остался.
    0x3520, // Походив вокруг да около, мы наконец к чему-то приходим. Её ответ вызывает во мне чувство странной радости, поэтому я остаюсь.
    0x3603, // Мне нравится быть рядом с ней. Странная тёплая аура безмятежности, которую она излучает, делает молчание уютным. Я очень это ценю.
    0x36F0, // Мы молча глядим на проходящих мимо людей, пока все остальные весело общаются друг с другом.
    0x3797, // Некоторые ученики ведут семьи к общежитиям, чтобы показать свои комнаты. Они проходят мимо нас и мимо фрески, взглянув, может, разок-другой.
    0x3896, // Я больше думаю не о них, а о своей напарнице, пытаясь пробиться сквозь загадочную, нечитаемую стену её лица.
    0x395A, // Глаза Рин безустанно перебегают от одного проходящего мимо человека к другому.
    0x39EC, // Ждёт ли она, что кто-нибудь остановится перед фреской, надеется ли втайне, что её творчество вызовет отклик?
    0x3AB1, // Я не думаю, что в ней могут признать художницу. В конце концов, мы просто сидим тут, как парочка неприкаянных, а у неё даже нет рук.
    0x3B9C, // Я вообще сомневаюсь, что Рин стала бы напрашиваться на комплименты. Она для этого кажется слишком нелюдимой.
    0x3C63, // Мимо проходит всё больше людей, некоторые тычут пальцем во фреску, обмениваются словами, которые я не могу расслышать. Кто-то роняет себе на ботинок мороженое. Бедолага.
    0x3D98, // Всем, похоже, нравится.
    0x3DC2, // Высказываю я предположение, вбросив тему в разделяющий нас спёртый летний воздух.
    0x3E59, // Рин отвечает не сразу, но я уже почти привык к подобным паузам. Она будто с большой осторожностью подбирает слова, во что, если честно, трудно поверить, учитывая, какая мешанина срывается с её языка.
    0x3FC1, // Я хотела создать её такой, чтобы на неё можно было просто глядеть не думая. А потом я поняла, что в этом нет смысла. Поэтому получилась смесь того и сего.
    0x40D5, // Издалека кажется, будто кого-то стошнило стадом бабочек на стену. Именно то, чего не хотела та несносная президентша. Для этого есть слово?
    0x41D2, // Что за слово?
    0x41EA, // Такое. Каким словом называют скопище бабочек?
    0x423E, // Бабочки?
    0x424E, // Нет, как стадо, или косяк, или куча.
    0x428D, // А. Я не знаю. Может, стая?
    0x42B9, // Может, людям нравится блевотина из бабочек.
    0x4309, // Рин смотрит на фреску с удивительно недовольным выражением лица.
    0x4381, // Середина могла быть куда лучше.
    0x43BB, // Обычно я люблю промежутки, но этот стал просто болью в заднице. Не буквально, конечно… но потом и она началась. Да, всё-таки, похоже, буквально.
    0x44BE, // Не будь к себе чересчур требовательной.
    0x4507, // Она одаряет меня изумлённым взглядом, но закрывает рот.
    0x456D, // Я начинаю задумываться, не стоит ли мне уйти и потратить своё воскресенье на что-нибудь более полезное.
    0x462A, // Это просто апофеоз замкнутости. Целый свободный день, праздник прямо за моей дверью, а что делаю я?
    0x46DE, // Сижу тут с Рин; мы с ней словно два отщепенца, которым нечем заняться, кроме как думать, какая же это жалость – быть лишь наблюдателем.
    0x47D2, // Даже осознав, насколько я жалок, я ничего не предпринимаю. Я не встаю и не иду отрываться в океане веселья.
    0x4893, // *шорх-шорх*
    0x48A7, // …
    0x48AB, // *суетится*
    0x48BE, // *шорх*
    0x48C9, // …
    0x48CD, // Рин беспокойно вертится, постоянно перекладывая одну ногу на колено другой и обратно.
    0x496B, // На лице у неё страшно раздражённое выражение.
    0x49BF, // Что-то не так?
    0x49D8, // Да. Нет. Да.
    0x49EC, // Она внезапно вскакивает на ноги. Удивительно, я думал, она ещё обездвижена, но, выходит, нет.
    0x4A93, // Мне надо пойти и разыскать Эми или кого другого, мне нужна кое-какая помощь.
    0x4B1D, // Я помогу.
    0x4B2E, // Нет, спасибо. Один из нас должен остаться здесь на всякий случай.
    0x4BA4, // Не глупи. С тех пор как я сюда пришёл, не случилось абсолютно ничего интересного, не считая парня, который уронил мороженое на ботинок. Давай я тебе помогу, мне скучно.
    0x4CD3, // Так в чём дело?
    0x4CEE, // Губы Рин плотно сжимаются, превращаясь в одну почти идеально горизонтальную линию.
    0x4D87, // Она закрывает глаза и глубоко вздыхает.
    0x4DD0, // Когда она раскрывает веки, в её тёмных глазах читается пугающе суровое выражение, от которого мне делается не по себе.
    0x4EA8, // Хисао, хочешь ты это услышать или нет, я не знаю, но в любом случае ты не оставляешь мне иного выбора.
    0x4F5E, // У меня критические дни, и мне нужна помощь. Однако я не думаю, что наши отношения зашли так далеко, что я могу позволить тебе стянуть с меня нижнее бельё, находясь в женском туалете, даже если ты и предложишь.
    0x50D6, // Вот почему ты должен остаться здесь, а я – пойти искать Эми.
    0x5143, // Кровь приливает к моим щекам, как набегающая волна, пока мозг безуспешно пытается найти ответ, но сейчас я могу думать только о том, что это самая разумная вещь, которую я услышал от Рин за четыре дня знакомства.
    0x52C3, // Ага.
    0x52CB, // Не желая встречаться с Рин глазами, я отворачиваюсь в сторону, притворяясь, что гляжу на чьих-то родителей.
    0x538E, // Уголком глаза я замечаю, как Рин поворачивается на месте и без лишних раздумий отправляется прочь.
    0x5443, // Мне хочется провалиться на месте.
    0x5481, // Интересно, надолго ли ушла Рин… и вернётся ли она вообще?
    0x54EA, // Некоторое время спустя она всё же возвращается, появившись словно из ниоткуда и присев там же, где была, – рядом со мной.
    0x55C6, // Я вернулась.
    0x55DD, // Произносит она ровным голосом, будто я ничего не сморозил. Я тоже предпочитаю обо всём забыть и молчу.
    0x5697, // Время проходит в бездействии, солнечные лучи свысока падают на главное здание. Они бьют мне прямо в глаза, но я только щурюсь, вместо того чтобы подвинуться.
    0x57B5, // Ещё немного, и становится больно даже чуть приоткрыть глаза, а виски начинает ломить.
    0x5851, // У меня голова разболелась. Не день, а головная боль, представляешь?
    0x58CB, // Ты голоден?
    0x58E0, // И как это связано с головной болью?
    0x5920, // Никак. Я спросила, потому что сама проголодалась.
    0x597A, // …
    0x597E, // Её безразличная серьёзность смывает моё раздражение своей нелепостью, и я снова замечаю, как приподнимаются уголки моих губ.
    0x5A64, // Знаешь что? Я тоже.
    0x5A86, // Пойду куплю нам еды. Чего бы тебе хотелось? Я угощаю.
    0x5AE5, // Всё равно.
    0x5AF8, // Вернувшись с едой, я отдаю одну порцию Рин, другую оставляю себе и, не говоря ни слова, мы принимаемся есть.
    0x5BBA, // Рин смотрит вверх со свисающей из уголка рта вилкой.
    0x5C1A, // Что такое облака? Я всегда думала, что это мысли неба или типа того. Потому что их нельзя коснуться.
    0x5CCE, // Ты так думала, когда была ребёнком?
    0x5D0E, // Нет, на прошлой неделе.
    0x5D38, // Может, потому что иногда мои мысли кажутся облаками. Пушистые, белые и неторопливые.
    0x5DD2, // Как будто небо оказалось у меня в голове. Как будто моя голова – небо.
    0x5E51, // Небо твоего разума?
    0x5E75, // Закрой глаза и подумай о небе. Ты не сможешь думать ни о чём другом, пока не остановишься.
    0x5F17, // Я пробую так сделать. Работает. Волшебство?
    0x5F66, // Открыв глаза, я вижу, как Рин изучающе смотрит на меня. Мне от этого неловко, потому что она ничего не говорит. Я отворачиваюсь.
    0x604C, // Облака – это вода. Испарившаяся вода.
    0x6091, // Знаешь, говорят, что почти вся вода в мире часть своего существования проводит в виде облаков.
    0x613D, // Каждая твоя капля слёз, крови или пота когда-нибудь станет облаком. И вся вода в твоём теле тоже отправится наверх после твоей смерти. Хотя это может занять какое-то время.
    0x6275, // Твоё объяснение лучше любого из моих.
    0x62BA, // Потому что это правда.
    0x62E3, // Должно быть.
    0x62FA, // Я возвращаюсь к еде, пока она не остыла.
    0x6342, // Стена начинает отбрасывать на нас вожделенную тень, поскольку солнце продолжает своё путешествие по небесному своду.
    0x641B, // Но день уже плавно переходит в вечер, так что наш обед – скорее ужин. Или какое там слово можно подобрать для такого приёма пищи.
    0x6505, // Но, как его ни назови, он определённо вовремя. Я сто лет уже не ел.
    0x657B, // …
    0x657F, // Утолив голод, я издаю удовлетворённый вздох. Рин съела не всё, но тоже, видимо, закончила с едой.
    0x662D, // Я откидываюсь назад, наслаждаясь атмосферой. Толпа редеет, но звуки веселья пока не стихают. Все, похоже, с удовольствием проводят время.
    0x6727, // А почему бы и нет? Тепло, идеальный летний день, когда солнце греет жарко, но не слишком.
    0x67C6, // Солнце скоро сядет. Время и правда летит быстро.
    0x681E, // Мы сидим здесь уже шесть часов.
    0x6857, // Да, верно.
    0x6869, // Тебе хочется заняться чем-то другим?
    0x68AC, // Нет, не особо.
    0x68C5, // И мне тоже.
    0x68D9, // Она меняет позу и прислоняется к стене, и я следую её примеру, давая расслабиться телу.
    0x6977, // Мы сидим ещё несколько минут не говоря ни слова.
    0x69CF, // Я пытаюсь понять настроение Рин по её внешнему виду, по напряжению мышц лица, по слабым намёкам на какое-либо выражение, проплывающим по её лицу. Всё без толку. Она непроницаема, как всегда.
    0x6B27, // Толпа накатывает то туда, то сюда, люди счастливо болтают друг с другом. Очень мало кто всерьёз уделяет внимание фреске, и ещё меньше людей – нам.
    0x6C30, // Я рассеянно кручу в руках пару камешков.
    0x6C7A, // Делать что-то просто ради того, чтобы что-то делать, – самая суть безделья.
    0x6D02, // По миллиметру солнце клонится всё ниже к веткам деревьев, меняя цвет неба при приближении к горизонту с жёлто-золотого до оранжевого, а потом до красного, говоря нам, что закат уже рядом.
    0x6E56, // После такой плотной трапезы желудок будто полон свинца, но кирпичная стена кажется удивительно приятной подушкой для спины.
    0x6F3B, // Я пытаюсь бороться с напавшей на меня дремотой, но безуспешно.
    0x6FAD, // Вздрогнув, я просыпаюсь.
    0x6FDA, // Низкий грохот сотрясает школьную территорию. В моих глазах пляшут, как звёзды, шлейфы ярких искорок.
    0x7092, // Что-то взмывает к небесам со стороны стадиона.
    0x70E7, // За ним тянется огненный хвост, а затем следует вспышка, освещающая небо высоко над школой красными и жёлтыми огнями с ещё одним громким хлопком.
    0x71EF, // Фейерверки.
    0x7205, // Внезапная вспышка света на холсте ночного неба разбудила меня, заставив осознать, что уже давно стемнело.
    0x72C7, // Долго я спал? Я едва могу пошевелиться и не чувствую правую руку.
    0x733D, // Пытаясь её согнуть, я понимаю почему.
    0x7381, // Рин всем весом облокотилась на моё плечо, почти что упав мне на колени.
    0x7402, // Она крепко спит, и даже фейерверки не тревожат её сон.
    0x7464, // Рот слегка приоткрыт, а глаза мирно сомкнуты. Невинное лицо спящего ребёнка.
    0x74F0, // Я осторожно трясу Рин свободной рукой, стараясь её разбудить или, если не удастся, подвинуть так, чтобы высвободить вторую руку.
    0x75DA, // Лицо Рин дёргается, и её веки сжимаются плотнее, как будто сопротивляясь пробуждению.
    0x7677, // Она постепенно открывает глаза, но оставляет их полуприкрытыми. Свет фейерверков проникает сквозь её ресницы, отражаясь яркими вспышками в зелёной радужке; затем она поднимает взгляд на меня и хмурит брови.
    0x77F3, // Ещё немного, ладно?
    0x7816, // Голос Рин сонный и неторопливый, её почти неразборчивое бормотание лениво повисает в воздухе.
    0x78C3, // Похоже, она не вполне осознаёт ситуацию.
    0x790D, // Рин снова роняет голову мне на плечо, наваливаясь на меня всем своим весом.
    0x7996, // Она ворочается под боком, устраиваясь поудобней и одновременно лишая меня всякого удобства.
    0x7A40, // Я отчётливо чувствую тепло Рин и то, как вздымается и опадает грудь девушки, касающаяся моей руки; вскоре её дыхание возвращается к размеренному ритму.
    0x7B55, // Не могу не позавидовать её способности засыпать несмотря ни на что, а также её непосредственности, позволяющей использовать как подушку того, кого знаешь меньше недели.
    0x7C8B, // Ракеты по одной взмывают в небо, распускаясь красными, зелёными и золотыми цветами, – и всё это сопровождается охами и ахами зрителей.
    0x7D81, // Я пытаюсь выкинуть сбивающую с мыслей близость Рин из головы, ибо что я могу поделать? Я только надеюсь, что её «ещё немного» не слишком затянется.
    0x7E8C, // Один за другим блистающие всполохи рождаются и умирают за краткий миг, раскрашивая тёмное ночное небо и превращая его в постоянно изменяющуюся абстрактную картину.
    0x7FBB, // Я слушаю низкое буханье взрывов и тихое дыхание Рин, понемногу прочищая голову от сонного дурмана.
    0x8070, // К счастью, Рин просыпается до окончания фейерверков.
    0x80D1, // Я заснула.
    0x80E4, // Наконец она полностью открывает глаза и несколько раз моргает.
    0x8158, // Ты заснула на мне. Дважды.
    0x8187, // Тебе не понравилось?
    0x81AD, // Э-э… Ну-у…
    0x81C1, // Не обращая внимания на мою запинку, Рин выпрямляется, отстраняясь от меня.
    0x8249, // Ты тяжёлая.
    0x825E, // Это неправда – она весит всего ничего, – но мне надо хоть чем-то её попрекнуть, пусть даже это удар ниже пояса. Моя насмешка не оказывает на Рин никакого воздействия, поскольку её внимание устремлено вверх, к вспышкам фейерверков.
    0x8402, // Она кажется загипнотизированной игрой их красок.
    0x845D, // Лёгкое колющее ощущение пробегает по моей руке, когда кровь вновь начинает течь по венам. Оно неприятное, но позволяет мне избавиться от головокружения.
    0x8575, // Всё больше и больше ракет взмывает к небу, яркие цвета разрывов отражаются на облаках.
    0x8613, // Мы оба не отрываясь глядим на фейерверк сквозь полог деревьев, зачарованные представлением.
    0x86BD, // У нас мог бы быть куда лучший вид на небо, сдвинься мы всего на несколько метров, но никто даже и не думает внести такое предложение.
    0x87AD, // Я очень люблю фейерверки, пусть мне от них и становится как-то грустно. Как будто им очень хочется, чтобы ты взглянул на них, какие они громкие и яркие, но только поглядишь – а их уже нет.
    0x88FE, // Как будто они даже не реальны.
    0x8935, // …
    0x8939, // Они настоящие, точно тебе говорю.
    0x8976, // Всё это… настоящее, понимаешь?
    0x89AF, // Если задуматься, то ничто на самом деле не длится долго. Даже что-то вроде моей жизни или твоей – это лишь миг в истории мира, как одна из тех ракет. Хлоп – и нас нет.
    0x8AD9, // Но мы живём, не так ли?
    0x8B01, // Да, это реальность. Рин, сидящая рядом со мной, громкие взрывы фейерверков, широкое, бескрайнее небо. Эти вещи определённо настоящие, даже если они не останутся надолго.
    0x8C34, // Я чувствую тепло в груди и гадаю, вызвано ли оно близостью Рин или же я просто рад быть живым.
    0x8CDD, // Не представляю, что на это ответить.
    0x8D1F, // Да ничего… наверное, я просто разговариваю сам с собой.
    0x8D85, // Знаешь, фейерверки прекрасны… Но в конечном счёте разве не глупо тратить столько денег на горстку искорок, рассыпающихся в долю секунды?
    0x8E81, // Рин отрывает взор от всё ещё продолжающегося представления и отстраняется, глядя на меня с неприязненным выражением.
    0x8F59, // Ух ты, никогда бы не подумала, что ты такой циник.
    0x8FB2, // Циник – довольно грубое слово. Предпочитаю называть себя реалистом.
    0x9030, // А разве «реалист» – не то слово, которым циники обычно себя называют?
    0x90AF, // Последняя ракета взрывается серебряными и голубыми искрами, на мгновение накрывая школу зловещей тишиной, а затем толпа начинает двигаться к главному выходу, напоминая стадо.
    0x91F2, // Клочки серого дыма плывут к общежитию со стадиона. Резкий серный запах пороха, который они несут с собой, кажется пропитывает мою одежду и волосы.
    0x92FD, // Что, всё?
    0x930D, // Вроде бы да.
    0x9323, // Я встаю и потягиваю пострадавшую спину. Спать, прислонившись к кирпичной стене, всё же не лучшая идея.
    0x93DD, // Рин тоже встаёт и поворачивается ко мне. Она явно устала, её глаза выжидательно смотрят на меня.
    0x948C, // Несмотря на то что ей обычно с трудом удаётся сосредоточить взгляд, сейчас она глядит прямо на меня – такое за прошедшую неделю случалось нечасто.
    0x9599, // Так… значит…
    0x95B3, // Я вдруг понимаю, что это было почти что свидание, пусть и спонтанное. Пусть даже мы ничего и не делали.
    0x966C, // Но это было и не совсем свидание… но почему же у меня тогда краснеют щёки и я запинаюсь?
    0x970C, // Не знаю, что мне сказать Рин, явно ожидающей моих слов, но, к счастью, она решает этот вопрос за меня.
    0x97C1, // Спокойной ночи, Хисао.
    0x97EA, // Она одаряет меня продолжительным взглядом, оглядывая с головы до пяток, затем разворачивается на месте и удаляется, растворяясь в толпе.
    0x98E5, // …
    0x98E9, // Да… Доброй ночи.
    0x9908, // Я остаюсь в одиночестве, давая ответ прохладному ночному воздуху.
    0x9981, // Эх.
    0x9987, // Ничего подобного я от фестиваля не ожидал.
    0x99D5, // Мы с Рин провели целый день на одном месте, хоть никто из нас и не предлагал что-либо сделать.
    0x9A7E, // У меня просто не нашлось занятия получше, и, очевидно, у неё тоже.
    0x9AF4, // Тепло тела Рин ещё ненадолго задерживается в моём теле, прежде чем раствориться в наступающей ночи.
};

#endif // KS_A1_SUNDAY_CLOUDS_IN_MY_HEAD_RU_TL_INDEX