#ifndef KS_A1C8O1_RU_TL_INDEX
#define KS_A1C8O1_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1EB00_ru_intl[] = {
    0x0000, // Зачем вы и меня втягиваете? Думаю, я сделал более чем достаточно.
    0x0076, // Если вы злитесь на Лилли, ко мне это никакого отношения не имеет.
    0x00EC, // Подожди-ка… ты намекаешь, что президент имеет право ругать меня, но не тебя?
    0x0177, // Вот чёрт, надо было аккуратнее подбирать слова.
    0x01CE, // Я не знаю, но… В смысле…
    0x01FB, // …
    0x01FF, // Что ты хочешь сказать, Хиттян?
    0x0236, // Просто я думаю, что вряд ли честно так говорить, учитывая, что вы сами видели, как я вам помогал.
    0x02E3, // Атмосфера меняется. Теперь это похоже на дуэль. Ну, и раньше было похоже, только теперь Сидзунэ сосредоточилась на мне.
    0x03BC, // И Лилли тоже, хоть она и не подаёт виду. Боюсь, я нечаянно её рассердил.
    0x043C, // …
    0x0440, // Хочешь сказать, я не права?
    0x0471, // Опасная ситуация.
    0x0492, // Ещё слишком рано, чтобы с тобой спорить. …Да, я думаю, что несправедливо с твоей стороны на меня наезжать.
    0x0552, // …
    0x0556, // Хиттян, ты слишком многого хочешь~! Но~! Ты дело говоришь. Ладно, ладно, ладно~! Ты не лентяй, Хиттян.
    0x0608, // Ха-ха-ха~!
    0x0619, // Сидзунэ большим пальцем поправляет очки, словно выказывая одобрение.
    0x0699, // …
    0x069D, // Это хорошо! Если ты не бесполезен, нельзя кому-либо позволять говорить о себе такое~! Но в следующий раз, когда я скажу это, это будет значить, что ты действительно меня расстроил, как вот госпожа Староста, так что не вздумай расслабляться!
    0x084E, // Лилли молча сносит эту колкость, на её лице застывает ухмылка.
    0x08C0, // Староста~! Ситтян говорит: «Не забудь, пожалуйста, отчёт~!»
    0x092A, // Не забуду.
    0x093D, // Это всё?
    0x094C, // Угу~!
    0x0955, // Тогда приятного всем дня.
    0x0984, // Если бы её голос имел форму, он бы рассёк воздух, как меч.
    0x09EB, // Лилли покидает комнату, ясное дело в плохом настроении, но всё же сумев остаться уравновешенной и спокойной, как обычно.
    0x0AC7, // Сидзунэ, ты правда сегодня зашла малость далековато.
    0x0B28, // Правда, Ситтян, самую малость~.
    0x0B60, // Если бы я ожидал, что и здесь Сидзунэ с неохотой признает мою правоту, значит ожидал бы слишком многого. Она молчит.
    0x0C32, // …
    0x0C36, // Ха-ха-ха~! Ситтян думает, что тебе лучше не совать нос.
    0x0C97, // Хиттян, у нас есть пара неотложных дел перед уроками~! Мы, может быть, опоздаем, так что~! Прикроешь нас?
    0x0D51, // Ага.
    0x0D59, // Потрясно~! Ура~! Отлично~! Спасибо, Хиттян!
    0x0DA4, // Они уходят, несмотря на то что до начала урока остаётся всего десять минут.
};

#endif // KS_A1C8O1_RU_TL_INDEX