#ifndef KS_A1C2O1_RU_TL_INDEX
#define KS_A1C2O1_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1D47A_ru_intl[] = {
    0x0000, // Ах да. В этой школе есть библиотека? В последнее время я увлёкся чтением, так что хотел бы туда сходить.
    0x00BB, // Миша одаряет меня хмурым взглядом, дающим понять, что она не считает чтение здоровой привычкой, но затем улыбка снова возвращается к ней.
    0x01B6, // Есть~! На втором этаже, мы потом тебе покажем!
    0x0208, // Спасибо.
    0x0218, // Я возвращаюсь к еде, а девочки тем временем общаются между собой.
};

#endif // KS_A1C2O1_RU_TL_INDEX