#ifndef KS_A1_WEDNESDAY_SHORT_SHARP_SHOCK_RU_TL_INDEX
#define KS_A1_WEDNESDAY_SHORT_SHARP_SHOCK_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_484419CB_ru_intl[] = {
    0x0000, // Сразу за углом коридора удар в грудь с силой несущегося на полной скорости поезда чуть не сбивает меня с ног.
    0x00C7, // Чья-то рука ложится мне на плечо; в тот же момент глаза девочки округляются от ужаса, а её реплика прерывается испуганным—{w=.9}{nw}
    0x01B1, // И-и!
    0x01B8, // Не успеваю я обернуться, как Сидзунэ отталкивает меня в сторону и нависает над девочкой, яростно жестикулируя.
    0x0283, // Мисс Ибарадзаки, я всё видела. Бегать по коридорам строго запрещено.
    0x0300, // Миша переводит стоя позади Сидзунэ, но её голос по-девчачьи игрив и совсем не выражает священного гнева, читающегося в жестах Сидзунэ.
    0x03F6, // Э… извините, мне просто надо было забрать кое-что и я немного торопилась…
    0x047E, // …
    0x0482, // Вам уже говорили об этом тысячу раз. Ваше неосмотрительное поведение подвергает опасности других учеников и, что ещё хуже, прямо противоречит школьным правилам.
    0x05AA, // Девочка краснеет от стыда и начинает мяться на месте, как ребёнок, которого отчитывают за плохое поведение.
    0x066F, // Это выглядит так мило, что я не могу сдержать улыбку.
    0x06CF, // Я знаю! Я-я… эм… я просто…
    0x0700, // …
    0x0704, // Вы уж постарайтесь, чтобы подобное не повторилось… Хотя я уверена, что вы презираете правила и делать вам замечания – совершенно бессмысленная трата моих нервов.
    0x082F, // Поняла, Эми?
    0x0845, // В ответ маленькая девочка показывает язык.
    0x0894, // А-а-а!
    0x089E, // Мне надо спешить!
    0x08BE, // Учитель мне голову оторвёт! Я обещала помочь с распечатками, а вместо этого пошла бегать! Извините, но мне надо переодеться и всё такое!
    0x09B5, // Прежде чем Миша, Сидзунэ или я успеваем что-либо сказать, она срывается с места и в одно мгновение оказывается на полпути к лестнице.
    0x0AA7, // Сидзунэ выглядит так, будто готова взорваться от злости; я улыбаюсь в тщетной попытке успокоить её.
    0x0B5D, // …
    0x0B61, // Ты в порядке, Хиттян? От этой Ибарадзаки вечно одни неприятности.
    0x0BD8, // Знаешь, я твёрдо уверен, что Сидзунэ не назвала бы меня «Хиттян».
    0x0C4E, // Да ладно тебе!
    0x0C68, // …
    0x0C6C, // Ну, в общем, я в порядке. Меня просто слегка ушибли.
    0x0CC8, // …
    0x0CCC, // Это здорово, Хиттян!
    0x0CF1, // Я бы не сказал, что это «здорово», но на этот раз воздерживаюсь от комментариев.
    0x0D82, // …
    0x0D86, // Ну что, давай скорей, Хиттян~! На ланч!
    0x0DCA, // Обещаем, будет здорово!
    0x0DF5, // Ловлю тебя на слове. Что это за место?
    0x0E39, // Что-то вроде ресторана?
    0x0E64, // …
    0x0E68, // Это чайный дом, Хиттян~!
    0x0E93, // Чайный дом… может оказаться дороговато.
    0x0EDE, // …
    0x0EE2, // Почему ты смотришь в свой бумажник, Хиттян? Ничего страшного, если у тебя нет денег, мы за тебя заплатим~!
    0x0FA0, // Очень мило с вашей стороны. Спасибо.
    0x0FE2, // Всё в порядке, Хиттян! Мы же всё-таки друзья, да, Хиттян?
    0x1046, // Мы знакомы всего три дня. Неужели мы так быстро сумели сдружиться?
    0x10BF, // Хе-хе. Но мне приятно это слышать.
    0x10FC, // …
    0x1100, // А, но это только на сегодня и только если ты согласишься прямо сейчас! Ты точно хочешь пойти, Хиттян?
    0x11B6, // Я начинаю задумываться, не ловушка ли это. Этот поход предложила мне Миша или Сидзунэ? Это важно. Меня несколько тревожат возможные мотивы девочки, чья любимая забава – игра в мировое господство.
    0x131B, // …Нет, наверное я просто поддался паранойе. В конце концов, я не имею ничего против их компании. Иногда необходимо выбираться в город, так почему бы и не вместе с ними?
    0x1449, // Я никогда раньше не был в чайном доме, только видел их по телевизору в исторических фильмах. Возможно, сейчас это всего лишь обычные кафе, в которых от тех «чайных домов» осталось одно название.
    0x15AA, // Моё любопытство – лишь ещё одна причина, по которой я хочу пойти с ними.
    0x162D, // Конечно.
    0x163D, // Это здорово, Хиттян~! Здорово, здорово! Ура~!
    0x168C, // Миша несколько раз радостно подпрыгивает на месте, в очередной раз привлекая своим поведением посторонние взгляды. Сидзунэ лаконично, едва слышно аплодирует, прежде чем выражение её лица снова становится невозмутимым.
    0x181F, // Тебе не помешало бы быть немного радостней, Сидзунэ.
    0x187F, // …
    0x1883, // О-о! А я не знала, что Хиттян у нас король. Ха-ха-ха-ха~!
    0x18E3, // Сидзунэ поправляет очки, пока Миша переводит её слова, причём без единой нотки сарказма. Полагаю, если бы она смогла передать интонацию Сидзунэ, эта насмешка могла бы меня задеть. В такие моменты я рад, что между нами существует подобный барьер.
    0x1AA1, // Я и не прошу тебя прыгать от радости из-за того, что решил к вам присоединиться. Я не столь высокомерен.
    0x1B5C, // Думаю, Сидзунэ и так это понимает. Под её предводительством мы втроём направляемся в город.
    0x1C03, // …
    0x1C07, // А теперь нам пора бежать: в Школьном совете важное собрание по поводу фестиваля. И мы наконец решили, где будем есть~!
    0x1CDC, // …
    0x1CE0, // Жаль, но тебе нельзя с нами: это бизнес-ланч только для членов Совета.
    0x1D5E, // Мы обязательно позовём тебя в другой раз! О, но это было бы слишком похоже на свидание, не правда ли?
    0x1E13, // Ва-ха-ха!~
    0x1E24, // Девочки спускаются вниз по лестнице.
    0x1E68, // Не успеваю я сделать и пары шагов по коридору, как меня буквально захлёстывает волна шума и суеты перемены. Мне тоже пора идти.
    0x1F4F, // Больше за весь учебный день не происходит ничего интересного.
    0x1FC1, // Я успеваю прочесть большую часть книги, начатой вчера, и перекусить в столовой, с трудом что-то выбрав из совершенно непривлекательного меню.
    0x20C4, // Уроки ужасно скучны.
};

#endif // KS_A1_WEDNESDAY_SHORT_SHARP_SHOCK_RU_TL_INDEX