#ifndef KS_A1_FRIDAY_EXERCISE_RU_TL_INDEX
#define KS_A1_FRIDAY_EXERCISE_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_586AD362_ru_intl[] = {
    0x0000, // Мой будильник выключается, и я ещё немного праздно валяюсь в кровати, пока вдруг не вспоминаю, что решил дать утренним пробежкам второй шанс.
    0x0102, // Не уверен, что это лучшая из моих идей, но я полон решимости продолжать.
    0x0184, // Речь идёт о моём здоровье, в конце концов.
    0x01D0, // Конечно, в последнее время мне пришлось несладко, но существование не стало от этого настолько невыносимым, чтобы не попытаться сделать всё от меня зависящее, чтобы оставаться в хорошей форме.
    0x0331, // Кроме того, так я докажу, что обладаю каким-никаким самоконтролем, верно?
    0x03B6, // Ведь если я смогу это, то… смогу всё что угодно.
    0x040D, // По крайней мере, я себя в этом постоянно убеждаю.
    0x0466, // Снова оказывается, что я не один на беговой дорожке.
    0x04C5, // Эми, видимо, находится здесь уже какое-то время.
    0x051C, // Похоже, она уже изрядно выложилась.
    0x055D, // Во сколько же она, чёрт возьми, сюда приходит?
    0x05B0, // О, это ты!
    0x05C1, // Не ожидала тебя снова тут увидеть!
    0x0600, // Это почему же?
    0x061A, // Ну, немногие способны вернуться ради второй попытки.
    0x067B, // Она хмурится, по-видимому раздражённая мимолётной мыслью.
    0x06E6, // Как все остальные в команде по бегу, например.
    0x073A, // Но всё это было на добровольной основе, так что ничего удивительного.
    0x07B9, // И время, думаю, слишком раннее…
    0x07F3, // Она пожимает плечами и вдруг будто забывает, о чём только что говорила.
    0x0875, // Хмурый взгляд исчезает без следа, и она возвращается к предыдущей цепочке мыслей.
    0x090B, // Итак! Давай начнём!
    0x092E, // Что?
    0x0936, // Ты ведь пришёл, чтобы снова бегать, так?
    0x097E, // Ну, да.
    0x098A, // Так давай!
    0x099D, // И вот меня хватают и волокут на беговую дорожку.
    0x09F5, // Пробежка проходит по вчерашнему сценарию.
    0x0A43, // Я изо всех сил стараюсь бежать правильно, а Эми двигается с лёгкостью, которой можно только позавидовать.
    0x0B04, // Меня невероятно раздражает то, что я так быстро выдыхаюсь.
    0x0B6F, // Знаю, надо быть терпеливым, двигаться к цели постепенно, но…
    0x0BDE, // Сложно сохранять позитивный настрой.
    0x0C23, // Мы заканчиваем первый круг и выходим на второй.
    0x0C7A, // Эми, кажется, надоело под меня подстраиваться, и она начинает отрываться.
    0x0D00, // Вот на этом месте я вчера и сдался.
    0x0D3F, // Поднажать.
    0x0D53, // Не переусердствовать.
};

#endif // KS_A1_FRIDAY_EXERCISE_RU_TL_INDEX