#ifndef KS_A1C6O2_RU_TL_INDEX
#define KS_A1C6O2_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1E37F_ru_intl[] = {
    0x0000, // Я всё ещё чувствую себя виноватым за то, что спугнул её вчера, так что, думаю, будет лучше сказать ей что-нибудь.
    0x00CA, // Эм, привет, Ханако.
    0x00EC, // Хи… Хисао?
    0x0100, // Что ж, по крайней мере, она помнит моё имя.
    0x014C, // Это… Я просто хотел извиниться за вчерашнее.
    0x019F, // Я не хотел тебя напугать, ничего такого.
    0x01E8, // Просто я здесь новенький и думал, что надо бы познакомиться с одноклассниками.
    0x0278, // Ханако поднимает на меня взгляд, и я ещё раз замечаю её шрамы.
    0x02E8, // Немного сбивает с толку то, что издалека они почти не заметны, а вблизи прямо-таки бросаются в глаза.
    0x039F, // В… Всё в порядке.
    0x03BF, // Это… Это я виновата.
    0x03E5, // Да нет, никто не виноват, просто так уж вышло.
    0x0437, // Ты кого-то ждёшь? Я заметил, как ты смотрела на дверь…
    0x0499, // Д-да… Лилли.
    0x04B0, // А, ты имеешь в виду Лилли, слепую девушку?
    0x04FB, // Ханако слегка кивает в ответ, а я задаюсь вопросом, не является ли грубостью различать людей по типу их инвалидности или же здесь это считается нормальным?
    0x0617, // Теперь понятно, почему Лилли вчера отправилась за ней.
    0x067B, // Мне она показалась приятной девушкой. Вы с ней подруги?
    0x06E0, // Д-да.
    0x06E9, // Она вновь глядит через плечо, будто в надежде увидеть Лилли.
    0x0757, // Кажется, она опять начинает из-за меня нервничать.
    0x07B3, // Прости, если я снова тебя побеспокоил…
    0x07FB, // Н-не в этом дело.
    0x0819, // Просто лучше бы Лилли сюда не приходить…
    0x0865, // А, потому что ей трудно найти класс?
    0x08A6, // Нет… не совсем.
    0x08C3, // Ханако переводит взгляд в сторону Сидзунэ.
    0x0912, // Сидзунэ?
    0x0922, // Она молча кивает.
    0x0942, // При чём тут она? Они с Лилли не ладят?
    0x0985, // Ханако качает головой. Очевидно, она не очень хочет рассказывать об этом.
    0x0A0B, // То, что Лилли не ладит с Сидзунэ, кажется в некотором роде естественным.
    0x0A8E, // Общение между ними не представляется возможным. С Сидзунэ и так трудно разговаривать через Мишу, даже если видишь, кто из них жестикулирует.
    0x0B8F, // Ханако так сосредоточена на Сидзунэ, что я первым замечаю Лилли в дверях.
    0x0C15, // О, она тут.
    0x0C28, // Ханако разворачивается и, увидев Лилли, бежит к двери.
    0x0C8B, // Лилли…
    0x0C99, // О, Ханако. Доброе утро. Президент здесь?
    0x0CE1, // Д-да.
    0x0CEA, // Ханако опять бросает через плечо взгляд на Сидзунэ, словно пытаясь удостовериться, что та их не слышит, хотя это невозможно в принципе.
    0x0DE1, // Тогда, пожалуй, нам лучше уйти.
    0x0E19, // Лилли вздыхает, и в её тяжёлом вздохе слышатся нотки отчаяния. Похоже, между ними действительно есть острая неприязнь.
    0x0EF2, // Мне любопытно, но я не решаюсь спросить об этом. Они сами рассказали бы, если б захотели.
    0x0F92, // Я здесь всего третий день; мне следует заводить друзей, а не пытаться выяснять причины чьей-либо вражды.
    0x1050, // В любом случае забавно узнать, что даже тут случаются распри, как и в моей прежней школе.
    0x10F1, // Хоть люди здесь терпимее к другим, они всё равно умудряются досаждать друг другу.
    0x1186, // Привет, Лилли. Как ты? Извини, что вчера тебе пришлось так спешно из-за меня уйти…
    0x121A, // Боже мой, это Хисао? Я не знала, что ты здесь…
    0x126C, // Лилли, кажется, немного смущена, что так разоткровенничалась в моём присутствии.
    0x1300, // И-извини, Лилли. Я думала, ты поняла…
    0x1343, // Нет-нет, всё в порядке, Ханако.
    0x137A, // Хисао, пожалуйста, не беспокойся о вчерашнем. Это было простое недоразумение.
    0x1408, // Ну… как скажешь. Я всё ещё не до конца освоился здесь.
    0x146A, // Думаю, скоро ты поймёшь, что люди в этой школе снисходительнее, чем где-либо ещё.
    0x14FC, // Если ты озадачен чем-то, то, пожалуйста, не стесняйся спрашивать.
    0x1572, // Хорошо, буду знать.
    0x1595, // Эм… Лилли…
    0x15AB, // Лилли понимающе кивает.
    0x15D7, // Извини, Хисао, но нам пора.
    0x1607, // Видно, что Ханако чувствует себя напряжённо, да и Лилли всё ещё немного смущена.
    0x1699, // Интересно, помогли ли хоть немного мои извинения?
    0x16F4, // Вы не против, если я присоединюсь к вам?
    0x173C, // Я, конечно, навязываюсь, но… Лилли, по-прежнему улыбаясь, тихонько хмыкает.
    0x17C5, // У нас наверняка найдётся для тебя местечко, правда, Ханако?
    0x1831, // Ханако переводит взгляд на Лилли, на меня, а затем замирает, широко раскрыв глаза.
    0x18C6, // К… конечно.
    0x18DC, // Что ж, тогда пойдёмте?
    0x1904, // Уверен, что Лилли не согласилась бы с такой лёгкостью, если бы могла увидеть, насколько испугана её подруга.
    0x19C9, // Впрочем, всё уже решено.
};

#endif // KS_A1C6O2_RU_TL_INDEX