#ifndef KS_A1_MONDAY_NOBODYS_ROOM_RU_TL_INDEX
#define KS_A1_MONDAY_NOBODYS_ROOM_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_C1236A43_ru_intl[] = {
    0x0000, // Передо мной открывается вид на главное и административное здания. Впрочем, на мой взгляд, они практически одинаковые.
    0x00D8, // Зато я впервые могу спокойно рассмотреть других учеников, поэтому просто стою и наблюдаю, как они выходят из школы и расходятся по своим делам – в общежитие или к воротам, за территорию.
    0x022C, // Кажется, они все знают, куда им нужно.
    0x0270, // И я всё ещё думаю, что большинство из них не выглядят настолько «особенными», чтобы ходить в специальную школу. Да и я тоже.
    0x0350, // Это делает меня одним из них?{w} Одним из нас?
    0x03A0, // …
    0x03A4, // Я тоже должен идти, пока меня не потеряли.
    0x03F0, // Пора ужинать, но я чувствую себя скорее уставшим, чем голодным.
    0x0463, // Пока я плетусь к общежитию, удаляясь от главного здания, усталость во мне только нарастает.
    0x050A, // Между школой и общежитием раскинулся небольшой сквер. Кусты, цветы и наполняющий воздух сильный запах свежескошенной травы.
    0x05EF, // Сквозь усталость мне приходит в голову мысль, что запах кажется таким непривычным просто потому, что я давно не был на свежем воздухе.
    0x06E4, // Общежитие оказывается большим старомодным строением из красного кирпича, таким же помпезным, как и всё в этой школе. Я толкаю дверь и вхожу внутрь.
    0x07F1, // С трудом выудив ключ из кармана, я отправляюсь искать свою комнату.
    0x086C, // Комната один-один-девять…
    0x089D, // Несмотря на весь внешний антураж, внутри здание общежития выглядит современным, функциональным и скучным.
    0x0961, // Как и в главном здании, просторные коридоры, широкие двери и лифты в коридорах приспособлены для инвалидных колясок.
    0x0A37, // Я заглядываю в первую попавшуюся комнату.
    0x0A84, // Внутри несколько учеников смотрят телевизор.
    0x0AD8, // Один из них кивает мне и бросает «привет», прежде чем вновь отвернуться к экрану.
    0x0B6C, // Видимо, общительны здесь только девушки. Что ж, меня это вполне устраивает.
    0x0BF5, // Я поднимаюсь на второй этаж.
    0x0C29, // Здесь коридор разветвляется на небольшие блоки.
    0x0C82, // В каждом из этих блоков расположены четыре комнаты и общие туалет и душевая.
    0x0D0E, // Примерно в середине коридора одного из них я и нахожу комнату 119.
    0x0D84, // Именные таблички на дверях напротив пусты. Видимо, нас тут только двое.
    0x0E06, // Из-под двери комнаты 117 виден свет, и я тихонько стучусь туда.
    0x0E75, // Эй, есть кто дома?
    0x0E95, // Внутри слышится возня, затем щёлкает гораздо больше замков, чем можно было ожидать. Через мгновение дверь со скрипом открывается.
    0x0F83, // На пороге стоит парень в очках; он пристально смотрит на меня сквозь невероятно толстые линзы.
    0x1030, // Кто там?
    0x103F, // Слепой? Нет, видимо не совсем, иначе зачем ему очки…
    0x109E, // Он подходит ко мне так близко, что наши носы чуть не соприкасаются. От него воняет чесноком.
    0x1145, // Хисао Накай. Я буду жить в соседней комнате. Я подумал, что мне следует предста—
    0x11D7, // Его лицо неожиданно проясняется, и он, отступив назад, с улыбкой протягивает руку куда-то в область моей диафрагмы.
    0x12A9, // О, привет, чувак. Я Кендзи.
    0x12D8, // Привет.
    0x12E6, // Я пожимаю его потную ладонь, слегка опешив от резкой перемены его настроения и столь пылкого приветствия.
    0x13A8, // В твоей комнате недавно были какие-то подозрительные люди.
    0x1414, // Вероятно, это были мои родители.
    0x144F, // Родители? Ты уверен? Ведь это могли быть и какие-то другие люди. Никогда не стоит судить о книге по обложке.
    0x1511, // Это неуместное сравнение повисает между нами, пока я пытаюсь придумать, что бы ответить.
    0x15B3, // Вероятность этого достаточно высока.
    0x15F8, // Он вздрагивает и делает неопределённый жест руками.
    0x1658, // Да ты храбрец, Хисао.
    0x167E, // А вот я бы не стал доверять вероятности.
    0x16C7, // Единственный, кому я доверяю, – это я сам.
    0x1713, // Значит, у тебя нет оснований доверять и моим словам.
    0x1772, // Он ненадолго задумывается.
    0x17A4, // Верно подмечено.
    0x17C3, // Чёрт, а ты умнее, чем кажешься.
    0x17FA, // Возможно.
    0x180C, // Как ты выглядишь? Надеюсь, не как какой-нибудь умник?
    0x186C, // Он щурится и снова наклоняется ко мне, однако я отступаю назад.
    0x18DF, // Ладно, неважно.
    0x18FB, // Он разворачивается, замешкавшись на мгновение, чтобы нашарить дверную ручку,{w=0.3}{nw}
    0x1994, // и захлопывает за собой дверь.
    0x19CA, // Я вставляю ключ в замочную скважину комнаты номер 119.
    0x1A2B, // Унылые бежевые стены, белое постельное бельё, стол из какого-то светлого дерева. Уродливые занавески.
    0x1AE5, // Ничья комната. Лишённая всякой индивидуальности, как больничная палата.
    0x1B6A, // Рядом с кроватью валяются мои сумки, уже гораздо более пустые, чем были с утра.
    0x1BF9, // Открытый шкаф забит моей одеждой.
    0x1C37, // Я замечаю несколько комплектов школьной формы.
    0x1C8E, // К рукаву одной из рубашек приколота записка.
    0x1CE0, // Ну, по крайней мере, мне не нужно беспокоиться о распаковке вещей.
    0x1D58, // Хотя я надеялся, что можно будет ненадолго занять себя этим.
    0x1DC6, // Ещё довольно рано.
    0x1DE8, // Совершенно измотанный, я кладу записку на стол и ложусь.
    0x1E4F, // Стоит мне только растянуться на кровати, как меня охватывает жажда чтения, но книг я с собой не взял.
    0x1F06, // Очевидно, это сказывается больничная привычка читать, когда больше нечем заняться.
    0x1F9F, // Во мне нарастает странное беспокойство, в конце концов заставляющее меня встать.
    0x2034, // Может, это из-за стресса?
    0x2061, // Я нервничал перед тем, как попасть сюда, и затем весь сегодняшний день. Наверное, продолжаю нервничать и сейчас.
    0x212D, // Чёрт, мне надо как-то отвлечься, чтобы не быть постоянно таким скованным.
    0x21B2, // Завтра пойду и возьму пару книг в библиотеке.
    0x2205, // Точно, так и сделаю.
    0x2229, // А пока…
    0x2238, // Моё внимание привлекают аккуратно расставленные на прикроватном столике пузырьки с лекарствами.
    0x22EC, // Я беру один и трясу, просто чтобы услышать, как загремит содержимое, а затем читаю приклеенную этикетку.
    0x23AA, // На самом деле надпись немного другая, но смысл примерно такой.
    0x241C, // Это ненормально, когда твоя жизнь зависит от лекарств. Меня это раздражает, но разве у меня есть выбор?
    0x24D7, // Со вздохом я приступаю к своему новому ежедневному ритуалу приёма нужного количества таблеток, внимательно следя за дозировкой.
    0x25C4, // …
    0x25C8, // Я снова ложусь, а затем долго смотрю на незнакомый и ничем не примечательный потолок, чувствуя внутри пустоту и неуверенность.
    0x26B0, // Потолок продолжает казаться чужим и когда комната погружается во тьму, а по стенам, словно пальцы, протягиваются тени.
    0x2789, // Но постель становится чуть уютнее по сравнению с тем холодом, который считается тут комнатной температурой: смявшиеся простыни образовали подобие тёплого гнезда.
    0x28B5, // Скоро потолок превращается в смутную тень и начинает выглядеть как любой другой потолок ночью, оставшись единственной вещью, которую я ещё могу различить.
    0x29D2, // Ночь зовёт меня в сон, и я снова чувствую, как по моей спине ползёт холод от страха и неизвестности.
    0x2A86, // Я уплываю всё дальше от знакомого мне мира.
};

#endif // KS_A1_MONDAY_NOBODYS_ROOM_RU_TL_INDEX