#ifndef KS_A1_THURSDAY_THE_RUNNING_GIRL_RU_TL_INDEX
#define KS_A1_THURSDAY_THE_RUNNING_GIRL_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_32401C19_ru_intl[] = {
    0x0000, // Назойливый звонок будильника вырывает меня из объятий сладкого утреннего сна.
    0x0091, // Я лежу, пытаясь найти в себе силы выбраться из-под одеяла и выдумывая оправдания, почему же я всё ещё этого не сделал.
    0x0166, // Я бы не прочь проваляться так весь день. После полугода в больнице школьные будни сильно выматывают, да и освоиться в столь необычном месте чрезвычайно трудно.
    0x028A, // Но, хоть и кажется, что пропустить пару уроков тут проще простого, начинать новую школьную жизнь с прогулов не самая лучшая идея.
    0x0375, // И фельдшер снова станет докучать нотациями о необходимости зарядки.
    0x03F3, // С этой мыслью я наконец поднимаюсь с кровати и, проглотив утреннюю горсть таблеток, принимаюсь натягивать свой старый спортивный костюм.
    0x04EF, // Я сейчас освобождён от физкультуры по состоянию здоровья, так что новую форму брать не стал.
    0x0598, // Ничто не мешает попросить её выдать, но одежда, в которой я раньше пинал мячик с друзьями, навевает приятные воспоминания.
    0x0677, // Играть в футбол я в ней уже не смогу, но, может, так она получит второй шанс. Почти как я.
    0x0715, // Удивительно, что даже в такую рань на стадионе кто-то есть.
    0x0780, // Более того – знакомое лицо.
    0x07B3, // Девочка с ногами-протезами, которая вчера налетела на меня в коридоре. Она бежит по дорожке с необычной грацией механической газели.
    0x08A6, // У неё ещё какое-то короткое имя… Не могу вспомнить.
    0x0904, // Она бежит слегка вприпрыжку, а металлические протезы ритмично звякают о землю.
    0x0995, // И что она тут забыла в такую рань? Неужели фельдшер и эту бедняжку заставил носиться тут с самого утра?
    0x0A50, // Если б не его настырность, ну и не моё здоровье, конечно ноги бы моей здесь не было.
    0x0AE6, // Я пришёл сюда пораньше, только чтобы побыстрее разделаться с новой обязанностью.
    0x0B7B, // Было бы лучше, если бы никто не увидел мои жалкие потуги.
    0x0BE2, // Я бы ушёл, но на очередном повороте она, кажется, замечает меня.
    0x0C55, // Не сбавляя темпа, она бежит в мою сторону, радостно махая ручкой.
    0x0CCB, // Доброе утро! Ты ведь Хисао, да?
    0x0D02, // Она улыбается, видимо довольная тем, что запомнила моё имя.
    0x0D6E, // Ты меня, наверное, не помнишь?
    0x0DA4, // Эми! Мы столкнулись вчера в коридоре.
    0x0DE8, // Как я мог забыть столь, э… резкое знакомство?
    0x0E3B, // Эми виновато смотрит на меня исподлобья, но лишь для виду, и, не сдержавшись, начинает хихикать.
    0x0EE9, // Угу, извини за тот случай. Ещё раз.
    0x0F27, // Ничего страшного, лишь бы такое приветствие не вошло у тебя в привычку.
    0x0FA9, // Вот и здорово!
    0x0FC3, // Не уверен, что она поняла мою шутку.
    0x1004, // Значит, «шпион», о котором говорил фельдшер, – это ты?
    0x1066, // Верно!
    0x1072, // О…
    0x1078, // Честно говоря, я ожидал, что это будет кто-то из медперсонала.
    0x10E8, // Хочешь сказать, я не подхожу на роль шпиона?
    0x1138, // Нет, просто я рад, что это именно ты. Я боялся, что он отправит кого-нибудь следить за каждым моим шагом.
    0x11F3, // Ты ведь здесь не за этим?
    0x1220, // Не-а, я тут сама по себе. Фельдшер просто спрашивал, не встречала ли я на стадионе «взъерошенного парня, шатающегося всюду с потерянным видом».
    0x1324, // Так что же тебя сюда привело?
    0x1359, // Эми принимает театральную позу.
    0x1394, // Тренировка!
    0x13AA, // Какая?
    0x13B6, // Бег!
    0x13BE, // А… То есть ты состоишь в кружке лёгкой атлетики?
    0x1417, // Эми энергично кивает.
    0x143F, // Угу! Я самая лучшая бегунья!
    0x1472, // Да ещё и самая скромная.
    0x149E, // Эй, а ты не хочешь вступить?
    0x14D0, // Бег – лучшая зарядка!
    0x14F8, // Думаю, о таких подвижных упражнениях не может быть и речи.
    0x1562, // Боюсь, я не настолько люблю бегать.
    0x15A2, // Да и соревнования – это не по мне, знаешь ли.
    0x15F3, // Это правда, футболом я всё же не особо увлекался.
    0x164C, // Я и на поле-то выходил только потому, что там были мои друзья.
    0x16BB, // Уж точно не ради успехов на этом поприще.
    0x1706, // Эми понимающе кивает.
    0x172E, // Ясно, понятно. Не любишь, значит, соревнования и всё такое.
    0x1798, // Но, раз ты всё равно здесь, побегаем вместе?
    0x17E7, // Э… Конечно, давай.
    0x1809, // Эми, кажется, довольна.
    0x1833, // Разомнёшься сперва?
    0x1858, // Настоящим мужчинам разминка не нужна.
    0x189E, // Глупый! Всегда нужно начинать с разминки!
    0x18EA, // Сердито отчитывает она меня, но затем улыбается и наклоняется поближе.
    0x196C, // Я тоже ненавижу разминку.
    0x199B, // После чего ни с того ни с сего она заливается смехом.
    0x19FB, // Чёрт, да мне ведь при этом даже растяжку ног делать не приходится!
    0x1A73, // Она пару раз подпрыгивает на протезах, которые оказываются упругими, словно пружины.
    0x1B0F, // Побежали!
    0x1B21, // Итак, мы пускаемся бежать, и я тут же понимаю, что она вовсе не хвастала насчёт своих успехов.
    0x1BCA, // Эми двигается уверенно и сосредоточенно, всецело отдаваясь бегу.
    0x1C42, // В то время как я стараюсь всё внимание уделять технике.
    0x1CA7, // Больше чем на пару кругов меня сегодня не хватает, и я довольно скоро перехожу на шаг.
    0x1D43, // Эми замечает, что я остановился, лишь обогнав меня на целый круг.
    0x1DB9, // Она встаёт возле меня. Её плечи двигаются равномерно и ритмично, я же едва дышу.
    0x1E4A, // Ты уже всё?
    0x1E5E, // Я наклоняюсь, схватившись за колени.
    0x1EA1, // Уф… Да.
    0x1EAF, // Я сейчас не в лучшей форме.
    0x1EE0, // Эми кивает и задорно улыбается.
    0x1F1A, // Она вообще часто улыбается.
    0x1F4D, // Главное – начать, правда же?
    0x1F81, // Завтра постараешься пробежать чуть больше, а послезавтра – ещё больше, а потом ещё и ещё, и всё будет здорово!
    0x2049, // Буду иметь в виду.
    0x206A, // А сейчас я, пожалуй, пойду готовиться к урокам.
    0x20BF, // Кстати, разве тебе не надо?
    0x20F0, // Эми беспечно пожимает плечами.
    0x2129, // Так времени ещё полно.
    0x2152, // Я отмечаю про себя, что при ней нет часов.
    0x219D, // Ты уверена?
    0x21B2, // Она снова беззаботно пожимает плечами.
    0x21FA, // Не совсем, но… Мне ведь надо пробежать хотя бы столько же, сколько обычно.
    0x2281, // До встречи, Хисао!
    0x22A2, // Угу, увидимся.
    0x22BC, // Раз я решил всерьёз взяться за своё здоровье, то не время прохлаждаться. Начну с самых основ.
    0x2365, // В эти основы входит поддержание формы и укрепление сердца теми немногими способами, что мне доступны.
    0x2420, // Может, так я верну себе некое подобие обычной жизни или хотя бы увеличу шанс не упасть в любую минуту замертво.
    0x24EA, // Звучит, правда, немного глупо.
    0x2521, // Но так я хотя бы с чистым сердцем смогу сказать фельдшеру, что забочусь о своём здоровье.
    0x25C3, // Не то чтобы я особо увлекался бегом.
    0x2605, // Но попробовать начать, наверное, стоит.
    0x264D, // «Мисс Ибарадзаки!»
    0x2670, // Она имитирует голос Миши, имитирующей «голос» Сидзунэ, безуспешно пытаясь придать своему звонкому голоску ту же строгость.
    0x2753, // Руки шире, да?
    0x276C, // И не опираться на пятки…
    0x279A, // Я пытаюсь поддерживать тот же темп, что и Эми, но это довольно трудно.
    0x2818, // Конечно, я не так хорош, как она.
    0x2852, // Быть может, Эми сможет помочь мне улучшить технику?
    0x28B0, // Не знаю, есть ли какие-то специальные методики бега, но у меня всё явно идёт не так.
    0x2946, // Рядом с лёгкой и грациозной Эми я чувствую себя неуклюжим.
    0x29B1, // …
    0x29B5, // Не хочу больше этим заниматься.
    0x29EF, // Не уверен в успешности сегодняшнего эксперимента, но всё же неплохо, что я смог чем-то заняться.
    0x2A9E, // Как Эми правильно заметила, не всё удаётся с первого раза.
    0x2B08, // «Без труда не выловишь и рыбку из пруда», так ведь?
    0x2B64, // Меня посещает обнадёживающая мысль, что я в первый раз сам сделал что-то для укрепления своего здоровья.
    0x2C23, // И, надеюсь, не в последний.
    0x2C53, // Единственное, чего я смог добиться этой пробежкой, – убийственной усталости с самого утра.
    0x2CFA, // Даже стыдно, что я такой немощный.
    0x2D38, // Вполне возможно, что эти пробежки не более, чем пустая трата времени. Пожалуй, буду укреплять здоровье как-то иначе.
};

#endif // KS_A1_THURSDAY_THE_RUNNING_GIRL_RU_TL_INDEX