#ifndef KS_A1_THURSDAY_PROOF_OF_COMPETENCY_RU_TL_INDEX
#define KS_A1_THURSDAY_PROOF_OF_COMPETENCY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_50A9973B_ru_intl[] = {
    0x0000, // Ханако не появляется на первом уроке, и её место на заднем ряду выглядит пустым и одиноким.
    0x00A6, // Если встречу её позже, надо будет сказать ей, что Лилли её искала.
    0x011D, // По сравнению с утренними событиями урок невероятно скучный. Я лениво переворачиваю страницы учебника.
    0x01DA, // Каждый день мы проходим одинаковое число страниц, поэтому, читая наперёд, я могу получить представление о завтрашнем уроке.
    0x02BD, // Часы над доской тикают невыносимо громко. Учитель ничего не говорит целых семь минут, вместо этого покрывая доску рядами формул, переписанных прямо из учебника.
    0x03E4, // Мел постукивает по доске в такт тиканью часов.
    0x0439, // Я начинаю переписывать формулы, просто чтобы убить время, не замечая, что Миша заглядывает мне через плечо, пока она не оказывается чуть ли не верхом на мне.
    0x0556, // Что ты делаешь?
    0x0572, // Я пытаюсь говорить достаточно тихо, чтобы не привлечь к себе внимание учителя, но достаточно громко, чтобы привлечь её внимание.
    0x065D, // А ты что делаешь, Хиттян~?
    0x068B, // На меня накатывает паника, когда Миша начинает говорить во весь голос, и я поспешно шепчу ей в ответ, несмотря на то что она только что порушила все надежды на то, что наш разговор останется незамеченным учителем.
    0x080E, // Формулы переписываю, а ты что творишь? Чего ты кричишь?
    0x0872, // А~, серьёзно? Но это же всё из книги… Поэтому больше никто и не переписывает~!
    0x08FE, // Я знаю, ну и чего ты так разоралась?
    0x093E, // А почему ты еле шепчешь, Хиттян? Тебя почти не слышно.
    0x099F, // Я оглядываюсь чтобы посмотреть, не услышал ли нас кто-нибудь, и совершенно очевидно, что все услышали, даже учитель.
    0x0A72, // Сидзунэ мило улыбается, и я начинаю думать, уж не она ли подговорила Мишу на это.
    0x0B04, // Это из-за произошедшего между ней и Лилли?
    0x0B51, // Вот что я получаю за попытки быть рассудительным? За попытки выбрать что-то среднее? Сидзунэ чересчур горделива, хотя мне уже пора привыкнуть к такому её поведению.
    0x0C7D, // Зачем ты это делаешь?
    0x0CA4, // Чего?
    0x0CAE, // Пытаясь удержать свой учебник на одном пальце, Миша совершенно не замечает устремлённого на нас тяжёлого взгляда учителя. В какой-то момент начинает казаться, что неприятностей нам не избежать, но тут учитель отворачивается, будто решив, что дело того не стоит.
    0x0E8C, // Вот и хорошо. Я с облегчением откидываюсь на стуле.
    0x0EE9, // Остаток дня проходит без происшествий, чему я на этот раз рад.
    0x0F5A, // После звонка я ненадолго задерживаюсь, просматривая пройденный на уроке материал; я всё равно предпочитаю уходить последним, чтобы избежать столпотворения в коридоре.
    0x108F, // Сидзунэ и Миша тоже остаются, разговаривая с кем-то из другого класса.
    0x110F, // Сидзунэ так быстро жестикулирует, что её руки свистят, как мечи, рассекающие воздух.
    0x11A9, // Миша отчаянно пытается поспеть за ней, но ясно, что даже она с трудом её понимает.
    0x123D, // Я опускаю голову. Что бы они там ни обсуждали, это, кажется, дело серьёзное. Наверное, меня оно не касается. К тому же Сидзунэ, видимо, рассержена, хотя, может, это просто обычная её строгость.
    0x1395, // Сидзунэ жестикулирует так, что у неё хрустят запястья, а Миша пытается это всё протараторить.
    0x1440, // Иногда она запинается, будто пытаясь произнести скороговорку. Но самое главное – ей ещё приходится переводить на язык жестов всё, что говорит их собеседница.
    0x1562, // Похоже, это непростая работёнка.
    0x159E, // Миша выглядит уставшей, будто вот-вот свалится в обморок.
    0x1607, // К счастью для неё, дело вскоре решается и девушки садятся обратно на свои места.
    0x1699, // Уа-а-ах! Я так устала!
    0x16BF, // Она с измождённым видом опускает голову на парту.
    0x171A, // Должно быть, подготовка к фестивалю – дело утомительное.
    0x1783, // В самом деле, все в этой школе воспринимают фестиваль очень серьёзно. Когда встречаю бездельничающих до или после уроков учеников, они всегда обсуждают свои планы, связанные с ним.
    0x18CD, // Приятно видеть всех настолько воодушевлёнными.
    0x1925, // Я, наверное, единственный, кому нечего делать.
    0x1979, // Сидзунэ начинает жестикулировать, и Миша оживляется, наблюдая за её руками немного мутными глазами.
    0x1A31, // …
    0x1A35, // Она жестикулирует грубыми, тяжёлыми, театральными взмахами.
    0x1AA4, // Миша преобразует её жесты в слова.
    0x1AE3, // Она очень хорошо справляется, как будто на самом деле это Сидзунэ говорит, передавая через Мишу свои мысли.
    0x1BA7, // Ну, мы в Школьном совете, знаешь ли, так что довольно заняты.
    0x1C14, // Сарказм?
    0x1C24, // Чего?
    0x1C2E, // То, как Сидзунэ обращается с людьми, создаёт впечатление, что и «говорит» она надменным голосом, но Миша переводит всё как обычно, искажая первоначальный смысл своей жизнерадостностью. Это всё также сбивает с толку, и я не думаю, что когда-нибудь привыкну.
    0x1E00, // Забей.
    0x1E0C, // Как я могу забыть, вы же по меньшей мере дважды в день пытаетесь меня туда затащить?
    0x1EA4, // Ха-ха-ха~! Но, Хиттян, кто-то иной мог бы и пожаловаться, что работы слишком много.
    0x1F36, // Здорово бы было, если б студенты оказывали чуть большую поддержку своему руководству, проявили немного признательности тем, кто так упорно трудится, чтобы мечту сделать явью.
    0x2077, // Например, небольшую помощь. Так много, что ли, просим? Угу~! Помощи мы были бы рады~! От учеников вроде тебя~!
    0x2138, // Если бы ученики проявляли свою сплочённость и школьный дух и предлагали бы помощь, ну, не то чтобы мне это было необходимо…
    0x221A, // Но я бы от неё, наверное, не отказалась… Так что~! здорово, если бы кто-нибудь…
    0x22A8, // А? Привет~!
    0x22BB, // Взглянув через плечо, я замечаю Ханако, которая робко заглядывает в класс, спрятавшись за дверью.
    0x236D, // Эй! Опять изображаешь хулиганку?
    0x23A9, // Лицо Ханако заливается краской в ответ на откровенный укол Миши, хоть та и говорит это в шутку.
    0x2456, // …
    0x245A, // Сидзунэ изучающе на неё поглядывает, заставляя Ханако опустить взгляд и попятиться, пока на виду не остаются лишь её пальцы, нервно стискивающие край двери.
    0x2579, // Может быть, её неприязнь к Ханако вызвана неприязнью к Лилли?
    0x25E9, // Похоже на то, и Ханако, вероятно, тоже это известно.
    0x2646, // Кажется, они моментально забывают, что хотели заставить меня остаться до конца дня.
    0x26DF, // В чём дело, Ханако?
    0x2701, // С… Сюда приходила Лилли?
    0x272F, // Извини, Сато здесь нет. Но она, м, утром заскакивала.
    0x278D, // Ханако продолжает скованно смотреть на Сидзунэ, которая глядит на неё в ответ изучающим взглядом. Что она пытается сделать?
    0x2870, // Конечно, Сидзунэ не собирается отводить взгляд. Она и без того устрашающая, так что я могу только догадываться, в каком ужасе сейчас Ханако.
    0x296F, // Но это немного забавно – наблюдать, как реагирует Ханако на обычное поведение Сидзунэ. Похоже, вот что случается, когда встречаются две абсолютные противоположности.
    0x2AA1, // Вы… вы не знаете, где она?
    0x2AD0, // …
    0x2AD4, // Если в ней есть хоть капля здравого смысла, то она в своём классе, готовится к фестивалю. Но кто знает, где шатается эта женщина.
    0x2BBC, // Может, бездельничает где-нибудь, прямо как Хиттян~! Ва-ха-ха~!
    0x2C2A, // Чёрт, и зачем Сидзунэ постоянно делать такие ремарки?
};

#endif // KS_A1_THURSDAY_PROOF_OF_COMPETENCY_RU_TL_INDEX