#ifndef KS_A1_SUNDAY_THROWING_BALLS_RU_TL_INDEX
#define KS_A1_SUNDAY_THROWING_BALLS_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_5BD9650A_ru_intl[] = {
    0x0000, // Я проиграл спор, так что теперь должен побыть со Школьным советом.
    0x0079, // Я внезапно понимаю, что мы не обговорили место встречи. Я лучше просто подожду этих двоих, нежели буду рисковать потерять их в толпе на улице. Они, скорее всего, заняты тем, что бегают туда-сюда и решают организационные вопросы.
    0x0216, // Забавно. Я ожидал, что цена проигрыша Сидзунэ в её дурацкой игре будет куда более жестокой. Это просто предлог, чтобы провести с ней время. В общем, думаю, она просто хочет, чтобы я повеселился.
    0x0373, // У неё могут быть добрые намерения, даже если она не может подойти и сказать о них прямо, и, думаю, она мне начинает нравиться всё больше.
    0x0469, // Я мог бы не пойти, но многое бы потерял. И к тому же я хочу пойти. То есть, понимаешь, сегодня захватывающий день. В любом случае будет что-то интересное.
    0x057B, // Школьный совет? Что? Он ещё существует?
    0x05C2, // Там разве не всего два чувака?
    0x05F9, // Две девушки.
    0x0610, // Правда? Симпатичные? Чёрт, нет, постой… симпатичные?
    0x0670, // Нет! Это неважно! Я слышал, что президент у них сумасшедшая… никогда не говорит, а только отдаёт приказы через своих лакеев.
    0x0752, // Чёрт, в любой школе они одинаковые… Какие-то бессердечные сучки. Сучки повсюду.
    0x07E4, // Если там две девушки, они в большинстве – двое на одного. Опасная ситуация, чувак. Кто знает, что может случиться.
    0x08B2, // Чёрт, в Совете всего две девушки, но сколько у них в руках власти!
    0x0928, // Их надо остановить.
    0x094C, // Я прямо вижу, как они ищут пути осуществления своих феминистских планов. Я не могу доверять такому руководству.
    0x0A18, // Это не круто. Совсем!
    0x0A3E, // Чёрт. Дерьмо! Чёрт!
    0x0A60, // Я задумываюсь, чем же мне хочется заняться с Сидзунэ и Мишей. Решив, что лучше быть во всеоружии, я заглядываю обратно в комнату, чтобы наполнить бумажник.
    0x0B79, // Интересно, там есть игра, где надо поймать золотую рыбку бумажным сачком?
    0x0BFF, // Поймать её гораздо легче, чем вам пытаются внушить. Но, с другой стороны, если бы я поймал рыбку, мне бы незачем было держать её у себя.
    0x0CF2, // Что мне делать с рыбой в своей тесной комнатке? Зажарить?
    0x0D5A, // Я бы мог её отдать Сидзунэ или Мише, но это, наверное, было бы слишком.
    0x0DD8, // Действительно, проблема. Они обе милые, но не думаю, что у меня с кем-то из них есть шанс. Но, невзирая на это, я продолжаю обдумывать такой вариант. Я представляю себе, как они могли бы отреагировать, если бы я им сегодня что-нибудь подарил, например рыбку или куклу.
    0x0FB7, // Миша бы, наверное, как всегда засмеялась. А Сидзунэ бы выбила её у меня из рук.
    0x1044, // Может, это не такая уж и хорошая идея.
    0x1088, // Ладно, думаю, я готов.
    0x10AF, // По прошествии приличного количества времени мне в голову приходит мысль, что это – очередной психологический тест за авторством Сидзунэ. Даже если я ошибаюсь, время-то не стоит на месте.
    0x1205, // Я решаю пойти и поискать их, пусть даже не зная, где именно. Сегодня найти их будет, похоже, очень непросто.
    0x12C6, // Выйдя обратно в коридор, я чуть не врезаюсь в Сидзунэ.
    0x1328, // Привет, Сидзунэ. А где Миша?
    0x135A, // Я пытаюсь жестикулировать, но, по сути, просто размахиваю руками. Надо будет попросить Мишу, чтобы чуть-чуть меня научила.
    0x1438, // Здесь!
    0x1444, // Миша выскакивает из-за Сидзунэ, широко ухмыляясь.
    0x149F, // Мы просто пришли убедиться, что ты идёшь с нами на фестиваль.
    0x150E, // …
    0x1512, // Не нарушай своё обещание~!
    0x1542, // Обещание? Не припомню, чтобы я что-нибудь обещал.
    0x159B, // …
    0x159F, // Хватит пытаться увильнуть!
    0x15D1, // Ну давай, Хиттян, будет весело! Тебе в любом случае это необходимо, иначе станешь никчёмным!
    0x1678, // Ты ведь не хочешь стать одним из людей, сидящих целыми днями напролёт в комнате наедине с паранойей?
    0x172F, // Я невольно бросаю взгляд через её плечо на дверь в комнату Кендзи.
    0x17A8, // Я надеюсь, что он не слышит её слов, но, видимо, Миша как раз этого и добивается.
    0x1837, // Нет, конечно не хочу. Я просто дурачился и всё равно уже собирался уходить. Вам было не обязательно за мной заходить.
    0x190B, // Правда? А-ха-ха-ха! Ситтян волновалась, что ты попытаешься как-нибудь отмазаться!
    0x199E, // Ты нам нужен, Хиттян~!
    0x19C5, // Чего?
    0x19CF, // Сердце, кажется, ёкнуло.
    0x19FB, // У меня плоховато с прицелом, чтобы сбивать кукол с подставок… а Ситтян отказывается бросаться вещами.
    0x1AB7, // Вот оно что.
    0x1ACD, // Сидзунэ глядит на меня, мгновенно замечая моё разочарование. Она поправляет очки.
    0x1B63, // …
    0x1B67, // О чём, по-твоему, мы говорили? Я вообще ничем не хочу бросаться.
    0x1BD9, // Почему, Ситтян? Как-то странно…
    0x1C13, // Ну, как бы то ни было, Хиттян, тебе ведь приходилось кидать мячи, правда~, правда~? Так что! Тебе придётся пойти с нами!
    0x1CE6, // Меня поражает их логика. Непонятно, шутят они или нет.
    0x1D48, // Хе-хе, если б я не знал, что вы шутите, то обиделся бы.
    0x1DA7, // Вы ведь шутите, да?
    0x1DC9, // …
    0x1DCD, // Так и есть, Хиттян~! Всё так и есть, так и есть, так и есть!
    0x1E33, // Тогда я спокоен.
    0x1E51, // …
    0x1E55, // Давай, пойдём! За окнами уже группа глухих музыкантов настраивает инструменты.
    0x1EE6, // Миша хватает меня за руку и тянет из дверного проёма, но мне вполне очевидно, что она не особо старается.
    0x1FA4, // Сидзунэ смотрит на нас, немного покраснев и нетерпеливо теребя пальцами дужку очков.
    0x2040, // Я не привык к таким, казалось бы, обыденным прикосновениям, но ничего против не имею. Как я могу возражать?
    0x2101, // На улице ещё светло, но солнце уже собирается скрыться в кронах деревьев.
    0x2187, // Похоже, что здесь собралась половина школы, я даже замечаю в стороне нескольких преподавателей, попивающих пунш.
    0x2256, // К ужасу работающих в киоске девушек, они уже почти опустошили целый чан.
    0x22DA, // Предсказатели судьбы стоят и болтают с друзьями, в то время как остальные уже начали метать гороскопами в каждого из прохожих.
    0x23C2, // Такая тактика кажется мне чересчур агрессивной, но она хотя бы показывает, что они вжились в роль. Это здорово, но я не знаю, смогу ли привыкнуть.
    0x24C9, // …
    0x24CD, // Надо бы чего-нибудь поесть. Ты голодный, Хиттян?
    0x2524, // Кстати сказать, я не ел целый день.
    0x2563, // Жареной лапши мне не очень хочется.
    0x25A4, // Ничего страшного, тут много чего другого жареного!
    0x2601, // А какая-нибудь нежареная пища есть?
    0x2642, // …
    0x2646, // Конфеты. Вредная пища – самое главное в празднике!
    0x26A3, // Ва-ха-ха-ха-ха!
    0x26BD, // …
    0x26C1, // Давай я – то есть Ситтян – угощу тебя чем-нибудь одним~!
    0x2727, // Одним?
    0x2733, // …!
    0x2738, // Только одним~! Чтобы ты набрался сил для метания!
    0x2791, // Только похоже, что ещё не все киоски открылись, так что тебе может не достаться желаемого.
    0x2835, // Я оглядываюсь, поражённый количеством киосков. Невероятно, фестиваль в «Ямаку» шире по своему размаху, чем в иных городах.
    0x2915, // Несмотря на сказанное Мишей, половина школы уже празднует.
    0x2981, // Воздух наполнен возбуждённой болтовнёй по меньшей мере половины всех учеников интерната.
    0x2A27, // От аромата готовящейся еды мой голод с каждой секундой только усиливается.
    0x2AB1, // …
    0x2AB5, // Ну же, Хиттян, еду скоро всю расхватают! Если хочешь такояки, надо идти прямо сейчас!
    0x2B4E, // Я бы поела такояки~! Давайте поедим!
    0x2B8F, // Хорошо, я бы не отказался – сто лет их не ел.
    0x2BDF, // Сидзунэ срывается с места прежде, чем Миша успевает ей перевести, и энергично направляется к лавке с такояки, а Миша пытается угнаться за ней.
    0x2CE2, // Миша смеётся, подскочив к Сидзунэ, которая заказывает три порции такояки, показывая три пальца.
    0x2D91, // Я раньше не обращал внимания, но теперь кажется странным, что Сидзунэ, будучи человеком, одержимым чаем высшего сорта, любит также и фастфуд.
    0x2E92, // Я принимаю от неё тарелку с такояки, раздумывая, стоит ли начинать есть. Блюдо выглядит очень горячим.
    0x2F4C, // От него поднимается пар, а на поверхности шкворчит масло.
    0x2FB5, // Сидзунэ с Мишей смотрят на меня так, будто ждут, что я начну есть первым.
    0x3038, // Я не могу уступить, поэтому насаживаю один кусочек на пластиковую вилочку, небрежно торчащую из угла тарелки.
    0x3101, // Однако не успеваю я отправить его в рот, как Сидзунэ с Мишей страстно набрасываются на еду. Сидзунэ кусает такояки быстро, но аккуратно, а Миша, словно ребёнок, подолгу смакует каждый кусочек.
    0x325E, // Думаю, что они, как и все прочие здешние ученики, в конце концов просто обычные дети.
    0x32F7, // Это здорово. Давненько я не гулял с кем-то вот так запросто, наслаждаясь компанией.
    0x338E, // Даже до того, как я попал сюда, у меня был очень занятой год. Настолько занятой, что я до сих пор даже не осознавал, чего лишался.
    0x3475, // А здесь я чувствую себя безмятежно.
    0x34B6, // Очень умиротворяющая атмосфера. Я и не думал, что подобные фестивали до сих пор проводятся.
    0x355D, // А? Хиттян, ты что, не будешь есть?
    0x3598, // Буду, буду.
    0x35AC, // …
    0x35B0, // Надеюсь, тебя не отпугнуло то, что они горячие?
    0x3605, // Нет, не в этом дело.
    0x3628, // Мне уже начинают нравиться их поддразнивания.
    0x367D, // Я поспешно принимаюсь есть, пока еда не остыла, размышляя о том, какое великолепное зрелище создают тускло подсвеченные бумажные фонарики, сияющие тёплым светом на фоне заката.
    0x37C1, // Не успеваю я доесть свои такояки, как Сидзунэ встаёт передо мной, выпрямившись и строго сложив руки за спиной.
    0x388A, // Заметно, что она пытается быть как можно серьёзнее, но с такой улыбкой на лице даже ей не спрятать своё хорошее настроение.
    0x396A, // А-ха-ха-ха~! Пойдём, Хиттян, поиграем в какие-нибудь игры!
    0x39D0, // Разве у них всё уже готово?
    0x3A01, // …
    0x3A05, // Нет, но неважно, неважно~! Пойдём, Хиттян, пока толпа не собралась!
    0x3A7C, // Миша кладёт руку мне на плечо и заливается смехом.
    0x3AD8, // Пойдём! Пойдём! В этом году призы просто здоровские, правда-правда~! Тебе разве не хочется выиграть призы для таких красоток, как мы?
    0x3BC8, // Миша напускает на себя «милый» вид, и, надо сказать, получается эффектно. Я смотрю на Сидзунэ, ожидая, что она сделает то же самое, но она только глядит на меня как на сумасшедшего.
    0x3D0D, // …
    0x3D11, // Миша, прекрати!
    0x3D2D, // Стоп… Миша – это же я…
    0x3D58, // …
    0x3D5C, // Хиттян, торопись, ты уже тысячу лет держишь этот несчастный кусочек такояки!
    0x3DE8, // Ха-ха-ха-ха-ха!
    0x3E02, // Я люблю смаковать всё, что ем. Даже такое.
    0x3E4D, // Внезапно Сидзунэ выхватывает у меня из руки вилку и с улыбкой отправляет такояки себе в рот.
    0x3EF6, // Всё происходит так быстро, что я оказываюсь не в состоянии этому помешать.
    0x3F7E, // Не успеваю я осознать, что же произошло, как Миша взрывается хохотом, а Сидзунэ так улыбается, что кажется, будто вот-вот к ней присоединится.
    0x407F, // …!
    0x4084, // Вот дело и решено~! Ва-ха-ха! Ха-ха-ха-ха!
    0x40CB, // Сидзунэ хватает меня за правую руку, а Миша – за левую.
    0x412F, // …
    0x4133, // Ты идёшь с нами! Сегодня нас ждёт много интересного, веселись!
    0x41A4, // Ха-ха-ха-ха~!
    0x41BA, // Пробираясь сквозь уже довольно внушительную толпу, мы играем во все игры подряд: «Брось кольцо», «Замочи крота» и в такие, о которых я даже не слышал.
    0x42CA, // Выигрываем мы редко, но нам всё равно весело.
    0x431C, // Эй, а тут есть «Поймай золотую рыбку»?
    0x4361, // …
    0x4365, // Конечно! Я не знала, что тебе нравится эта игра, Хиттян!
    0x43C9, // Просто я всегда хотел попробовать. Она вроде не сложная.
    0x4430, // Ты в этом уверен, Хиттян~?
    0x445E, // Ва-ха-ха-ха~! Ладно, ладно! Посмотрим! Их киоск где-то тут!
    0x44C4, // …
    0x44C8, // Только где ты собираешься держать рыбку? У тебя есть аквариум?
    0x453A, // Ну… нет.
    0x454A, // Может, он её съест?!
    0x456D, // …
    0x4571, // Ха-ха-ха-ха-ха-ха! А-ха-ха-ха-ха-ха-ха!
    0x45B2, // Ладно, Хиттян, если нам удастся поймать рыбку, мы отдадим её тебе!
    0x4629, // Что, правда? Снова посостязаемся? Ну что ж…
    0x4678, // Сидзунэ, пытаясь скрыть горящий в глазах энтузиазм, оживлённо подталкивает меня к киоску.
    0x471D, // К счастью, им не удаётся поймать ни одной рыбки, но и мне везёт не больше.
    0x47A1, // У меня не получается сдержать смех, когда они сразу после этого начинают тащить меня к особенно крупному цветастому киоску, в строительстве которого я принимал активное участие.
    0x48E8, // Я его помню: с ним было особенно много возни.
    0x4939, // Продавец, парень ничем не примечательной наружности с выкрашенными в каштановый цвет волосами, выпрямляется, увидев, что мы подходим. Я замечаю две вещи:
    0x4A52, // Во-первых, это киоск с игрой по сбиванию кеглей, выстроенных пирамидой.
    0x4AD4, // Четыре шарика за пятьдесят иен, весьма неплохо.
    0x4B2B, // Во-вторых, тут есть инструкция к игре, напечатанная шрифтом Брайля. Мне хочется что-нибудь сказать по этому поводу, и я поворачиваюсь к Сидзунэ с Мишей.
    0x4C3F, // Но они либо не замечают её, либо для них она не кажется странной.
    0x4CB4, // Привет! Здорово, что ты пришла, Хакамити! Спасибо большое за помощь с этим киоском. Веселитесь?
    0x4D60, // Сидзунэ бросает взгляд на Мишу, которая молниеносно всё ей переводит, и лучезарно улыбается продавцу.
    0x4E1B, // …
    0x4E1F, // Ха-ха~! Это ерунда, сущие пустяки~! Да, всё здорово~! Думаю, это лучший фестиваль из тех, что мы проводили!
    0x4EDA, // Сираки, мы бы хотели поиграть, ведь можно?
    0x4F26, // Разумеется~, было бы чудесно, если бы ты просто отдал приз милым трудолюбивым работницам Школьного совета за все часы, которыми они пожертвовали, чтобы устроить весь этот праздник!
    0x5070, // Ха-ха-ха, ха-ха… Нет.
    0x5095, // А Сираки крут.
    0x50AF, // Эй, я пролил немало пота, строя этот киоск, и потратил два часа своей жизни. Думаю, я заслуживаю хотя бы один бесплатный раунд.
    0x5193, // И я!
    0x519A, // …
    0x519E, // Я тоже!
    0x51AB, // Ой…
    0x51B3, // Немного поколебавшись, он всё-таки сдаётся и, пожав плечами, вручает нам всем по четыре шарика.
    0x5260, // Не проходит и секунды, как Сидзунэ и Миша отдают свои шарики мне.
    0x52D6, // Чего это вы?
    0x52EC, // Только не говорите, что, наделав столько шума, вы даже не собираетесь играть!
    0x5378, // И это после того, как мы все вместе накинулись на Сираки!
    0x53DF, // Вот именно…
    0x53F6, // …
    0x53FA, // А ты, пожалуйста, не вмешивайся~!
    0x5435, // Сидзунэ поворачивается ко мне и пренебрежительно машет рукой. Миша разрывается между переводом и утешением продавца.
    0x550E, // …!
    0x5513, // А-ха-ха-ха! Хиттян, где твоё рыцарство? Кроме того, я – то есть Ситтян – придерживаюсь политики небросания шаров!
    0x55E0, // Ой, прости, Хиттян. У меня тоже плохо с бросанием шариков в цель. Однако у тебя наверняка это хорошо получается, правда, правда? Для тебя это не проблема!
    0x56F4, // Выглядит довольно просто. Кегли не так уж далеко, единственное препятствие в том, что шарики полые, пластиковые, да ещё и с дырками.
    0x57E3, // Я бросаю один в кеглю, и он бесцеремонно отскакивает.
    0x5844, // Какого чёрта?
    0x585D, // Да, это не так просто, как кажется. Кегли наполнены водой. Секрет фирмы.
    0x58DE, // Это не очень-то честно!
    0x5908, // Потому-то четыре шарика всего за пятьдесят иен. Как хитро!
    0x5972, // …
    0x5976, // Ну давай, Хиттян, ты сможешь их сбить! У тебя ещё одиннадцать попыток, давай!
    0x5A00, // Может, сама попробуешь?
    0x5A2B, // Сидзунэ? Хочешь попробовать?
    0x5A60, // Сидзунэ выразительно качает головой из стороны в сторону.
    0x5ACB, // Я смеюсь: это выглядит довольно забавно.
    0x5B15, // Собравшись, я бросаю ещё один шарик в пирамиду кеглей и заставляю её немного покачнуться.
    0x5BB9, // Сидзунэ с Мишей бросают жадные взгляды в сторону игрушечной кошки.
    0x5C34, // В общем-то, не так уж они и отличаются друг от друга.
    0x5C92, // Порой я задумываюсь, не был бы голос Сидзунэ похож на Мишин, если бы она могла говорить.
    0x5D31, // Нет, ну не настолько они похожи.
    0x5D6B, // Я бросаю ещё один шарик, поняв, что на самом деле это довольно просто. Если я смогу одновременно сбить две нижние кегли, то легко выиграю.
    0x5E64, // Уже начинает собираться небольшая толпа, и давление на меня усиливается. Ещё девять бросков.
    0x5F0E, // Я замахиваюсь, словно бейсбольный питчер, швыряю шарик изо всех сил, и кегли сыпятся вниз.
    0x5FB2, // Я торжественно требую приз в виде плюшевой кошки, а Миша заливается хохотом, будто это она её выиграла.
    0x606E, // Сидзунэ смотрит на меня своим обычным безэмоциональным взглядом. Ясно, что она тоже хочет эту игрушку.
    0x612A, // …
    0x612E, // Хиттян, поздравляю~! Что ты собираешься делать с этой куклой?
    0x619D, // Правильного ответа не существует. Я должен ступать осторожно.
    0x620F, // Я… не знаю.
    0x6224, // Ну-у-у-у-у-у~ Если тебе не нужна, я заберу…
    0x626F, // …
    0x6273, // Если ты только не хочешь оставить её себе, Хиттян. Не знала, что тебе нравятся мягкие игрушки. Как щекотливо.
    0x6338, // Не хочу. Мне она ни к чему.
    0x6367, // Можно тогда мне?
    0x6385, // …
    0x6389, // Их глаза сверлят мою душу.
    0x63B9, // Такое решение я принимать не хочу. Я поворачиваюсь к киоску.
    0x6427, // У вас есть ещё одна такая же?
    0x645B, // Да, как раз одна.
    0x6479, // Хорошо, ставьте всё на место, попробую ещё раз.
    0x64CE, // У меня всё ещё остаётся восемь шаров.
    0x6512, // Как только кегли снова устанавливают, я бросаю изо всех сил, но промахиваюсь.
    0x659F, // Ха-ха-ха! Пытаешься выиграть ещё одну? Хочешь выкрутиться по-лёгкому, Хиттян?
    0x662B, // Если это так легко, можешь сама попробовать.
    0x667C, // Нет, спасибочки~!
    0x669B, // Скажи, Хиттян, а ты можешь положить игрушку, хотя бы пока кидаешь шары?
    0x671B, // Нет.
    0x6723, // …
    0x6727, // Осталась всего одна, и лучше бы тебе попасть! Облажаешься – убью~!
    0x679F, // …
    0x67A3, // Однако же какой хитрый способ, чтобы не отдавать мне игрушку! И говоря «я», я имею в виду себя~!
    0x684E, // !
    0x6850, // А-ха-ха-ха-ха~! Шутка!
    0x6875, // Понятно, что Миша никого не хотела обидеть, и Сидзунэ шутка вроде бы нравится, но затем ей становится немного грустно.
    0x694C, // Я решаю вручить игрушку ей, хотя бы на то время, пока пытаюсь выиграть ещё одну. Целиться с огромной кошкой в руках трудновато.
    0x6A32, // …
    0x6A36, // Спасибо, Хиттян. Ситтян, похоже, счастлива~! Но ты ведь выиграешь и для меня тоже?
    0x6AC8, // А я разве не этим занимаюсь?
    0x6AFB, // Я снова делаю бросок, но в этот раз совсем мажу.
    0x6B51, // В руке чувствуется тяжесть, как будто кровь туда не поступает.
    0x6BC3, // Я ругаю себя, думая, что устать от такой ерунды – просто жалкое зрелище.
    0x6C46, // И тут я понимаю, что это, вероятно, из-за сердца. Если так, то я не знаю, что и думать.
    0x6CDC, // Удручающе осознавать, что такой малости для меня достаточно, чтобы осознать собственную смертность.
    0x6D95, // Наверное, я никогда не смогу перестать об этом вспоминать.
    0x6E00, // Даже сегодня, в день, который я надеялся провести с удовольствием, в этот чудесный вечер, я не могу отделаться от причины моего присутствия в этой школе.
    0x6F16, // Это место не сравнится ни с одним другим, я нигде ещё не чувствовал себя так умиротворённо.
    0x6FBC, // Но теперь сложно не думать о том, о чём думать совсем не хочется:
    0x7031, // Возможно, меня просто отправили сюда умирать.
    0x7085, // Последние несколько дней были лучшими в моей жизни. Впервые после долгого времени я почувствовал себя по-настоящему живым.
    0x7167, // Но в конечном счёте каждый раз, когда я взбираюсь на чересчур длинную лестницу или слишком сильно швыряю шарик, мне приходится вспоминать о том, что я могу умереть в любой момент.
    0x72AD, // И это всегда будет меня ограничивать.
    0x72F2, // Я ощущаю тоску и злобу. Всё-таки мне дорога моя жизнь, и я наслаждаюсь ею, а теперь она как никогда бренна.
    0x73B1, // Интересно, что же меня в конце концов добьёт? Если я настолько слаб и жалок, это может быть что угодно: неудачное падение, удар в грудь или шальной бейсбольный мяч.
    0x74D9, // Несмотря на потерю воли, я продолжаю играть в эту игру.
    0x753D, // Внезапно я чувствую укол в груди. Боль сразу же улетучивается, но заставляет меня чуть пошатнуться.
    0x75F3, // Сидзунэ в испуге отпрыгивает, а потом подходит поближе, не отрывая беспокойного взгляда. Миша кладёт руку мне на плечо.
    0x76CD, // Эй, Хиттян, ты в порядке?
    0x76F9, // Да, в порядке. Не очень хорошо себя чувствую, наверное заболел. Думаю, я не смогу продолжить.
    0x77A0, // Миша хмурится.
    0x77BB, // Не перенапрягайся. Если ты настолько болен, то так только заболеешь ещё больше.
    0x784C, // …
    0x7850, // Смотри, фестиваль только начался, а мы постоянно играли в игры. Если устал, то давай отдохнём.
    0x78FA, // Хорошая идея, Ситтян, я тоже немного устала! Все мы малость выбились из сил, бегая по школе, Хиттян!
    0x79AD, // Я киваю. Они вроде бы не заметили ничего необычного. Вот и отлично.
    0x7A26, // Мы пробираемся через море народа, а Миша указывает на лица каждого из своих знакомых. Сидзунэ держит в руках тряпичную кошку, рассеянно обнимая её. Похоже, им весело.
    0x7B54, // И вдруг на меня нападают угрызения совести.
    0x7BA4, // Из-за моего слабого здоровья нам пришлось всё прекратить.
    0x7C0E, // …
    0x7C12, // Хиттян, мы немного голодны, а ты?
    0x7C4D, // Не то чтобы сильно, но чего-нибудь съел бы.
    0x7C9A, // Этого вполне достаточно, Хиттян~! Чего бы нам купить?
    0x7CFA, // Мне неважно, что угодно.
    0x7D26, // …
    0x7D2A, // А! Тогда как насчёт бутербродов? И ещё что-нибудь попить! Миша всё принесёт!
    0x7DB3, // Что?..
    0x7DBD, // Сидзунэ с улыбкой смотрит на меня. Я понимаю, что она пытается развеселить меня шуткой, и ей это удаётся – я смеюсь.
    0x7E8F, // …
    0x7E93, // Хиттян, народу уже слишком много, поэтому здесь мы поесть, пожалуй, не сможем. И шумно к тому же.
    0x7F40, // Может, лучше подняться на крышу и поесть там?
    0x7F92, // Я согласен. Наверняка вид оттуда замечательный, да и ветерок, наверное.
    0x8014, // Значит, договорились! Думаю, мне теперь надо сходить за едой и напитками… Тогда до встречи~!
    0x80BC, // Миша неловко машет рукой и убегает.
    0x80FD, // Раньше я не замечал, как бумажные фонарики освещают ночь, но теперь могу оценить, насколько это завораживающее зрелище.
    0x81D8, // Мягкое сияние пролетающих над головой светлячков походит на сверкание снежинок в ночном небе.
    0x8286, // В большом городе такого не увидишь.
    0x82C7, // Сидзунэ нетерпеливо тянет меня за рукав и, нахмурившись, скрещивает руки на груди, выражая недовольство тем, что я отвлёкся.
    0x83AA, // …
    0x83AE, // Ты ведь знаешь, что я не понимаю язык жестов.
    0x83FF, // …
    0x8403, // Кстати, а разве не глупо с моей стороны говорить? Она ведь не услышит.
    0x8481, // Я пожимаю плечами, показывая, что ничего не понимаю. Сидзунэ качает головой и отмахивается.
    0x8528, // Может, стоит попросить Мишу провести урок языка жестов?
    0x858E, // Поднявшись на крышу, я снова поражаюсь размерам школы. Территория настолько обширна, что непонятно, как я раньше не обращал на это внимания.
    0x868E, // Идя по крыше вслед за Сидзунэ, я не могу не поддаться очарованию сверкающих звёзд.
    0x8724, // Мы с Сидзунэ усаживаемся на скамейку. Кажется, она пребывает в хорошем настроении и мягко улыбается, а ветер развевает её волосы.
    0x8810, // Мы смотрим на фестиваль внизу, который отсюда кажется морем янтарных фонарей и колышущихся бумажных вееров, переполненный людьми, часть которых нарядилась в праздничные юкаты.
    0x8955, // Собственно, большинство девушек одеты в юкаты. Интересно, почему Сидзунэ и Миша не надели их сегодня?
    0x8A0E, // Юкаты хорошо бы на них смотрелись. Я мельком задумываюсь, какой тип юкаты каждая из них выбрала бы.
    0x8AC2, // Сидзунэ наверняка надела бы что-то традиционное, а вот насчёт Миши я не уверен.
    0x8B52, // Прибегает Миша, тяжело дыша от быстрого бега и стараясь не уронить еду, которую несёт в руках.
    0x8BFD, // Разложив её на крыше, она позволяет себе расслабиться.
    0x8C61, // А-ха-ха-ха! Это заняло немало времени! Вы не сказали, чего хотите, так что я взяла рисовый пунш, сэндвичей и сладостей! Всего понемножку!
    0x8D56, // Отлично. Давайте начнём.
    0x8D83, // Миша откусывает кусочек от маленького треугольного сэндвича.
    0x8DF5, // Ну как, Хиттян, что думаешь о фестивале? Он замечательный, правда?
    0x8E6C, // Ага.
    0x8E74, // …
    0x8E78, // Красивые звёзды сегодня вечером. Трудно придумать более идеальный день.
    0x8EFD, // Звуки людской толпы, доносящиеся снизу, звучат как тихая музыка, смешиваясь с отдалённым стрекотом цикад.
    0x8FBF, // Я отпиваю пунш из банки и поднимаю взгляд на Мишу, которая, кажется, с комфортом спит, растянувшись на гравии с полупустой банкой яблочного сока на животе.
    0x90D9, // Сидзунэ сидит с поджатыми ногами, медленно раскачиваясь взад и вперёд, словно нетерпеливый ребёнок, и смотрит на небо.
    0x91B2, // Они обе такие красивые. Оглядевшись, я отмечаю, что многие ученики держат за руку свою девушку или парня.
    0x9271, // Не так далеко от нас на крыше расположилось несколько держащихся за руки парочек, созерцающих звёзды в вышине или огни фестиваля под нами.
    0x936F, // Часть меня хочет этого же.
    0x939F, // Глядя на Сидзунэ и Мишу, я размышляю о том, что, возможно, стоит пригласить одну из них на свидание. Может, рискнуть?
    0x9470, // Золотые стрелки на изящных часиках Сидзунэ привлекают моё внимание, и я вижу, что уже довольно поздно. Но фестиваль ещё в самом разгаре.
    0x9568, // Сидзунэ всё так же держит за лапу плюшевую кошку, которую я выиграл. Она замечает, что я на неё смотрю.
    0x9621, // …?
    0x9626, // И без раздумий протягивает её мне. Я улыбаюсь, желая спросить, что же мне с ней делать, – но она меня не поймёт.
    0x96EE, // Я трясу головой и стараюсь объяснить, чтобы она оставила её себе. Надеюсь, она меня поняла.
    0x9793, // Посмотрев в сторону школы, я вижу перед собой множество людей, и все они веселы и счастливы.
    0x983A, // Я гляжу на них и чувствую умиротворение.
    0x9884, // Это было нечто. Сегодняшний день прошёл не зря.
    0x98DA, // Но я всё ещё не могу стряхнуть с себя меланхолию и чувство вины, напавшие на меня чуть ранее. Они продолжают цепляться за меня, и я не могу от них избавиться.
    0x99F6, // Сидзунэ что-то показывает мне жестами, а я не могу её понять. Что бы я ни сказал, она меня не услышит.
    0x9AAB, // Я не понимаю тебя, Сидзунэ.
    0x9ADC, // Ладно, проехали. Интересно, мы оба считаем себя виноватыми в этом? В любом случае мне жаль, что я не могу тебя понять.
    0x9BAF, // Знаешь, я почти… почти рад, что ты чуть ли не силком меня сюда привела. Правда, если я попытаюсь встречаться с тобой, мне придётся крепко подумать над этой твоей стороной.
    0x9CE5, // Нет, на самом деле… Я искренне рад. Сегодня было здорово.
    0x9D4D, // Ты бы была привлекательней, если бы чаще улыбалась. У тебя милая улыбка.
    0x9DD0, // Раздосадованная, она поднимается, сложив руки за спиной и выглядя уверенно и властно на фоне звёздного полотна.
    0x9E9D, // Внезапно Сидзунэ вскидывает руки к открытому небу, словно удерживая его в своих руках.
    0x9F3C, // Словно она говорит мне: «Оглядись, посмотри на мир вокруг!»
    0x9FA8, // Школа, купающаяся в свете фестиваля и раскрашенная цветастыми кимоно, крыша, освещённая светлячками, небо, настолько огромное, что вселяет благоговейный трепет.
    0xA0D0, // Чего она хочет? Понимание медленно снисходит на меня. Этот прекрасный вид – доказательство того, что в мире есть много вещей настолько прекрасных, что портить их плохим настроением непростительно.
    0xA23A, // И я чувствую силу личности Сидзунэ, подчёркивающей эту точку зрения.
    0xA2B8, // Спасибо, пожалуй.
    0xA2D8, // Я отворачиваюсь в сторону, но Сидзунэ хватает меня за плечо, при этом её часы скользят по моей щеке.
    0xA38D, // Левой рукой она указывает на небо.
    0xA3CC, // Со слабыми хлопками в небе начинают взрываться фейерверки, рассыпая дождь ярких красок, которые медленно исчезают во тьме.
    0xA4AE, // Я не могу вспомнить, когда в последний раз видел фейерверк, не говоря уже о таком большом. К тому же кажется, что его запускают откуда-то из школы, во что почти невозможно поверить.
    0xA5F4, // Огни в небе смешиваются со вторым залпом из города внизу, и создаётся впечатление, что совпадение не случайно, что они призваны дополнить друг друга, как две части дуэта.
    0xA72A, // Это продолжается ещё, наверное, минут пятнадцать, а затем прекращается.
    0xA7AD, // Сидзунэ наконец понимает, что рука её так и лежит на моём плече, и аккуратно убирает её со стеснённым видом.
    0xA871, // Восстановив самообладание, она усмехается, уперев руки в боки и выпятив грудь вперёд.
    0xA90E, // В такие моменты она выглядит словно обычная девочка-подросток. Энергичная, весёлая и беззаботная.
    0xA9C2, // Мы с Сидзунэ не торопясь едим, молча наблюдая, как толпа внизу постепенно редеет.
    0xAA56, // Она сидит чуть наклонившись вперёд, удобно оперевшись подбородком на сложенные руки, и на лице её написано умиротворение с лёгким оттенком задумчивости.
    0xAB70, // И она по-прежнему бережно держит за лапу плюшевую кошку.
    0xABD7, // Я чувствую, что устал за день, говорю ей, что увижусь с ней и Мишей завтра, – даже и не подумав, что она меня не слышит, – и направляюсь назад к общежитию.
    0xACEB, // Я ощущаю радость жизни и тепло в груди даже на прохладном ночном воздухе.
    0xAD71, // Образ Сидзунэ, твёрдо стоящей перед самими звёздами и призывающей меня отбросить жалость к самому себе, никак не хочет покидать мой разум.
    0xAE6F, // Если… если для того, чтобы влюбиться, нужен лишь миг, то, думаю, я влюбился в неё.
    0xAF01, // Самую чуточку.
};

#endif // KS_A1_SUNDAY_THROWING_BALLS_RU_TL_INDEX