#ifndef KS_A1C4O2_RU_TL_INDEX
#define KS_A1C4O2_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1DBFD_ru_intl[] = {
    0x0000, // Извини, я не хотел тебя напугать.
    0x003C, // Ни… ничего страшного.
    0x0065, // По её перепуганному виду не скажешь, что ей не страшно, но я решаю не зацикливаться на этом.
    0x010B, // Так, м-м… ты не против, если я тут присяду?
    0x0157, // Кажется, она пребывает в смятении, но наконец находит в себе силы едва заметно кивнуть.
    0x01F6, // Х… хорошо.
    0x020A, // Я сажусь рядом с ней, а она робко прячет лицо за книгой.
    0x026E, // «Жизнь Пи»… Никогда не слышал о такой.
    0x02B5, // Это, э… опять же, извиняюсь, что напугал. Я Хисао.
    0x030E, // Она выглядывает из-за книги, медля с ответом.
    0x0360, // Я… знаю.
    0x0370, // Мы… мы в одном… одном классе.
    0x03A7, // Она говорит запинаясь и так тихо, что её едва слышно даже в безмолвии библиотеки.
    0x043B, // Думаю, я ошибся, приняв её за хулиганку.
    0x0483, // Х-Ханако. Я… Ханако.
    0x04A8, // …
    0x04AC, // Я сдерживаюсь, чтобы не ляпнуть банальщину вроде «какое красивое имя», но это действительно единственное, что приходит мне в голову.
    0x059F, // Я чувствую себя идиотом. Все тут уже наверняка привыкли к тому, что у каждого есть особенности, а я один напрягаюсь и нервничаю из-за такой ерунды.
    0x06A9, // Не буду тебя отвлекать. Я… просто посмотрю книжки, если ты не против.
    0x0727, // Она чуть кивает, вздохнув с облегчением.
    0x0771, // …
    0x0775, // Я начинаю изучать обложки и оглавления книг, которые взял, а она возвращается к чтению.
    0x0814, // Наступает неловкое молчание.
    0x084A, // Я продолжаю украдкой смотреть в её сторону, пытаясь увидеть скрытые под россыпью тёмных волос шрамы.
    0x0903, // Через какое-то время я понимаю, что она тоже поглядывает на меня, лишь притворяясь погружённой в книгу.
    0x09BF, // Но в её взгляде нет и намёка на любопытство; он мечется, словно испуганный кролик.
    0x0A54, // Когда наши глаза наконец встречаются, происходит цепная реакция.
    0x0ACC, // Она резко вскакивает с пуфа и набирает в грудь воздуха.
};

#endif // KS_A1C4O2_RU_TL_INDEX