#ifndef KS_A1_SATURDAY_SHANGHAIED_RU_TL_INDEX
#define KS_A1_SATURDAY_SHANGHAIED_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_9F0608DA_ru_intl[] = {
    0x0000, // В пять минут девятого меня резко будит невероятно громкий стук в дверь.
    0x0083, // Я быстро открываю её и вижу стоящих передо мной Сидзунэ и Мишу. Обе выглядят немного устало, особенно это заметно по Мише.
    0x0161, // Кто из вас стучал?
    0x0182, // Задаю я вопрос, который наверняка интересует всё общежитие.
    0x01F0, // А-ха-ха-ха, это неважно, Хиттян!
    0x0228, // Она и глазом не моргнув отмахивается от вопроса.
    0x0281, // Что? Ты до сих пор в пижаме, Хиттян? Значит, ты не в восемь встаёшь?
    0x02F8, // Я замечаю, что у неё мокрые волосы, а кудри еле держат форму.
    0x0365, // Нет, я думал, что посплю немного подольше, потому что сегодня суббота и целую неделю я недосыпал.
    0x0415, // Уловила ли она мой ядовитый тон?
    0x0450, // …
    0x0454, // Тогда хорошо, что мы пришли тебя разбудить!
    0x04A3, // …
    0x04A7, // В общем, Хиттян, думаю, тебе хочется узнать, почему мы здесь, да?
    0x051A, // Догадаться несложно, но я надеюсь, что она не произнесёт то, что собирается.
    0x05A4, // Хочешь прогулять уроки и пойти с нами в какое-нибудь уютное местечко?
    0x0623, // Чего-чего?
    0x0636, // Хочешь прогулять уроки и заняться чем-нибудь весёлым?
    0x0699, // Я нисколько не сомневаюсь, что они снова заставят меня помогать им с какой-нибудь адской работой.
    0x074B, // Серьёзно?
    0x075D, // Миша ухмыляется и с энтузиазмом кивает.
    0x07A6, // Мне нравится этот их новый подход, но я удивлён, что они предложили пропустить уроки, даже когда у нас сокращённый день.
    0x0880, // А вас не беспокоит, что вы так часто прогуливаете?
    0x08DB, // …
    0x08DF, // Ну, это не проблема! Хиттян, каждый раз, когда наступает такое время, как сейчас, школа в застое.
    0x098C, // Да и к тому же сегодня суббо~та. Неужели не хочешь повеселиться?
    0x0A00, // Меня изумляет их беззаботность.
    0x0A3B, // …
    0x0A3F, // Не то чтобы мы настаивали на твоей компании, но мы подумали, что ты будешь рад куда-нибудь сходить!
    0x0AF2, // …
    0x0AF6, // Так… ты хочешь с нами пойти? Давай, это будет намного веселее, чем сидеть здесь понурив голову~!
    0x0BA4, // Наверное, я ничего важного не пропущу, да и скучать по мне не будут.
    0x0C1E, // Ну ладно, не думаю, что я многое пропущу. Какие у вас предложения?
    0x0C94, // Внезапно в голову приходит одна мысль, из-за которой я подозрительно щурюсь.
    0x0D20, // Постойте… это ведь не очередная уловка, чтобы снова заставить меня работать на Школьный совет, правда?
    0x0DDD, // …
    0x0DE1, // Нет, конечно нет!
    0x0E00, // И даже думать такое – очень низко, Хиттян.
    0x0E4D, // …
    0x0E51, // …И, кроме того, ты теперь в Совете, не забыл?
    0x0EA1, // Если б мы захотели, чтобы ты что-то для нас сделал, нам бы не понадобились никакие уловки~!
    0x0F44, // Ха-ха-ха!
    0x0F54, // Это новая форма принуждения. Только две симпатичные девушки могут такое провернуть.
    0x0FEF, // Я позволяю себе немного расслабиться. Наверное, я параноик. Похоже, они действительно просто хотят погулять.
    0x10B6, // И тем не менее…
    0x10D3, // Никаких уловок?
    0x10F0, // …
    0x10F4, // Никаких! Хватит параноить!
    0x1125, // Ну, как скажешь.
    0x1142, // Я вдруг осознаю, что всё ещё стою в пижаме.
    0x118F, // А вы дадите мне сперва одеться?
    0x11C8, // …
    0x11CC, // А? Зачем, Хиттян? Ты отлично выглядишь!
    0x1212, // И всё же я предпочту надеть что-нибудь другое.
    0x1266, // Я закрываю дверь прежде, чем она успевает ответить, и быстро натягиваю форму.
    0x12F3, // Снова выйдя в коридор, я становлюсь свидетелем оживлённой беседы Сидзунэ и Миши.
    0x1387, // Интересно, бывает ли такое, что беседующие на языке жестов случайно попадают друг другу пальцем в глаз?
    0x1444, // От моих размышлений меня отрывает Сидзунэ, нетерпеливо похлопав меня по плечу.
    0x14D5, // …
    0x14D9, // В общем, мы собираемся улизнуть в город! Помнишь тот чайный дом, в котором мы были в среду?
    0x157C, // Чайный дом?
    0x1591, // …
    0x1595, // Ты не помнишь?
    0x15AF, // А, вы про то кафе.
    0x15CE, // Чайный дом! Он называется «Шанхай». Ну, потому что Китай – родина чая. Пойдём, Хиттян! Я тебя даже угощу!
    0x168A, // А… не я, не я, в смысле Ситтян! А-ха-ха~!
    0x16CF, // Не знаю…
    0x16E0, // Там хорошо, очень расслабляюще! Он как… полукафе, полуресторан, полутрадиционный ресторан, полу… библиотека…
    0x17AC, // Что?
    0x17B4, // Как-то многовато половин.
    0x17E3, // Но Миша этого, кажется, не замечает.
    0x1824, // Так что~! Пойдём, не так уж часто у нас бывает так много свободного времени!
    0x18AC, // …
    0x18B0, // Но если ты занят, то не обязан идти! Твоё присутствие не является абсолютно, абсолютно необходимым!
    0x1965, // Ха-ха-ха-ха!
    0x197A, // В жизни не видел настолько плохо скрываемой реверсивной психологии. Я сегодня какой-то уставший, и мои учителя, возможно, будут интересоваться, где я. Возможно.
    0x1A9E, // С другой стороны, я так толком и не был в городе с момента приезда, а это хороший повод туда отправиться.
    0x1B5B, // К тому же не мешало бы поесть. Если Сидзунэ угощает – так даже лучше. Я на мели.
    0x1BEA, // Хорошо, пойдём. Показывайте дорогу.
    0x1C2B, // Здорово~!
    0x1C3C, // Через полчаса мы добираемся до чайного дома. Похоже, мы единственные посетители.
    0x1CD0, // Тут всегда так тихо по утрам?
    0x1D05, // Спрашиваю я, подразумевая «тут всегда так пусто?».
    0x1D61, // …
    0x1D65, // Нет, это как-то странно. Но это ведь замечательно, правда?
    0x1DCD, // Правда.
    0x1DDB, // Мы садимся за большой квадратный деревянный стол, и я вдруг понимаю, что не знаю, что здесь подают. В прошлый раз я просто взял то, что порекомендовала Юко.
    0x1EF4, // Эй, а тут есть меню или что-то вроде того?
    0x1F3E, // Не-а!
    0x1F47, // В этих словах слышна изрядная доля азарта.
    0x1F95, // …
    0x1F99, // Ну что, Хиттян, ты уже решил, что будешь заказывать?
    0x1FF6, // Я гляжу по сторонам и не вижу ничего, напоминающего меню.
    0x205E, // Не понимаю, что не так с этим местом? Почему?
    0x20AE, // Это какое-то секретное заведение? Доступ сюда возможен только по какому-то особому рукопожатию? Какому-то подмигиванию или кивку?
    0x219C, // Надо, чтобы кто-нибудь за тебя поручился? Поклясться на крови? Чёрт возьми, в прошлый раз всё было совсем иначе.
    0x2266, // Не знаю, в прошлый раз я заказал только кофе. Что здесь подают?
    0x22D7, // …
    0x22DB, // Чай!
    0x22E3, // А, точно, это же…
    0x2302, // Но ведь не просто чай? Не только же чай? Что-то другое ведь тоже есть?
    0x237E, // …
    0x2382, // Ясное дело~!
    0x2398, // Ясное? Это как? Тут нет меню. Где меню?
    0x23DC, // Они опять надо мной издеваются. Делать нечего, всё, что я могу, – приготовиться сгореть со стыда.
    0x248C, // Мне хочется уйти, но я уже сижу за столом.
    0x24D7, // Было бы неправильно сейчас уйти: неписаные правила вежливого поведения в обществе преграждают мне путь к выходу, словно стена огня.
    0x25C9, // Я решаю выбрать безопасный вариант. Закажу то же, что и они, если это будет приемлемо для мужчины.
    0x267A, // Почему бы вам не сделать заказ раньше меня? Дамы вперёд.
    0x26E0, // …
    0x26E4, // Хорошо придумал, Хиттян, но~ мы уже заказали!
    0x2735, // Как это возможно? Когда? Как? У кого?
    0x2776, // Мы – постоянные посетители и так часто сюда ходим, что уже нет нужды специально что-либо заказывать!
    0x282E, // …
    0x2832, // Ну ладно, хватит с тебя. Мы сидим на меню~!
    0x287D, // Ха-ха-ха!
    0x288D, // Я оглядываюсь на остальные столики. Ни на одном из них меню нет. Значит, они их держат большой стопкой у входа. И надо же на такое усесться, да и с какой скоростью они их схватили!
    0x29CF, // А, ну ладно. В таком случае можно мне одно?
    0x2A1B, // …
    0x2A1F, // Ты можешь взять, если хочешь, но ты ведь не из тех, кто способен на нечто столь раз-врат-ное, так ведь?
    0x2AD5, // Я говорю им, что возьму только кофе, и опускаю голову на прохладную поверхность стола.
    0x2B72, // …
    0x2B76, // Кофе? Тут такое первоклассное заведение, а ты хочешь заказать кофе?
    0x2BF1, // Вот опять они пудрят мне мозги.
    0x2C2A, // В таком случае я буду то же самое, что и вы.
    0x2C77, // …
    0x2C7B, // Хиттян, Ситтян закажет особый чай, который выращивают только на далёких плантациях в Индии.
    0x2D23, // Чай до сих пор изготавливается племенными мастерами, в семьях которых рецепт передаётся из поколения в поколение.
    0x2DF5, // Им приходится переходить вброд кишащие аллигаторами воды, чтобы раз в год раздобыть листья чая. В каждом таком путешествии кто-нибудь погибает.
    0x2EFD, // Я не стану такое пить, иначе меня чувство вины замучает.
    0x2F63, // Тогда я буду то, что будешь ты.
    0x2F9A, // Я не знаю, что я возьму.
    0x2FC4, // Как это?
    0x2FD3, // Отлично, буду чай, за который погибли люди.
    0x3021, // Нет, забейте. Буду кофе.
    0x304C, // Если это первоклассное заведение, у них должен быть первоклассный кофе, верно? … За который никому не пришлось погибнуть, да?
    0x3131, // Отличный ответ, им нечего ему противопоставить. Сидзунэ пожимает плечами, как бы говоря: «Прекрасно сыграно».
    0x31FA, // Но всё же они не отвечают на мой второй вопрос.
    0x324F, // Миша зовёт Юко, и та приносит нам напитки и по одному невероятно тоненькому кусочку жёлтого торта с воткнутой в него чёрной пластиковой вилочкой.
    0x335A, // Я съедаю свой кусочек в один присест. Удивительно, но это, возможно, самое несытное из всего, что я когда-либо ел.
    0x3426, // Хиттян, у тебя есть на завтра какие-нибудь планы?
    0x347F, // Миша делает глоток своего чая, название которого звучит подозрительно высококлассно, хоть он и похож на обычный.
    0x354E, // Она пьёт с поразительной неосторожностью, учитывая то, какой он горячий. Полная противоположность Сидзунэ или Лилли.
    0x3625, // Планы? Звучит зловеще.
    0x364E, // Планы? Да.
    0x3660, // Да, я завтра ужасно занят. На самом деле у меня будет столько дел, что совсем не останется свободного времени.
    0x3727, // Точно… вообще ни капельки. И всё, что мне придётся делать, чрезвычайно важно. Очень, очень важно.
    0x37D7, // Миша хихикает, явно не купившись на это, а потом передаёт всё Сидзунэ, которая степенно кивает с очень недовольным видом.
    0x38B4, // Внезапно она подаётся вперёд, изучающе глядя мне в лицо, будто ходячий детектор лжи, ожидая малейшего признака, который меня выдаст.
    0x39A6, // Эта сцена длится минуту, а затем она возвращается на своё место и делает глоток чая.
    0x3A3F, // …
    0x3A43, // Ну, раз ты так занят, Хиттян, ничего не попишешь. Нам завтра делать нечего, поэтому мы думали, что ты, может, захочешь пойти с нами на фестиваль!
    0x3B45, // Ты ведь всё равно здесь новенький, правда? Правда? Так что~ мы думали, что покажем тебе окрестности и повеселимся вместе, но, если ты так занят, мы понимаем!
    0x3C5E, // …
    0x3C62, // Не судьба, не судьба!
    0x3C88, // Обе одновременно пожимают плечами, будто этот жест был заранее отрепетирован.
    0x3D18, // А-ха-ха-ха-ха-ха~!
    0x3D36, // Хиттян, ты такой параноик.
    0x3D66, // …
    0x3D6A, // …И тебе всё равно меня никогда не переиграть, так что зачем так стараться?
    0x3DF2, // Ха-ха! Ого, Ситтян~!
    0x3E14, // Переиграть тебя? О чём ты?
    0x3E43, // Она говорит о принуждении? Никогда не думал, что для неё это всего лишь игра. Я думал, что я единственный, кто видит в этом соревнование.
    0x3F39, // …
    0x3F3D, // Ты знаешь~! …Э? Знаешь, Хиттян? Потому что я – нет.
    0x3F97, // …
    0x3F9B, // Тебе меня не перехитрить! —А, ну, Хиттян, не меня…
    0x3FF6, // …
    0x3FFA, // Что? О чём ты говоришь, Ситтян?..
    0x4033, // Сидзунэ хитро улыбается, вызывая меня на битву воли и разума.
    0x40A3, // Для отброшенного на край отчаяния нет иного выбора, кроме как утонуть или ухватиться за мимолётный остаток надежды, бороться изо всех сил против неотвратимости судьбы и противостоять невозможному.
    0x420F, // Ибо, даже павши, падёт он со знанием, что сражался благородно…
    0x4281, // …или что-то типа того.
    0x42AA, // Ну, это мы ещё посмотрим. Не недооценивай меня.
    0x42FF, // …
    0x4303, // Разве тебе не придётся пройти через множество испытаний, чтобы доказать это, Хиттян?
    0x439E, // Ну, мне может повезти. Не отбрасывай эту возможность.
    0x43FF, // …
    0x4403, // Не повезёт~.
    0x4419, // Повезёт! Постой…
    0x4439, // …
    0x443D, // Тогда давай поспорим!
    0x4465, // Мне плевать на состязание.
    0x4496, // Вопиющая ложь.
    0x44B1, // Постой, что именно ты имеешь в виду?
    0x44F2, // Ничего страшного, что ты не понимаешь, потому что я тоже не понимаю! Ва-ха-ха-ха!
    0x4582, // …
    0x4586, // Значит, решено! Отлично, отлично!
    0x45C2, // Что? Ты не слышала, что я только что сказал?
    0x4610, // …
    0x4614, // Теперь всё, что осталось, – ставки! Что выиграет победитель или, что ещё интереснее, чего лишится проигравший!
    0x46DD, // Эй!
    0x46E3, // Меня втянули в рискованную игру. Сидзунэ – очень опасная девушка, поскольку мыслит только в категориях выигрыша и проигрыша.
    0x47C9, // Если она на любой наш с ней диалог смотрит как на столкновение характеров, не думаю, что я выдержу.
    0x487C, // Такие вещи сводят людей с ума. Она пренебрегает всяческими моральными нормами – прежде-то я думал, что она просто стоик.
    0x4958, // Тем не менее мне интересно. Я понимаю, что вызвал её на нечто, по существу являющееся дуэлью без каких-либо правил, которая не закончится, пока один из нас не… что?
    0x4A80, // Думаю, в этом и дело. Слишком всё неопределённо. Какие условия необходимы для победы или поражения? Первый, кто почувствует себя глупо, проиграет?
    0x4B8A, // Не знаю, мне раньше никогда не приходилось думать о подобном.
    0x4BFA, // Никогда?
    0x4C0A, // Никогда.
    0x4C1A, // Так ты никогда не играл в азартные игры, Хиттян?
    0x4C71, // Я удивлён, что вы играли.
    0x4C9E, // …
    0x4CA2, // Ой, да ладно… Это же просто ради веселья! Среди друзей~!
    0x4D07, // Суть в унижении, причинении страданий и доведении до полного отчаяния! Не в этом разве смысл?
    0x4DB1, // Сидзунэ в раздумьях прикладывает палец к виску.
    0x4E09, // …!
    0x4E0E, // Хм… Тогда как насчёт этого, Хиттян: если ты проиграешь, тебе придётся однажды прийти в школу без штанов.
    0x4ECC, // Ты с ума сошла?
    0x4EE7, // Хотя по сравнению с тем, что я ожидал от неё услышать, это весьма милосердно.
    0x4F72, // Нельзя поставить просто деньги, как нормальные люди?
    0x4FD3, // …
    0x4FD7, // Если б мы поставили деньги, у тебя бы их не хватило~! Теперь твоя очередь! …Но никаких извращений! Ясно?
    0x5092, // Ха-ха-ха!
    0x50A2, // Думаю, мне нужно время.
    0x50CC, // Из-за этого я теперь неделями буду на взводе.
    0x511E, // Окей~! Давайте оба торопитесь, а то всё остынет!
    0x5174, // Я начинаю поспешно допивать кофе, а Сидзунэ принимается за чай, сверля меня пылким взглядом, полным соперничества.
    0x5246, // Какая растрата – пить на скорость чай, ради которого кому-то пришлось отдать жизнь.
    0x52DF, // Хиттян, ты уверен, что не хочешь с нами завтра пойти? Многие с нетерпением ждали этого дня, ты не должен упускать такой возможности.
    0x53CE, // Я невнятно мычу ей в ответ.
    0x53FF, // Я не совсем поняла…
    0x5424, // Время думать. У Сидзунэ осталось меньше напитка, но свой я могу допить быстрее.
    0x54B4, // Если первой закончит она, то, возможно, не станет платить и предоставит это мне, несмотря на то, что говорила, будто всё за её счёт.
    0x55A0, // Так как денег у меня с собой нет, я буду унижен, и это засчитается как поражение.
    0x5631, // Если первым закончу я, то с точки зрения джентльменства буду выглядеть как козёл, будто мне не терпится сбежать из этого чайного дома, заставив её за всё платить. Это тоже засчитается как поражение. Она этим воспользуется.
    0x57C6, // В случае ничьей она может попробовать выбежать за дверь и я, возможно, сделаю то же самое. Это может привести к столкновению в дверях, что есть тоже унижение, хоть и не такое сильное. …И Мише придётся оплатить счёт.
    0x594B, // Это как-то по-детски. Я немного разочарован как в Сидзунэ, так и в себе самом.
    0x59D6, // Ну, Хиттян, было бы мило, если бы мы вместе отпраздновали наш организаторский успех, любуясь нашими творениями…
    0x5AA3, // Миша, кажется, вовсе не замечает, что перед ней бушует эпическая битва характеров. Я медленно киваю и допиваю остатки кофе.
    0x5B83, // Ну, я закончил. Думаю, мне пора идти. И я ухожу. Тихо-мирно.
    0x5BEB, // …
    0x5BEF, // Ты тоже, Ситтян?
    0x5C0C, // Почему вы ведёте себя так странно?
    0x5C4B, // Я быстро выхожу за дверь, а Сидзунэ – следом. Мише придётся разбираться со счётом.
    0x5CE1, // Прости, Миша.
    0x5CF9, // Поравнявшись со мной, Сидзунэ быстро поправляет очки и суёт мне в руку записку.
    0x5D8A, // Так ты думаешь, что сможешь выиграть прямо сегодня? Это как-то самоуверенно, Сидзунэ.
    0x5E25, // Я вспоминаю, что она меня не слышит, и киваю.
    0x5E75, // Сейчас она выглядит куда симпатичнее, чем обычно, мягко улыбаясь с оттенком самоуверенности.
    0x5F20, // Сидзунэ выглядит энергично и беззаботно, хотя, возможно, это из-за кофеина.
    0x5FA9, // Она подмигивает и протягивает руку для рукопожатия. Я задумываюсь, а нет ли у неё в руке электрошокера, но решаю, что на такое она не пойдёт, так что пожимаю ей руку.
    0x60D3, // С пожатием она передаёт мне другую записку. На секунду мне кажется, что это электрошокер, и в голове мелькает вопрос, не умру ли я от удара.
    0x61CF, // Сидзунэ ухмыляется и убегает прочь.
    0x6211, // Я театрально сжимаю записку в кулаке, но никто, к моему сожалению, этого не видит.
    0x62A5, // Наверное, уже поздно возвращаться в чайный дом и спрашивать дорогу у Миши.
    0x632D, // Но, с другой стороны, я усложнил ей задачу тем, что не знал пути сюда, так что не могу позволить ей одержать верх из-за того, что я не знаю дорогу обратно.
    0x6440, // И, если я спрошу её, Сидзунэ воспримет это как победу. Нет, в этом нет необходимости.
    0x64D8, // Школа находится на вершине проклятого холма, насколько труден может быть её поиск?
    0x6570, // Может, у меня и топографический кретинизм, но даже я с этим справлюсь.
    0x65EF, // Полтора часа спустя я оказываюсь на длинной мощёной дорожке, ведущей к главному зданию.
    0x6690, // Ха-ха! Именно тот, кого мы ждали. Так ты наконец добрался, Хиттян! Молодец! Теперь время работать, работать, работать~!
    0x6764, // Миша и Сидзунэ устроили мне засаду в вестибюле первого этажа, и я угодил прямо в неё. Надо было просто обойти школу вокруг, как я вначале и планировал, но потом подумал, что это уже чересчур и вообще дурачество.
    0x68E1, // Миша подманивает меня, помахивая в мою сторону толстой стопкой распечаток.
    0x696B, // Нам как бы нужна твоя помощь~!
    0x69A1, // Как бы?
    0x69AE, // Нам нужна твоя помощь~!
    0x69D8, // …
    0x69DC, // Ты нам поможешь!
    0x69FA, // Миша произносит это в своей обычной игривой, беззаботной манере, но я всё равно слышу за ней убийственную суровость Сидзунэ.
    0x6ADE, // Звучит как приказ.
    0x6B00, // Правда~? Неужели?
    0x6B1F, // …
    0x6B23, // А? Да?
    0x6B2D, // А, прости, Хиттян, думаю, что это он и есть! Ха-ха-ха-ха!
    0x6B8E, // Не похоже, чтобы она раскаивалась.
    0x6BCD, // Я думала, что мы уже всё сделали, но оказалось, что все эти знаки надо прицепить к стендам.
    0x6C70, // …
    0x6C74, // Чем больше рук, тем легче труд!
    0x6CAC, // И все в выигрыше! Ха-ха-ха-ха-ха!
    0x6CE5, // …
    0x6CE9, // В конце концов, это твоя обязанность как члена Школьного совета. Частью которого ты являешься.
    0x6D96, // Как члена.
    0x6DA9, // Школьного совета.
    0x6DCA, // А-ха-ха-ха~!
    0x6DDE, // …
    0x6DE2, // Задача простая, так что справиться с ней прямо сейчас было бы здорово. Работы не так много. Совсем мелочь, правда!
    0x6EB0, // …
    0x6EB4, // И мы были бы очень рады твоей помощи!
    0x6EF7, // Очень, очень рады!
    0x6F18, // Кроме того, пора отплатить за то, что мы были так добры к тебе!
    0x6F88, // Так всё-таки чайный дом был ловушкой! Вот же ж плутовки!
    0x6FED, // …
    0x6FF1, // Не говори так, нет тут никакой связи. Мы хотели отпраздновать твоё вступление в Совет!
    0x708E, // Тогда зачем было об этом упоминать?
    0x70CF, // Но—{w=0.3}{nw}
    0x70E2, // …!
    0x70E7, // Никаких «но»! Ты идёшь с нами!
    0x711D, // Они даже не дают мне закончить предложение, тут же хватая меня за руки и пытаясь притащить к кабинету Совета.
    0x71E4, // Миша легкомысленно смеётся, когда они с Сидзунэ обмениваются у меня за спиной лукавыми взглядами.
    0x7298, // …!
    0x729D, // Не думаю, что у тебя есть выбор, Хиттян! Ха-ха-ха-ха!
    0x72F9, // Нас двое, так что даже не пытайся увильнуть! Воспринимай нас всерьёз!
    0x7377, // …!
    0x737C, // Хиттян, помогать нам – в любом случае твоя обязанность! Как члена Школьного совета!
    0x7415, // Ладно, ладно! Как я мог забыть?
    0x744C, // Но, серьёзно, разве больше нет никого, кто бы вам помог?
    0x74B0, // Кого например, Хиттян?
    0x74D9, // Вчера ты был не против нам помогать…
    0x751D, // Вчера – это не сегодня!
    0x7548, // И «другой» – кто-нибудь помимо меня!
    0x758B, // Почему у вас в Совете больше никого нет?
    0x75D4, // …!
    0x75D9, // Нам бы тоже хотелось это узнать! …А-ха… А-ха-ха-ха-ха-ха!
    0x763F, // Смех Миши сотрясает воздух в коридоре. Она совсем не замечает гримасы недовольства у меня на лице. Верно, их там всего двое, не так ли?
    0x7732, // Ох, ладно. Хорошо, я вам помогу.
    0x776A, // Миша проводит языком по зубам, явно довольная.
    0x77BF, // Вот это я понимаю, Хиттян! Я знала, что мы можем на тебя положиться~!
    0x7839, // …!
    0x783E, // Как предсказуемо~.
    0x7860, // Когда мы добираемся до кабинета, у меня отвисает челюсть. Количество знаков, стендов и столбов просто безумное.
    0x792C, // Они штабелями лежат по всей комнате, словно стройматериалы на площадке, о чём я сразу же сообщаю Мише и Сидзунэ.
    0x79F8, // Здесь столько столбов, что из них можно построить вторую стену вокруг школы!
    0x7A84, // Ха-ха-ха~! Правда? Ну, тут их много, так что, наверное…
    0x7AE4, // …!
    0x7AE9, // А? Нет?
    0x7AF5, // Откуда ты знаешь, Ситтян?
    0x7B23, // …!
    0x7B28, // Правда~?
    0x7B37, // Только не говори мне, что она считала?!
    0x7B7D, // Сидзунэ мешкает, а затем поправляет очки, а Миша издаёт натянутый смешок.
    0x7C03, // Значит, она считала.
    0x7C28, // …!
    0x7C2D, // А-ха-ха! Это… несущественно, Хиттян! Можешь, пожалуйста, уже приняться за знаки?
    0x7CBE, // Хорошо, хорошо.
    0x7CDA, // Кажется, меня обманули. Вы вроде сказали, что будет немного работы?
    0x7D54, // …!
    0x7D59, // А, ну, Ситтян имела в виду, что для нас – не так уж и много.
    0x7DC1, // …!
    0x7DC6, // Кто-то должен за тобой присматривать, понимаешь, чтобы ты не напортачил. И этими людьми будем мы.
    0x7E76, // Так что вы собираетесь делать?
    0x7EAE, // Наблюдать за тобой! Ха-ха-ха-ха!
    0x7EE7, // …!
    0x7EEC, // Нет, это была шутка, Хиттян. Конечно, мы тоже поможем. В Школьном совете на самом деле должно быть куда больше людей.
    0x7FBE, // Просто год не удался. Меньше людей, чем обычно, хотя в прошлом году было и того меньше.
    0x805A, // А сейчас ещё и работы гораздо больше, чем раньше.
    0x80B3, // …!
    0x80B8, // Кроме того, Ситтян нравится с тобой работать. И мне!
    0x8116, // Мы достигли куда большего, чем обычно.
    0x815C, // Это правда. В последнее время они казались всё более уставшими с каждым разом, как я их встречал.
    0x820C, // Работа в Школьном совете, видимо, занятие на двадцать четыре часа в сутки, и, судя по тому, что я слышал и видел, их только двое. Ну, полагаю, со мной – трое.
    0x8323, // Они наверняка работают почти без перерывов. Интересно, сколько времени они проводят за работой в этой комнате, пока я их не вижу?
    0x840E, // И я даже мельком видел, как Миша дремлет, когда Сидзунэ нет поблизости. А сама Сидзунэ вынуждена работать по шестьдесят часов в неделю, выполняя обязанности Совета, в дополнение к школьным урокам.
    0x8574, // Два часа спустя, потянувшись за очередной кнопкой, я обнаруживаю, что коробка пуста. Не успеваю я ничего сказать, как Сидзунэ хватает её.
    0x866D, // Она улыбается, ловко бросая её в урну к остальным коробкам из-под кнопок.
    0x86F2, // …!
    0x86F7, // У тебя тоже кончились, Хиттян? Не волнуйся, Ситтян говорит, что принесёт ещё.
    0x8782, // Ха-ха-ха-ха!
    0x8797, // Мы тоже потратили коробку, но решили с Ситтян подождать, пока тебе тоже понадобится, чтобы взять новую.
    0x8853, // Что-то в этом мне кажется странным.
    0x8893, // Стоп, у нас с вами кнопки кончились одновременно? Какое-то странное совпадение, не находите?
    0x893B, // Ну, вообще-то, Хиттян, у нас кончились ещё двадцать минут назад, а запасная коробка была только одна – та, которую мы дали тебе.
    0x8A21, // И у тебя они так и мелькали, поэтому~! мы подумали, что надо подождать, пока в обеих коробках кнопок не останется, прежде чем брать новые!
    0x8B18, // Тогда Ситтян смогла бы взять новенькие коробки для всех одновременно. Для эффективности, понимаешь~!
    0x8BD1, // Сидзунэ кивает, готовясь выйти за дверь.
    0x8C1B, // Постой-ка, а что вы делали последние двадцать минут?
    0x8C7A, // …!
    0x8C7F, // А-ха-ха~! Ничего, конечно же! Что нам было делать? У нас не было кнопок, Хиттян!
    0x8D0A, // Сидзунэ с Мишей обмениваются понимающими взглядами, прежде чем идеально синхронно и невероятно преувеличенно одновременно пожать плечами.
    0x8E0C, // Понятно. Решили устроить себе перерыв. Умно.
    0x8E5D, // …!
    0x8E62, // О да, мы знаем, что умно.
    0x8E8D, // Чья это была идея?
    0x8EAE, // Мы обе до неё додумались, конечно!
    0x8EEC, // А-ха-ха-ха~! Ну, Хиттян, это всё была идея Сидзунэ.
    0x8F44, // Я тут же оборачиваюсь к Сидзунэ, которая кратко машет мне и с удивительно бодрой улыбкой скрывается за дверью.
    0x900E, // Так почему бы вам было просто не сказать, что хотите сделать перерыв?!
    0x908D, // Я привык считать их полными противоположностями. Миша, похоже, всегда энергична и игрива, как любая другая девочка. Сидзунэ, с другой стороны, всегда кажется сдержанной. Агрессивный манипулятор, отчасти страшная, но сдержанная.
    0x922D, // Временами я думал, что у неё нет чувства юмора: будучи очень миловидной, она почти никогда не улыбалась, не говоря уже об остальном.
    0x931C, // Изучающий взгляд, вечно упрямое выражение лица и даже почерк – столь механически точный, что всё написанное ею выглядит как напечатанное.
    0x941A, // Но на самом деле Миша и Сидзунэ не настолько разные, как я думал.
    0x948F, // Я немного удивлён.
    0x94B1, // Чем?
    0x94B9, // Сидзунэ. Не знал, что она любит вот так подшучивать.
    0x9517, // Я имею в виду, что не знал, что она может вести себя так по-девчачьи. Это было в самом деле очень мило.
    0x95CD, // Тебе ещё многое неизвестно, Хиттян.
    0x960E, // Ну, когда я впервые вас увидел, даже не представлял, что вы столь близки.
    0x9691, // Мне всегда было интересно, как они познакомились.
    0x96EC, // Вы давно знакомы?
    0x970C, // Друзья детства?
    0x9729, // Соседи?
    0x9737, // Ха-ха… Извини, Хиттян, но ничего подобного, как бы того ни хотелось.
    0x97B2, // Когда я пришла в эту школу, меня просто посадили рядом с Ситтян, а она выглядела человеком очень серьёзным.
    0x9875, // И я подумала: «Возможно, мне придётся провести остаток года рядом с ней!»
    0x98FA, // «Поэтому было бы неплохо с ней подружиться! Но~, интересно, понравлюсь ли я ей?»
    0x998A, // И я узнала, что она глухая. Знаешь, Хиттян, в первый раз я подумала, что она меня просто игнорирует~!
    0x9A3D, // К счастью, я немного знала язык жестов, и мы подружились.
    0x9AA4, // Я хочу спросить, где Миша выучила язык жестов, но решаю оставить это для другого раза.
    0x9B40, // Теперь мы всегда вместе. Это хорошо, ведь я всегда хотела, чтобы меня было кому слушать, и, думаю, Ситтян нравится с кем-то разговаривать! Так что все в выигрыше.
    0x9C62, // Хе-хе. Это здорово.
    0x9C84, // И всё? Ты выглядишь разочарованным, Хиттян. А чего ты ожидал?
    0x9CF2, // А-ха-ха-ха-ха-ха!
    0x9D0F, // Знаешь, Хиттян, мне кажется, что мы с Ситтян не отблагодарили тебя как следует.
    0x9D9E, // За что?
    0x9DAB, // За вступление в Школьный совет. Ты нам сильно помог, Хиттян! Думаю, теперь я смогу намного дольше спать~!
    0x9E68, // Я рад, что смог помочь, если это позволит девушке высыпаться.
    0x9ED7, // Интересную вещь ты сказал, Хиттян.
    0x9F16, // Ситтян тоже очень ценит твою помощь.
    0x9F59, // В этот момент в комнату возвращается Сидзунэ, немного раздражённая, небрежно попивая сок из пакета.
    0xA010, // …
    0xA014, // Криво улыбаясь, она бросает на пол две коробки с кнопками.
    0xA07E, // …!
    0xA083, // А, Ситтян.
    0xA095, // Миша открывает рот, чтобы заговорить, но тут же его закрывает, когда Сидзунэ с треском, напоминающим звук ломающихся костей, внезапно сминает пакет из-под сока.
    0xA1B9, // …!
    0xA1BE, // …
    0xA1C2, // …!
    0xA1C7, // Я предполагаю, что каждый жёсткий и дрожащий жест, скорее всего, является ругательством.
    0xA269, // Что она говорит?
    0xA287, // Просто было очень сложно достать эти…
    0xA2CE, // …!
    0xA2D3, // Думаю, это преуменьшение, Ситтян…
    0xA312, // Сидзунэ немного успокаивается, поправляя очки и пальцем убирая чёлку с лица.
    0xA39F, // …
    0xA3A3, // На самом деле это не было такой уж проблемой? Это всё твоя предусмотрительность!
    0xA436, // Ну тогда ладно. Думаю, пора возвращаться к работе, Хиттян!
    0xA49F, // Конечно, почему бы и нет.
    0xA4CC, // К моменту, как мы расправляемся со знаками, снаружи уже начинает темнеть.
    0xA552, // Я не ожидал, что нечто подобное займёт так много времени. Однако, если б это было так просто, сомневаюсь, что Сидзунэ и Миша попросили бы у меня помощи.
    0xA663, // Сидзунэ плюхается на ближайший стул, начинает хрустеть пальцами и беззвучно зевает.
    0xA6FE, // …
    0xA702, // Думаю, на сегодня всё! Это хорошо, Ситтян, я тоже устала.
    0xA767, // Это заняло больше времени, чем я ожидал.
    0xA7B0, // …
    0xA7B4, // Ты согласна? Ха-ха-ха, мы тоже не ожидали, что будет так долго! Не по плану!
    0xA839, // Ой, я такая голодная. Только что поняла, что весь день не ела.
    0xA8A7, // Поразмыслив, я понимаю, что тоже ничего не ел с тех пор, как встал утром с кровати. Но сейчас я слишком устал, чтобы думать о еде.
    0xA98E, // Думаю, подавать обед уже закончили.
    0xA9CF, // Не может быть! Хиттян, ты знаешь хоть один способ, как бы мы могли… достать еды?
    0xAA5F, // Достать еды?
    0xAA76, // Мне не нравится, с какой интонацией она это произносит.
    0xAADB, // …
    0xAADF, // Почему бы не заказать с доставкой? А, точно, думаю, я это смогу.
    0xAB50, // Заказать? Откуда?
    0xAB70, // Из города, конечно!
    0xAB93, // Я не знал, что они привозят и к школе. А что ты будешь заказывать?
    0xAC08, // Может, китайскую еду?
    0xAC2F, // Раз ты собираешься, можно и мне присоединиться? Я тоже проголодался.
    0xACAC, // А-ха-ха-ха~! Хиттян, надо было так сразу и сказать!
    0xAD05, // …
    0xAD09, // Что? Ты угощаешь? Это здорово! Просто здорово!
    0xAD5C, // …
    0xAD60, // Ва-ха-ха, это правда – если бы не ты, мы бы тут не сидели допоздна, Ситтян!
    0xADE4, // Миша выхватывает меню из выдвижного ящика за спиной и начинает медленно и осторожно набирать номер, будто обычно она ошибается в наборе.
    0xAEDF, // Что ты будешь, Хиттян?
    0xAF07, // Пельмени, наверное.
    0xAF2B, // Я поднимаю руку в знаке признательности Сидзунэ, которая отвечает очень вялой, продлившейся лишь долю секунды, улыбкой.
    0xB007, // А-ха-ха-ха-ха-ха~! Хиттян, Ситтян за всё сегодня платит, так что можешь немного пошиковать!
    0xB0A9, // Тогда ещё варёного риса с креветками.
    0xB0EE, // Отлично, отлично! А ты, Ситтян?
    0xB125, // …
    0xB129, // Китайский омлет? Ну ладно.
    0xB159, // Эй, Миша, это действительно означает «омлет»? Можешь ещё раз показать?
    0xB1D9, // Конечно! Ха-ха! Вот так, вот так…
    0xB214, // А вот так произносится то, что заказал ты: пель-ме-ни!
    0xB274, // Рис с креветками!
    0xB294, // А я буду суп и овощи в масле, и это показывается вот такими жестами…
    0xB310, // И вот так показывается то, сколько всё это стоит: 3685 иен!
    0xB376, // Ва-ха-ха-ха-ха~!
    0xB391, // Не знаю даже, в какой ситуации мне может понадобиться запоминать такую точную цифру…
    0xB42E, // А-ха-ха-ха-ха! Ладно~! Тогда я сейчас закажу, если никто больше ничего не хочет. Нет возражений? Хорошо, тогда отлично!
    0xB501, // Пока мы ждём заказ, Сидзунэ нетерпеливо покручивает в руках палочки для еды.
    0xB58D, // Эй, где ты их взяла?
    0xB5B0, // Нам не впервой заказывать сюда еду, Хиттян, и они почему-то постоянно нам дают кучу палочек, хоть мы и говорим, что нас только двое.
    0xB69D, // И у вас накопилась их целая гора, пока вы ужинали заказываемой сюда едой долгими вечерами в кабинете?
    0xB756, // Именно так! Ха-ха-ха-ха-ха-ха!
    0xB78A, // …
    0xB78E, // Я преувеличиваю?
    0xB7AD, // …
    0xB7B1, // Ха-ха! Вот именно, Ситтян! Эй, Хиттян, ты знал, что когда мы соберём сотню пар палочек от заказанных обедов, то сможем захватить Вселенную?
    0xB8AA, // Я тоже так думал, когда был маленький.
    0xB8EF, // Хиттян, ты хорошо умеешь их разламывать? У меня не получалось правильно, поэтому я нашла груду палочек, которые сохранила Ситтян, и попрактиковалась на как минимум двадцати из них.
    0xBA38, // Она не на шутку разозлилась!
    0xBA6C, // …!
    0xBA71, // Я покатываюсь со смеху, а Сидзунэ краснеет от негодования. Не знал, что у неё есть такая детская черта.
    0xBB2B, // Когда привозят еду, я с воодушевлением принимаюсь за неё, прихлёбывая из маленькой банки с газировкой, которую Сидзунэ принесла из торгового автомата в коридоре.
    0xBC54, // Поблагодарив их, я направляюсь к общежитиям, собираясь сразу лечь спать.
    0xBCD9, // В общежитии стоит жутковатая тишина, не считая звуков портативных телевизоров и радио, невнятно бормочущих из-за тонких стен.
    0xBDC0, // Здесь по ночам спокойно и очень мирно. Слышно, как за окном стрекочут сверчки. А взглянув на небо, я вижу, что там ярко светят звёзды.
    0xBEB0, // Уставший, я пытаюсь заснуть как можно быстрее, лишь слабо негодуя из-за того, что меня лишили субботы.
};

#endif // KS_A1_SATURDAY_SHANGHAIED_RU_TL_INDEX