#ifndef KS_A1_FRIDAY_SLOW_RECOVERY_RU_TL_INDEX
#define KS_A1_FRIDAY_SLOW_RECOVERY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_C8FC0CC9_ru_intl[] = {
    0x0000, // Когда я иду к своему месту, за мной продолжают пристально следить только двое.
    0x008F, // Я усаживаюсь на своё место, но не проходит и пятнадцати секунд, как в меня через рубашку впивается ноготь Миши, что меня нисколько не удивляет.
    0x0193, // Пс-с! Где ты был?
    0x01B0, // Не твоё дело.
    0x01C8, // Я знаю, что это худший ответ, годный только на то, чтобы сильнее возбудить их любопытство, но у меня нет сил придумывать замысловатые истории.
    0x02CA, // Как ни странно, Миша отстаёт. Сегодня она сдаётся удивительно быстро.
    0x0349, // …
    0x034D, // Через минуту она снова тыкает в меня пальцем.
    0x03A0, // Ну давай, расскажи! Ситтян тоже очень интересно!
    0x03F8, // Ага, как же, сдаётся она. Размечтался. Она просто обсуждала с Сидзунэ наиболее верный способ, как меня расколоть.
    0x04C5, // Нет.
    0x04CD, // Она снова отступает для переговоров.
    0x0511, // Как член Школьного совета, ты обязан нам рассказать, почему пропускаешь уроки! Особенно если это что-нибудь очень-очень весёлое~!
    0x05FD, // Да, я очень-очень повеселился в медкабинете.
    0x064E, // Я не хочу об этом говорить, ясно?
};

#endif // KS_A1_FRIDAY_SLOW_RECOVERY_RU_TL_INDEX