#ifndef KS_A1_WEDNESDAY_IT_BUILDS_CHARACTER_RU_TL_INDEX
#define KS_A1_WEDNESDAY_IT_BUILDS_CHARACTER_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_A86EB284_ru_intl[] = {
    0x0000, // Вопреки моему первому впечатлению, Муто оказался неплохим учителем: ему удаётся интересно подать материал.
    0x00C6, // Однако методика преподавания у него всё же странная. Он как будто считает, что все мы гении от рождения.
    0x0183, // С последним звонком я понимаю, что до конца дня мне абсолютно нечем заняться.
    0x0210, // Странно: в больнице у меня целые дни были свободными, но в этой школе задача по заполнению значительно меньшего количества времени кажется более трудной.
    0x032A, // Все остальные ученики покидают класс, оставляя меня наедине с учителем.
    0x03AE, // Муто проверяет листки с заданиями, над которыми мы сегодня работали, и делает в них пометки красной ручкой.
    0x0472, // На секунду оторвав взгляд от бумаг, он замечает меня и морщит лоб.
    0x04EA, // Ты что-то хотел, Накай?
    0x0513, // Я вздрагиваю от неожиданного обращения ко мне. Но, наверное, это естественно, что у нас завязалась беседа, ведь больше в классе никого нет.
    0x060F, // Эм-м… ничего. Я думал, чем бы заняться после школы.
    0x066B, // Учитель закрывает ручку колпачком и ровняет стопку бумаг, дважды стуча ей по столу.
    0x0704, // В этот момент своей педантичностью он напоминает мне Сидзунэ. Впрочем, его неторопливость и расслабленность сразу же стирают это впечатление.
    0x080A, // И что надумал?
    0x0824, // Я хочу вступить в кружок, но пока не решил в какой.
    0x087F, // Походи на собрания разных кружков – может, что и понравится.
    0x08EE, // Пожалуй…
    0x0900, // Но я…
    0x090B, // Я не знаю, стоит ли спрашивать об этом.
    0x0951, // А от пристального взгляда Муто желание говорить и вовсе пропадает.
    0x09CC, // Но рано или поздно мне всё равно придётся коснуться этой темы.
    0x0A3E, // Я не знаю, как вести себя с людьми… то есть с остальными учениками в этой школе.
    0x0ACF, // Я с ними общаюсь и всё такое, так что не подумайте, что я от них закрываюсь.
    0x0B56, // Просто не могу взять в толк, как мне относиться к их инвалидности? Совсем не обращать на это внимания было бы невежливо, а игнорировать – как-то странно.
    0x0C6C, // В обоих случаях получится, что я веду себя неправильно.
    0x0CD1, // Учитель рассеянно чешет щёку.
    0x0D08, // Не стоит делать из этого проблему, вот и всё. Она существует лишь у тебя в голове.
    0x0D9B, // Ведь ты можешь нормально говорить с человеком независимо от того, слеп он или нет.
    0x0E31, // Прекрати постоянно думать об инвалидности собеседника. Все здешние ученики – обычные дети, что бы тебе ни казалось на первый взгляд.
    0x0F25, // Вчера Юко говорила мне то же самое.
    0x0F65, // Конечно, они правы, но не думать об этом слишком тяжело. Как можно игнорировать, например, глухоту Сидзунэ, если общаться с ней возможно только через Мишу?
    0x107E, // Или Ханако… как посмотреть ей в лицо, не обратив внимания на шрамы?
    0x10F9, // Но…
    0x1101, // Меня прерывает грохот распахнувшейся двери.
    0x1153, // Учитель~!
    0x1164, // Миша вламывается в кабинет, вскинув руку в бойком приветствии; её оглушительный возглас мог бы поднять мёртвых из могил.
    0x1241, // Она марширует к учительскому столу, размахивая руками в такт шагам.
    0x12BD, // Муто, оторопевший от громозвучного Мишиного вторжения, откидывается на спинку стула.
    0x135A, // Микадо.
    0x1368, // Миша замирает, оглядываясь по сторонам: она явно не понимает, чем вызван его сердитый тон.
    0x140C, // Да~?
    0x1413, // Я уже неоднократно просил тебя убавить громкость.
    0x146F, // Да~!
    0x1476, // Ответ её не менее громогласный, нежели приветствие; Муто сдаётся и устало потирает глаза.
    0x151A, // Ну, так что ты хотела?
    0x1541, // Мне… нам нужна помощь! У нас кончились материалы для фестивальных стендов!
    0x15CB, // Это беда!
    0x15DC, // Она размахивает розовой полоской бумаги.
    0x1628, // Ну так… принесите ещё из кабинета рисования. В чём проблема?
    0x1697, // Фанера! Вся проблема в фанере! В прошлый раз, когда нам понадобилось больше, её запасы там уже подходили к концу и мы просто взяли всю оставшуюся. Нам вроде бы хватило.
    0x17C6, // А теперь её там совсем не осталось. Вы случайно не знаете, где есть ещё?
    0x1847, // Нет. Случайно не знаю.
    0x186F, // Ситтян… то есть президент, сказала, что учитель сможет помочь. Она ошиблась?
    0x18FB, // Миша не замечает, что у Муто крайне страдальческий вид: будто он морщится всем своим существом.
    0x19A9, // На Муто больно смотреть. Словно ему сверлят череп, при этом включив на полную громкость поп-музыку.
    0x1A5E, // Увы, я не в курсе, есть ли в школе фанера вообще. И я понятия не имею, где она может лежать.
    0x1AFF, // Ох-ох-о-о… что же мне делать?
    0x1B33, // Попробуй разыскать господина Номию: он должен знать.
    0x1B94, // Он, правда, скорее умрёт, чем расстанется с ней… но это уже отдельный вопрос.
    0x1C20, // А-а-а! Но я спешу! Мы слишком заняты!
    0x1C60, // Она хватается за голову и в отчаянии мечется взглядом из стороны в сторону, даже не замечая, что мнёт записку у себя в руках.
    0x1D42, // У меня даже нет времени искать всё это! Мы выбиваемся из графика, у нас и так полно работы!
    0x1DE5, // Муто пристально смотрит на неё и вдруг улыбается. Лучше бы он этого не делал: улыбка ему совершенно не к лицу.
    0x1EAC, // Может, вам найти временного помощника?
    0x1EF3, // Он переводит на меня сосредоточенный взгляд, как бы говоря: «Ну же, ступай, заведи друзей».
    0x1F98, // …
    0x1F9C, // Э… Думаю, я мог бы вам помочь.
    0x1FD2, // Правда? Спасибо, Хиттян, ты такой милый!
    0x201A, // Она вдруг озадаченно замирает, глядя так, будто только что заметила моё присутствие, и даже удивлённо вскрикивает, указывая на меня пальцем.
    0x211B, // А что Хиттян делает здесь в такое время? Ведь уроки кончились, пора гулять и веселиться~!
    0x21BC, // У нас был небольшой разговор.
    0x21F2, // Только не это! Тебя оставили после уроков? У тебя неприятности, Хиттян?
    0x2273, // Нет, у меня всё в порядке.
    0x22A1, // Учитель, у Хиттяна неприятности?
    0x22DD, // Ничего подобного.
    0x22FE, // Муто тяжело вздыхает, и я понимаю, что сейчас самое время избавить его от назойливой Миши.
    0x23A2, // Итак, что вам нужно?
    0x23C6, // Вот список. Если в кабинете рисования нет фанеры, я попробую поискать где-нибудь ещё.
    0x2461, // Я неуверенно беру протянутую записку.
    0x24A7, // Я помогу вам, но это не значит, что я готов вступить в Совет, ясно?
    0x251D, // Ясно…
    0x2529, // Всё равно спасибо, Хиттян. Только побыстрей: мы строим киоски прямо сейчас – надо спешить-спешить-спешить!
    0x25EC, // Она вылетает за дверь, а мы с учителем смотрим друг на друга в молчаливом согласии.
    0x2683, // Радуйся, Накай, теперь тебе есть чем заняться.
    0x26D7, // Пожалуйста, не так самодовольно.
    0x2713, // Мелким, аккуратным почерком, принадлежащим, без сомнения, Сидзунэ, на смятом листке написан перечень необходимых для фестиваля материалов, от краски до фанеры. Я тяжело вздыхаю.
    0x2858, // Тогда я пойду.
    0x2872, // Я машу списком учителю и выхожу в коридор.
};

#endif // KS_A1_WEDNESDAY_IT_BUILDS_CHARACTER_RU_TL_INDEX