#ifndef KS_A1_THURSDAY_RU_TL_INDEX
#define KS_A1_THURSDAY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_BE97EA70_ru_intl[] = {
    0x0000, // Вспомнив ворчание фельдшера, я ставлю будильник пораньше, чтобы успеть на пробежку.
    0x009A, // Я дал обещание и собираюсь его сдержать. К тому же Эми придётся на меня наябедничать, если я не появлюсь.
    0x0158, // Но всё не так уж плохо.
    0x0181, // Я чувствую себя настолько уставшим, что ставлю будильник на такое позднее время, на какое только могу себе позволить, чтобы не опоздать на первый урок.
    0x0295, // Я вспоминаю голос фельдшера, нудящего об утренних пробежках. Компенсирую их, пожалуй, прогулкой завтра после школы.
    0x0369, // Эми, небось, в любом случае будет всё равно.
};

#endif // KS_A1_THURSDAY_RU_TL_INDEX