#ifndef KS_A1_WEDNESDAY_WAYLAY_RU_TL_INDEX
#define KS_A1_WEDNESDAY_WAYLAY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_4FFB1FF4_ru_intl[] = {
    0x0000, // Что она слышала?
    0x001E, // Я вздрагиваю от неожиданного появления Миши, чьего приближения я не услышал, несмотря на тишину, царившую в коридоре.
    0x00F5, // Каким-то образом она подобралась ко мне на расстояние прыжка, не издав ни звука. У меня от этого мурашки по коже бегут. На мгновение я вспоминаю про сумасбродную теорию Кендзи о всемирном тайном обществе феминисток, но тут же отбрасываю эту мысль подальше.
    0x02C8, // Сидзунэ, стоящая чуть поодаль от Миши, выглядит озадаченной, поскольку не могла услышать замечания, привлёкшего внимание Миши, но Миша явно возбуждена.
    0x03DE, // Нет, постой, а кто там? Сегодня в кружке нет занятий.
    0x043C, // Она пытается с любопытством выглянуть из-за меня, несмотря на то что закрытая дверь всё равно не даст ей ничего увидеть.
    0x0517, // Что вы здесь делаете?
    0x053E, // Тебя так долго не было, что нам пришлось прийти и проверить, что стряслось. Нехорошо, Хиттян~
    0x05E6, // Она грозит мне пальцем.
    0x0611, // Я нашла фанеру, но остального до сих пор не хватает, потому что ты – копуша.
    0x069A, // А, прости. Э… я всё нашёл, как раз собирался принести.
    0x06FB, // Думаю, ты нас малость подвёл, Хиттян~! Интересно, кто это там с тобой был…
    0x0780, // Миша что-то быстро говорит Сидзунэ, пару раз указав на своё ухо.
    0x07F4, // Сидзунэ тут же протискивается мимо меня к двери и открывает её.
    0x0868, // Могу только представить тот шок, который она сейчас испытает.
    0x08D9, // С её трудолюбием и жизненными принципами ей не под силу вынести дерзость, с которой некто осмелился надругаться над школьным имуществом, используя его в качестве поверхности для сна.
    0x0A29, // И действительно, она смотрит на Рин, застыв на месте, и только её плечи едва заметно дрожат, как мне кажется из-за подавляемой ярости.
    0x0B1B, // Вместо того чтобы взорваться, Сидзунэ, сделав несколько глубоких вдохов, поправив очки и с шумом захлопнув дверь, принимается неистово жестикулировать Мише.
    0x0C3C, // Может быть, она и взорвалась, только я этого не понял.
    0x0C9D, // На меня она тоже бросает тяжёлый взгляд, как будто я был каким-то образом виноват в том, что Рин спит на одном из столов.
    0x0D76, // Надеюсь, у неё не возникло никаких сомнительных идей насчёт причин моей задержки.
    0x0E0C, // Эй.
    0x0E12, // Голос Рин доносится из-за закрытой двери, и через пару мгновений я понимаю, что для неё может быть проблематично открыть её.
    0x0EF4, // Я открываю дверь. Рин стоит в проходе и полузаинтересованно-полусонно глядит на нас.
    0x0F8F, // Привет.
    0x0F9D, // …
    0x0FA1, // Мисс Тэдзука, что это вы вытворяете? У вас нет абсолютно никакого права использовать школьное имущество для таких… э… постыдных?.. занятий!
    0x10A1, // Как внезапно народу-то прибыло. Не знала, что я так популярна.
    0x1111, // Сложно сказать, довольна она таким поворотом событий или нет.
    0x1182, // Во всяком случае, она игнорирует выговор Сидзунэ/Миши, так что им ничего не остаётся, кроме как оставить эту тему.
    0x1251, // Сидзунэ стучит Мишу по плечу, указывает на Рин и делает несколько быстрых жестов.
    0x12E6, // …
    0x12EA, // Неважно, насколько вы популярны, пожалуйста, больше так не делайте.
    0x1365, // …
    0x1369, // Кстати, как продвигается ваш проект? К фестивалю всё будет готово?
    0x13E2, // Невзирая на давление, оказываемое ледяным взглядом Сидзунэ, Рин смотрит на них вполне непринуждённо и вообще безучастно.
    0x14C1, // Я тоже постоянно об этом размышляю.
    0x1502, // …
    0x1506, // И?
    0x150A, // Задумаюсь над этим серьёзнее.
    0x1541, // Когда Сидзунэ получает ответ Рин от Миши, она неудовлетворённо хмурится.
    0x15C7, // …
    0x15CB, // Мисс Тэдзука, пожалуйста, попытайтесь подойти к этому ответственнее. Будет катастрофой, если стена будет выглядеть так, будто кого-то стошнило на неё обедом.
    0x16EB, // Рин утвердительно кивает.
    0x171B, // Обязательно задумаюсь серьёзнее.
    0x1759, // Миша в ответ хихикает, но на лице Сидзунэ не появляется и намёка на улыбку даже после перевода.
    0x1806, // Она только качает головой, забирает у меня материалы и в сопровождении Миши уходит.
    0x189F, // Рин задумчиво хмурится, наблюдая за удаляющимся дуэтом Школьного совета.
    0x1926, // Как грубо.
    0x1939, // Однако это правда. Мне надо закончить проект до выходных. Если не закончу, последствия будут печальными.
    0x19F8, // Конец того мира, который мы знаем.{w} Как конец недели, только ещё печальнее.
    0x1A81, // Гора-аздо печальнее.
    0x1AA7, // Наверное, отложу свой сон. На необозримое будущее.
    0x1B03, // Я уже собираюсь спросить, над каким проектом она работает и что за апокалиптические последствия, но она уходит обратно в кабинет.
    0x1BF0, // Не мог бы ты мне помочь, раз ничем не занят?
    0x1C3E, // Банка с краской не влезает в мою сумку, но она мне нужна.
    0x1CA4, // Она легонько пинает огромную банку краски, стоящую на полу рядом со столом, на котором она сидела и спала.
    0x1D65, // Та в ответ издаёт глухой звон.
    0x1D9C, // Будучи джентльменом, я, естественно, поднимаю её.
    0x1DF6, // Тяжёлая.
    0x1E06, // Да, конечно. Куда её нужно отнести?
    0x1E45, // В другое место.
    0x1E61, // С этими словами она выходит в коридор, и мы с банкой следуем за ней, поскольку особого выбора у нас нет.
    0x1F1C, // Теперь, когда Сидзунэ и Миша ушли, коридор тих и пуст, и мы тоже направляемся к лестнице на другом его конце.
    0x1FE0, // Каждые десять, или пятнадцать, или двадцать шагов мне приходится перекладывать банку из одной руки в другую, потому что её тонкая ручка врезается мне в ладонь. Ну, хоть руки благодаря этому меньше устают.
    0x2154, // Рин идёт передо мной неровной походкой, под которую трудно подстроиться, или, может быть, это я иду странно из-за лишнего веса.
    0x223A, // Кажется, что кто-то из нас постоянно идёт то ли слишком медленно, то ли слишком быстро, и я не могу понять, кто именно.
    0x230E, // Через два лестничных пролёта появляется проблема в виде фельдшера с его лисьей ухмылкой.
    0x23B2, // О, Накай, какое совпадение! И Тэдзука, конечно.
    0x2406, // Он любезно кивает Рин, которая не отвечает на его приветствие, и поворачивается ко мне, потому что явно хочет поговорить именно со мной.
    0x24FE, // Я кое-что забыл упомянуть в понедельник.
    0x2548, // Я киваю и невозмутимо жду, потому что мне и в голову не приходит, чего бы он мог там забыть. Однако врезающаяся всё глубже в кожу ручка также не добавляет мне энтузиазма.
    0x267B, // Насчёт твоих лекарств. Поскольку ты перешёл на них не так давно, могут быть неожиданные побочные эффекты, в зависимости от которых нужно будет подкорректировать дозы или даже сменить лекарство.
    0x27DF, // Я буду регулярно брать у тебя анализы, но хочу, чтобы ты сообщал мне об отклонениях в своём состоянии, – если ты понимаешь, о чём я.
    0x28CC, // Тошнота, головная боль – что угодно. Приходи на приём, если что-нибудь случится.
    0x295E, // Хорошо.
    0x296C, // Так как дела? Всё в порядке?
    0x299E, // Я сдаюсь и опускаю банку на пол, прежде чем ответить. Видимо, это займёт больше времени, чем могут выдержать мои бицепсы.
    0x2A79, // Я собираюсь ответить общей фразой, но осознаю, как часто я это делал в последнее время.
    0x2B17, // Другие люди у меня тоже об этом спрашивали. Учителя и ученики. Мои родители, посетители, медсёстры и врачи в больнице.
    0x2BED, // Все кажутся обеспокоенными этим вопросом. Это естественно для больницы, но для школы – не очень.{w} Но эта школа – исключение.
    0x2CD2, // Она невелика, и отношения между учениками и преподавателями здесь очень близкие.
    0x2D67, // Во всяком случае такое у меня чувство.
    0x2DAD, // И в такую школу ученики переводятся нечасто.
    0x2DFF, // От этой мысли у меня бегут по спине мурашки, но я всё равно даю стандартный ответ.
    0x2E93, // …
    0x2E97, // Это замечательно. И ещё кое-что.
    0x2ED1, // Мои источники сообщили, что ты не был ни на школьном стадионе, ни в бассейне, так что хочу поинтересоваться: выполняешь ли ты упражнения, которые я рекомендовал?
    0x2FF6, // Конечно нет, но такая постановка вопроса вызывает ощущение, что я должен был с самого первого дня прямо-таки надрываться на беговых дорожках.
    0x30F9, // У вас есть люди, которые шпионят за мной?
    0x3143, // Не совсем. Просто я со многими знаком. Но у нас другая тема разговора, не пытайся от неё увильнуть.
    0x31F5, // Ну, я вот как раз выполнял импровизированные упражнения – подъём тяжестей.
    0x327F, // Я несколько раз поднимаю и опускаю банку, изображая жалкую пародию на культуриста, хоть ручка и врезается болезненно мне в ладонь.
    0x336E, // Глупая ухмылка на секунду исчезает с его лица, а потом, как ни в чём не бывало, возвращается на место.
    0x3425, // Тэдзука, позволь, мы с ним наедине поговорим?
    0x3477, // Фельдшер хватает меня за плечо и, не дожидаясь разрешения Рин, в котором он и не нуждается, тащит меня в сторону.
    0x3543, // Когда я говорил тебе про упражнения, я не шутил.
    0x359A, // Я понимаю, что это только твоя первая неделя, но, пожалуйста, не умаляй их значимости.
    0x3635, // Привычки трудно сформировать, поэтому я так настойчиво этого от тебя требую.
    0x36C2, // Чем больше ты будешь увиливать и откладывать, тем труднее потом придётся. И так со всем, например с диетой.
    0x3784, // Он окидывает меня изучающим взглядом, а затем пожимает плечами, снова улыбаясь.
    0x3816, // Хорошо. Вот так-то лучше.
    0x3843, // Если ты завтра с утра придёшь на стадион, то встретишься с моим «шпионом», который наверняка не откажет тебе в консультации, если ты захочешь немного побегать.
    0x3966, // Консультации?
    0x3980, // Ещё увидимся.
    0x3999, // Он уходит без ответа, помахав рукой, а я подхожу к Рин, которая ждёт, праздно оперевшись о стену коридора и разглядывая тусклые светильники на потолке.
    0x3AAC, // Даже когда я подхожу, она не отводит от них взгляда.
    0x3B0A, // Ты принимаешь лекарства от своей сердечной болячки?
    0x3B6A, // Ты подслушивала?
    0x3B89, // Мой тон более обвиняющий, чем я планировал, будто я на неё ругаюсь.
    0x3C02, // Но, даже пускай и так, я не хочу об этом говорить. Я только что её встретил и не знаю её. Это не её дело.
    0x3CB9, // Фельдшер, похоже, тоже не знаком с понятием врачебной тайны, раз говорит о таких вещах на людях.
    0x3D67, // Но Рин ведь в этом не виновата.
    0x3D9F, // Я гляжу на неё, внезапно почувствовав укол вины, но Рин лишь задумчиво смотрит куда-то через моё плечо, по-птичьи наклонив голову.
    0x3E8B, // Эх.
    0x3E91, // Не знаю, почему для меня это так сложно. Такое чувство, что у меня в голове есть какой-то непонятный сдерживающий механизм, который не позволяет мне говорить об этом более откровенно.
    0x3FDE, // …Да. Они для моего сердца.
    0x400E, // Тебе от них лучше?
    0x402F, // …Нет, не особо.
    0x404B, // Просто чуть менее плохо.
    0x4078, // Рин смотрит на меня ещё немного, ничего не говоря и без каких-либо различимых эмоций.
    0x4113, // Я благодарен ей за это. Кажется, я ещё не вполне привык к переменам в моей жизни.
    0x41A4, // В больнице с этим было проще, но я ещё не разобрался, как жить «нормальной» жизнью со своим недугом.
    0x4259, // Можешь пообещать мне впредь относиться к этому серьёзнее?
    0x42C4, // Да.
    0x42CA, // Может быть.
};

#endif // KS_A1_WEDNESDAY_WAYLAY_RU_TL_INDEX