#ifndef KS_STRANGER_UNION_RU_TL_INDEX
#define KS_STRANGER_UNION_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_7EE6E73F_ru_intl[] = {
    0x0000, // Он начинает теребить пальцами шарф, всё быстрее и быстрее, будто пытается добыть огонь, затем постепенно успокаивается, пока не проходит приступ паники.
    0x0118, // Мне придётся найти надёжное укрытие, чтобы спрятаться. А потом завалюсь спать, чтобы этот жуткий день обошёл меня стороной.
    0x01FA, // У меня для этого есть отличное средство. Пора готовиться.
    0x0263, // Не ходи на фестиваль.
    0x028A, // Хорошо.
    0x0298, // Увидимся, чувак.
    0x02B6, // Дверь с низким скрипом закрывается, и я даже не знаю, что и думать о словах Кендзи.
};

#endif // KS_STRANGER_UNION_RU_TL_INDEX