#ifndef KS_CHOICE_NOT_MUCH_TALKING_RU_TL_INDEX
#define KS_CHOICE_NOT_MUCH_TALKING_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EEACE0F5_ru_intl[] = {
    0x0000, // Я… я в порядке.
    0x001C, // Беспокоиться не о чем, просто холм слишком крутой, вам так не кажется?
    0x009B, // И вообще, мне непонятно, зачем строить школу так высоко? У нас ведь учатся инвалиды-колясочники и прочие.
    0x015A, // Да, действительно.
    0x017C, // Лилли беспокойно хмурит лоб, но мне бы не хотелось, чтобы у неё из-за меня появлялось такое выражение лица. Мы друг друга едва знаем.
    0x026C, // Вот-вот, я о том же! Не то чтобы, конечно, таких мест было много, но всё равно неясно, о чём они думали.
    0x0321, // Мой голос звучит чересчур спокойно, даже мне его слышать странно, к тому же я тараторю. Меня посещает мысль о том, что Лилли, наверное, многое может понять по одному только голосу.
    0x0466, // М-м-м…
    0x0472, // Пойдём, мы уже почти пришли.
    0x04A5, // Остаток пути до школы проходит в молчании.
};

#endif // KS_CHOICE_NOT_MUCH_TALKING_RU_TL_INDEX