#ifndef KS_A1C14O2_RU_TL_INDEX
#define KS_A1C14O2_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EB6770A0_ru_intl[] = {
    0x0000, // Думаю, мне интересен кружок рисования.
    0x0047, // Ненароком произношу я.
    0x0071, // Что ты имеешь в виду?
    0x0097, // Ничего… конкретного.
    0x00BF, // Могу ли я как-нибудь к вам прийти? Хотя бы просто чтобы посмотреть.
    0x0138, // Я думал о вступлении в какой-нибудь кружок, и вот…
    0x0194, // Я, конечно, ещё не обдумал всё как следует, но всю последнюю неделю во мне действительно росло смутное ощущение решительности.
    0x027B, // Я хочу что-нибудь делать. Хочу быть частью чего-нибудь.
    0x02DF, // Это вполне может быть и кружок рисования, несмотря на отсутствие у меня особого таланта.
    0x0381, // Учитель кажется довольным.
    0x03B3, // Да? Хочешь вступить? Ну, мы, конечно, всегда рады новым лицам.
    0x0421, // Занятия в кружке вполне обычны. Мы изучаем различные аспекты изобразительного искусства и пробуем что-нибудь создать собственными руками.
    0x0521, // Или ногами.
    0x0536, // Он смущённо покашливает, но Рин не обращает на это ни малейшего внимания. Немного легче оттого, что не у одного меня проблемы с подбором слов в этой школе.
    0x064F, // Номия оправляется от своего промаха, бросая театральный взгляд на карманные часы и ещё более театрально хлопая себя по лбу.
    0x0732, // Мне уже пора бежать, но, если у тебя есть вопросы, уверен, Тедзука всё разъяснит.
    0x07C3, // Упоминание Рин в одном предложении со словом «разъяснять» кажется не очень уместным. Однако я не говорю этого учителю, который, кажется, сильно спешит.
    0x08D8, // Тедзука, я доволен, что этот небольшой проект так хорошо продвигается.
    0x0959, // Я только заскочил напомнить, чтобы ты завтра никуда не убегала. Я пригласил для тебя на фестиваль кое-каких людей, и уверен, что они будут рады с тобой встретиться.
    0x0A82, // Увидимся в понедельник, Накай.
    0x0ABA, // Учитель уходит, и мы снова остаёмся одни. Рин продолжает рисовать, будто не случилось ничего примечательного. Поскольку так и есть, я продолжаю размышлять, что же со мной не так.
    0x0BFD, // Мы с искусством не были слишком близки в прошлом, по крайней мере судя по оценкам, которые я получал в средней школе.
    0x0CD1, // Может, занятия в кружке будут отличаться от обычных уроков? Кто знает…
    0x0D53, // Я пытаюсь придумать для Рин какой-нибудь осмысленный вопрос, но тщетно.
    0x0DD6, // Просто схожу на занятие кружка и посмотрю, что там да как.
    0x0E3F, // Значит, он пригласил назавтра людей, только чтобы они посмотрели на твою картину?
    0x0ED4, // У него среди друзей много людей искусства. Они любят говорить об искусстве.
    0x0F5E, // Думаю, он хочет, чтобы я поговорила с ними об искусстве.
    0x0FC3, // У меня почему-то складывается чувство, что ты не слишком этому рада.
    0x103F, // Рин неопределённо пожимает плечами, но всё равно создаётся впечатление, что ей неприятна идея обсуждения её или чьей-либо ещё картины с кем бы то ни было.
    0x1158, // Я на самом деле не люблю говорить об искусстве. Оно само по себе – способ общения, не требующий слов, так зачем ещё о нём говорить?
    0x1244, // Понимаю.
    0x1254, // Это всё равно что скучать и из скуки говорить о том, что тебе скучно.
    0x12D0, // А теперь не понимаю.
    0x12F5, // Ты когда-нибудь говорил о том, что тебе скучно? Это бессмысленно и не слишком захватывающе. Всё, что ты действительно можешь об этом сказать, – это: «Мне так скучно». Я однажды целую неделю пыталась сочинить какую-нибудь осмысленную речь на тему скуки.
    0x14BF, // Это была самая скучная неделя в моей жизни.
    0x150E, // Но это вполне закономерно, ты не находишь?
    0x155B, // Рин одаряет меня кратким взглядом, таким, который, кажется, ничего не выражает, но на самом деле кое-что значит.
    0x1625, // В общем… Не знаю, я думаю, что редко могу подобрать какие-то слова об искусстве.
    0x16B6, // То есть, например, вот то, что ты сейчас делаешь. Я понятия не имею, что об этом думать, кроме того, что «выглядит здорово». О чём эта картина?
    0x17B3, // Ни о чём.
    0x17C3, // …
    0x17C7, // Так бы мне хотелось сказать. Вот я так и сказала.
    0x181F, // Но я немного приврала. И сказала это, потому что хотела бы, чтобы это было правдой.
    0x18B4, // Учитель хотел, чтобы я её нарисовала, но у меня не было идей. Я попыталась родить какую-нибудь идею, но ничего не вышло.
    0x198B, // И теперь это картина без идей.
    0x19C2, // Но… что тогда ты рисуешь?
    0x19F1, // Без понятия.
    0x1A08, // Кстати, я могу её назвать «Без понятия».
    0x1A51, // О, вот опять я начала думать. Это плохо.
    0x1A98, // Она энергично трясёт головой, чтобы вытряхнуть из неё «думание». При этом её светло-каштановые волосы развеваются в разные стороны.
    0x1B8A, // Поэтому я и попросила Эми помочь мне. С ней легко ни о чём не думать.
    0x1C05, // Знаешь, она просто говорит, говорит, говорит ни о чём часами. У неё голова будто набита мыльными пузырями.
    0x1CC5, // Ты тоже на неё похож, но не очень. Если ты останешься, то очень поможешь.
    0x1D47, // Я не уверен, комплимент это или нет. Возможно, ни то ни другое, учитывая, насколько Рин ко всему безразлична.
    0x1E0B, // Ты хочешь, чтобы я делал что-то конкретное, чтобы помочь тебе не думать?
    0x1E8D, // Просто будь.
    0x1EA4, // Так, не зная, что делать, я просто сажусь на пустую коробку и, лениво полистывая страницы книги о распитии пива, продолжаю смотреть на то, как она рисует.
    0x1FB9, // У Рин безмятежное выражение лица, а за тёмными глазами таятся какие-то мысли. Нет, стоп, она ведь ни о чём не думает, верно?
    0x2096, // Она спокойно напевает мелодию, то и дело прерываясь на вежливую просьбу намешать ещё краски или подать другую кисть.
    0x216C, // Она поразительно сосредоточена, несмотря на недосып и требования поскорее закончить работу.
    0x2217, // Картина сантиметр за сантиметром приобретает форму, деталей становится всё больше, цвета сплетаются друг с другом, заполняя пробелы, наползая один поверх другого.
    0x2343, // Я снова задумываюсь о том, что вдохновляет и мотивирует людей творить.
    0x23C4, // Откуда берутся идеи? Они не приходят из ниоткуда, и не думаю, что есть какие-то музы, чудесным образом впрыскивающие вдохновение прямо в голову.
    0x24CA, // У идей есть источник и назначение.
    0x2509, // Чем больше я об этом думаю, тем больше убеждаюсь в том, что Рин соврала насчёт фрески или по меньшей мере исказила правду. Возможно, сама того не осознавая.
    0x2623, // Невозможно сотворить что-то, не имея представления о конечном результате. Это пойдёт вразрез с самим понятием творчества.
    0x2703, // Каждому штриху предшествует решение. Даже если они наносятся в случайном порядке, это тоже сознательное решение.
    0x27D3, // Так что её картина, даже эта, наверняка имеет под собой какую-то основу или идею о том, что она хочет изобразить.
    0x289E, // Если идея Рин в том, чтобы, как она говорит, не иметь идеи, то разве это нельзя считать идеей?
    0x2945, // Логический парадокс? Видимо, через такие парадоксы Рин и проявляет себя в повседневных делах и в общении, поэтому неудивительно, что она сама этого не заметила.
    0x2A6A, // Я раздумываю, не озвучить ли всё это, но потом решаю, что не хочу ввязываться в спор о логике с этой девушкой.
    0x2B2F, // В мозгу кого-нибудь из нас наверняка вскоре начнёт коротить, поэтому я отвергаю эту мысль.
    0x2BD4, // Рин принимается вертеться и ёрзать.
    0x2C16, // Даже её, по обыкновению, пустой взгляд вдруг приобретает довольно обеспокоенное выражение, которое у людей просто так не возникает.
    0x2D08, // Всё в порядке?
    0x2D22, // Да. Нет.
    0x2D30, // Спина опять начала болеть.
    0x2D61, // Картина всё же слишком большая, и в таком положении трудно рисовать.
    0x2DDE, // Может, сделаешь перерыв?
    0x2E0B, // Когда закончу эту часть.
    0x2E38, // Перерыв она, конечно же, так и не делает, и я о нём ей больше не напоминаю, потому что это совершенно бессмысленно.
    0x2F06, // Рин продолжает работать, и я остаюсь с ней: мне нравится смотреть, как она рисует. А теперь я собираюсь стать членом того же кружка, в котором состоит она.
    0x301D, // Когда она объявляет о завершении фрески, стоит уже такая темень, что мне непонятно, как она может быть в этом уверена.
    0x30F3, // Не следует никаких торжественных речей, не возникает никакого чувства удовлетворения от хорошо проделанной работы, только усталое краткое «я всё», и мы расходимся.
};

#endif // KS_A1C14O2_RU_TL_INDEX