#ifndef KS_A1_MONDAY_OUT_COLD_RU_TL_INDEX
#define KS_A1_MONDAY_OUT_COLD_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_5906962E_ru_intl[] = {
    0x0000, // Лёгкий ветерок колышет голые ветви над головой, заставляя их шуметь, словно деревянные колокольчики.
    0x00BA, // Летом в этом месте любят уединяться парочки. Густые зелёные своды крон надёжно укрывают их от взглядов учителей и остальных учеников.
    0x01B0, // Но сейчас, в середине зимы, у меня создаётся впечатление, будто я стою под кучей хвороста.
    0x0253, // Сложив ладони, я дышу на них и яростно тру друг о друга, чтобы они не онемели на таком морозе.
    0x02FB, // Сколько мне ещё ждать? Я уверен, что в записке говорилось: «В 16:00».
    0x0372, // Ах да, записка… Её незаметно подсунули в мой учебник математики.
    0x03E9, // Если говорить о штампах, то, хоть этот вариант и демонстрирует некоторую решительность, мне больше по душе вариант с письмом в шкафчике.
    0x04E2, // Пока я размышляю над смыслом записки, снегопад постепенно усиливается.
    0x0565, // Падающие с белого неба снежинки остаются единственным признаком того, что время ещё продолжает свой ход в этом оцепеневшем мире.
    0x0652, // То, насколько неспешно они опускаются на замёрзший лес, создаёт впечатление, будто время едва ползёт.
    0x070C, // Хруст шагов по свежему снегу нарушает тишину, заставляя меня вздрогнуть. Кто-то приближается сзади.
    0x07C3, // Хи… Хисао? Ты пришёл?
    0x07EA, // Неуверенный, едва слышный вопрос.
    0x0828, // Однако я сразу узнаю этот нежный голос.
    0x0870, // Моё сердце замирает.
    0x0896, // Сотни раз я слышал, как его обладательница обращается к кому-то другому.
    0x091A, // Я оборачиваюсь на него, на голос из моих снов, и сердце начинает учащённо биться…
    0x09AF, // Иванако? Я получил записку с просьбой прийти сюда… Она от тебя?
    0x0A23, // Чёрт. Я всё утро пытался придумать какую-нибудь хорошую фразу – и вот что вышло.
    0x0AB5, // Вышло ужасно.
    0x0ACE, // Эм… да. Я попросила подругу передать тебе эту записку. Рада, что ты получил её.
    0x0B5D, // Взволнованный её застенчивой, радостной улыбкой, я замираю, не в силах пошевелить ни единым мускулом.
    0x0C17, // Только сердце неистово бьётся, словно пытается выскочить из груди прямо к ней.
    0x0CA7, // Ну… э… вот мы и здесь. На морозе…
    0x0CE5, // Ветер вновь принимается качать ветви. Их нестройный шум – словно музыка для моих ушей.
    0x0D84, // Иванако слегка вздрагивает от порыва ветра.
    0x0DD5, // Когда он стихает, она выпрямляется, будто набравшись смелости.
    0x0E48, // Наши взгляды встречаются. Она неспешно играет прядью своих длинных тёмных волос.
    0x0EDD, // Всё это время тревожное биение моего сердца усиливается.
    0x0F46, // Горло сводит судорогой; сомневаюсь, что способен выдавить из себя хоть слово.
    0x0FD4, // Знаешь…
    0x0FE4, // …Я хотела спросить…
    0x100B, // Не хочешь ли ты… встречаться со мной?
    0x1050, // Я стою словно истукан, и лишь сердце бешено колотится.
    0x10B3, // Я бы и рад что-нибудь ответить, но мои голосовые связки словно натянуты до предела.
    0x114A, // …Хисао?
    0x1159, // Пытаясь помассировать горло, я поднимаю руки, но в них словно впиваются тысячи игл, отзываясь жгучей болью.
    0x121D, // Хисао?!
    0x122A, // Тело цепенеет, широко открытые глаза мечутся в ужасе.
    0x128C, // ХИСАО!
    0x1298, // Внезапно стук в груди прекращается и колени подкашиваются.
    0x1305, // {vspace=210}Полог из голых ветвей, хмурое зимнее небо, Иванако, бегущая ко мне, – весь мир вокруг погружается во тьму.
    0x13D1, // {vspace=30}Последнее, что я успеваю запомнить, прежде чем меня поглощает забытьё, – голос Иванако, зовущий на помощь, и непрерывный шум ветвей на ветру…
};

#endif // KS_A1_MONDAY_OUT_COLD_RU_TL_INDEX