#ifndef KS_A1_SUNDAY_DONT_PANIC_RU_TL_INDEX
#define KS_A1_SUNDAY_DONT_PANIC_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_472F6A42_ru_intl[] = {
    0x0000, // Моё сегодняшнее пробуждение сопровождается лёгким головокружением. Уже почти полдень.
    0x00A1, // Сегодня можно спать допоздна: воскресенье, уроков нет.
    0x0105, // Хотя это не простое воскресенье, а ещё и день фестиваля.
    0x016B, // Из окна видно, как люди в киоске с жареной собой накладывают лапшу страждущим по низкосортной пище.
    0x0221, // Я закидываю в рот пригоршню утренних лекарств и принимаюсь раздумывать, как же провести день.
    0x02CD, // На следующей неделе ожидается несколько экзаменов, но я, в отличие от остальных, не считаю их угрозой, потому и не беспокоюсь.
    0x03B2, // За неимением горящих обязательств по учёбе, я могу провести день фестиваля так, как хочу.
    0x0455, // Закончив утренние процедуры, я выхожу в коридор, намереваясь найти чего-нибудь поесть.
    0x04F4, // Проходя мимо двери Кендзи, я вдруг решаю поинтересоваться, чем собирается заняться он.
    0x0593, // Все сегодня чем-то заняты, и мне любопытно, есть ли у него какие-либо планы.
    0x061B, // Хотя, с другой стороны, он вполне мог сделать из комнаты звуконепроницаемое убежище.
    0x06B6, // Или нечто вроде крепости с табличкой «Женщинам не входить».
    0x0724, // …и слово «Женщинам» перечёркнуто, а над ним накорябано: «Никому».
    0x079D, // Постучав в дверь, на которой, к счастью, никакой таблички нет, я снова слышу щёлканье по меньшей мере десятка замков. Дверь со скрипом открывается.
    0x08A8, // Кто там?
    0x08B7, // «Кто там» надо спрашивать перед тем, как открываешь дверь.
    0x0922, // А, это ты. Блин, ещё же рано.
    0x0953, // На самом деле не так уж и рано.
    0x098A, // В чём дело, чувак?
    0x09AA, // Ни в чём, просто хотел спросить, чем будешь сегодня заниматься.
    0x0A1D, // Половина школы уже собралась снаружи.
    0x0A63, // Где – «снаружи»? Почему?
    0x0A90, // Что?
    0x0A98, // Что – «что»? Сегодня особый день? Почему они там? И кто это – «они»?
    0x0B12, // Я их слышу. Шумят… только не говори, что… Началось вторжение?
    0x0B83, // Он вдруг принимает тревожный вид.
    0x0BC1, // Какой сегодня день, чувак?
    0x0BF1, // Да, наверное ты не видишь деревянные киоски на улице и то, как люди продают еду…
    0x0C83, // О чём ты, чёрт возьми? Я держу занавески задёрнутыми, чтобы помешать снайперам.
    0x0D13, // О-ох, да фестиваль сегодня! Тебе ведь о нём известно?
    0x0D72, // Твою мать, что, уже сегодня? Ах, чёрт. Во-от… чёрт. Чёрт бы их побрал.
    0x0DEC, // Не могу поверить, что я забыл, я ведь ещё не закончил свою крепость! Это плохо.
    0x0E79, // Сегодня будет ужасный день… Хорошо, что ты меня предупредил, чувак. Паршивый будет день.
    0x0F1B, // Почему?
    0x0F29, // О-о, чувак, они же будут повсюду. Люди. За окном. Общаться!
    0x0F90, // Кендзи нервно трёт виски. Ему как будто стало плохо.
    0x0FEF, // Будет шумно, как в аду. Чёрт, а я собирался сегодня выйти, теперь всё пропало. Всё пропало.
    0x1091, // Это кошмар. Отстой. Лажа!
    0x10BE, // Блин, полный отстой. Я теперь не могу никуда пойти. Некуда бежать.
    0x1135, // Кендзи, похоже, нервничает. Можно сказать, капитально съезжает с катушек.
    0x11BB, // Не могу поверить. Так вот что сегодня за день!
    0x120E, // Чёрт, я даже не смог подготовиться.
    0x124E, // Я даже не смог собраться, а теперь, когда всё началось, я бессилен. Тебе следовало сказать мне раньше, чувак. То есть я хотя бы теперь знаю, но… Я должен был узнать раньше! Только представь, чего бы я смог достичь…
    0x13CF, // Прости. Я думал, ты знаешь.
    0x13FF, // Значит, я так полагаю, ты сегодня не будешь ничем занят?
    0x1464, // Даже погода хорошая. Вчера было ветрено, так что я думал, что сегодня будет холодно. Но раз нет, то и смысла сидеть дома тоже нет. Да, тебе надо сходить на фестиваль.
    0x158C, // Кендзи закрывает лицо руками и стонет.
    0x15D3, // А-а, нет, нет! Я не могу. Они съедят меня заживо, я знаю.
    0x1634, // Наверное, это шутка, но он произносит её с невозмутимым лицом. Относительно невозмутимым.
    0x16D8, // А что ты собираешься делать? Давай ко мне, поможешь строить крепость. Если будем работать вместе, то, может, ещё успеем.
};

#endif // KS_A1_SUNDAY_DONT_PANIC_RU_TL_INDEX