#ifndef KS_A1C6O3_RU_TL_INDEX
#define KS_A1C6O3_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1E380_ru_intl[] = {
    0x0000, // Миша и Сидзунэ всё ещё спорят о местах, где можно перекусить, недостижимых для обычных школьников, которым пришлось бы добираться до города и обратно на такси.
    0x0123, // Вы что, ещё не закончили?
    0x0150, // А, прости, Хиттян! Ты нас ждал?
    0x0186, // …
    0x018A, // У тебя нет никаких планов?
    0x01BA, // Планов?
    0x01C8, // На большую перемену.
    0x01EE, // Ну… нет, я думал провести время с вами.
    0x0235, // Миша отмечает отсутствие у меня планов победоносной улыбкой, взволнованно передав мои слова Сидзунэ.
    0x02F0, // …
    0x02F4, // Раз ты свободен, не хочешь перекусить с нами? Правда, мы собираемся в город… Не волнуйся, Хиттян, это совсем рядом!
    0x03C4, // Конечно, я не против.
    0x03EA, // На этом мы и покидаем класс.
};

#endif // KS_A1C6O3_RU_TL_INDEX