#ifndef KS_CHOICE_EMI_LUNCH_RU_TL_INDEX
#define KS_CHOICE_EMI_LUNCH_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_3A5E5047_ru_intl[] = {
    0x0000, // Извини, я не могу. Я уже кое-кому обещал перекусить вместе.
    0x006A, // А? Кому? Это девушка~?
    0x0090, // Да…
    0x0098, // Её смешок вынуждает меня быстро что-то добавить, чтобы она не поняла меня превратно.
    0x0132, // Это не то, что ты думаешь! Ситуация… немного запутанная.
    0x0199, // Запутанная… да, такая у меня жизнь, несмотря на то что я уже влился в повседневную школьную рутину.
    0x024E, // Теперь всё предстаёт в свете этой второй жизни, пересматривается с точки зрения нового меня.
    0x02F8, // Меня со сломанным сердцем.
    0x0329, // И ещё, я не знаю, смогу ли приходить в Совет.
    0x0378, // По крайней мере, пока. Просто есть на чём сконцентрироваться в первую очередь.
    0x0407, // Именно. Нужно заново расставить приоритеты. Вот что крутилось у меня в голове после разговора с фельдшером. Я не могу позволить себе притворяться, что абсолютно здоров.
    0x053B, // Я удивлён, что могу так отрешённо анализировать свою жизнь, однако пока пусть всё идёт своим чередом.
    0x05F4, // Обещаю, я потом нормально объясню, но не сейчас, ладно? Пожалуйста, скажи Сидзунэ, что мне жаль, что я её подвёл.
    0x06BD, // Как скажешь, Хиттян.
    0x06E2, // Голос у неё удивлённый и серьёзный, такого я никогда раньше не слышал.
    0x0762, // К счастью, Миша понимает, что я говорю на полном серьёзе, и мне очень повезло, что я смог выразить свои мысли так чётко, что даже она меня поняла. Она отворачивается, чтобы перевести мои слова Сидзунэ.
    0x08CC, // Ни одна из них после этого не произносит ни слова в мой адрес.
};

#endif // KS_CHOICE_EMI_LUNCH_RU_TL_INDEX