#ifndef KS_A1_WEDNESDAY_A_PRIVATE_LUNCH_RU_TL_INDEX
#define KS_A1_WEDNESDAY_A_PRIVATE_LUNCH_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_1569B151_ru_intl[] = {
    0x0000, // По соседству с нашим кабинетом располагаются классы 3-1 и 3-2 по правой стороне и 3-4 – по левой, и все двери выглядят совершенно одинаково.
    0x00F8, // Дальше по коридору с одинаковыми дверьми находятся кабинеты, для проведения уроков, как я считал, не используемые.
    0x01CA, // Наверное, кабинет кружка рисования – один из них.
    0x0225, // Я аккуратно открываю последнюю в коридоре дверь и заглядываю внутрь.
    0x02A4, // За ней оказывается классная комната, но либо неубранная, либо вообще неиспользуемая. Я не ошибся дверью?
    0x0363, // Парты и стулья, покрытые тонким слоем пыли, в беспорядке расставлены по комнате. В углу стоит несколько мольбертов – похоже, я не ошибся.
    0x045D, // Комната залита светом из огромных окон, на партах лежат тени.
    0x04CD, // Облачка пыли танцуют в недвижимом воздухе, делая солнечные лучи почти осязаемыми.
    0x0564, // Ради смеха я обращаюсь к пустой комнате.
    0x05AE, // Есть кто до—{w=.5}{nw}
    0x05D0, // Заметив что-то краем глаза, я останавливаюсь на середине фразы.
    0x0644, // На парте сидит коротко стриженая девушка; к моему удивлению, она одета в мужскую школьную форму и держит пальцами ног вилку, на которую нанизан кусочек еды.
    0x0761, // Такой необычный способ принятия пищи вызван очевидным отсутствием у неё рук, но ещё больше меня ошеломляет само её присутствие здесь.
    0x0857, // Как же я её раньше не заметил? Она сидит в углу неподвижно и на первый взгляд кажется предметом обстановки или статуей.
    0x0930, // Я сегодня совсем невнимательный.
    0x096D, // Девушка застыла на месте, уставившись на меня огромными зелёными глазами, как кролик в свете фар.
    0x0A1F, // Её вилка так и замерла у открытого рта.
    0x0A66, // Я смотрю на неё, разинув рот, внезапно вспомнив, что остановился на полуслове, и пытаясь решить, стоит ли заканчивать фразу.
    0x0B47, // Мы застыли в тишине, нарушаемой лишь ритмичным тиканьем настенных часов.
    0x0BCD, // Привет.
    0x0BDB, // Девушка отправляет вилку в рот и выжидательно на меня смотрит, пережёвывая еду. Я чувствую себя неловко.
    0x0C9A, // М-м… привет. Меня попросили забрать отсюда кое-что. Для фестивальных киосков, в смысле. Я не думал, что тут кто-то есть.
    0x0D71, // Никого нет. Именно поэтому я тоже сюда пришла.
    0x0DC5, // Она накалывает на вилку следующую порцию.
    0x0E12, // Тогда разве это не значит, что здесь есть ты?
    0x0E63, // Она приподнимает брови, как бы сомневаясь в верности моего замечания.
    0x0EE3, // А ты наблюдательный. Полагаю, что так. А ты кто?
    0x0F38, // Прямолинейная девушка, не правда ли?
    0x0F7B, // Меня зовут Накай, Хисао Накай. Я только в понедельник перевёлся.
    0x0FF0, // А меня – Рин. Тэдзука Рин. Рин Тэдзука.
    0x1036, // Руку я тебе не пожму, но теперь мы хотя бы знаем, кто есть кто.
    0x10A5, // Это здорово.
    0x10BC, // По её серьёзной манере разговора трудно определить, шутит ли она насчёт рукопожатия.
    0x1158, // Шутки на эту тему кажутся совсем неуместными, и это меня беспокоит.
    0x11D3, // Пока я пытаюсь выяснить, что уместно, а что нет, девушка теряет ко мне интерес и переводит голодный взгляд на еду.
    0x12A1, // Могу я продолжать ланч? Если ты не против моего присутствия, я не против твоего.
    0x1332, // Если тебе нужно что-то взять, то всё хранится в конце класса.
    0x13A0, // Конечно, продолжай. Но… ланч? Учебный день уже кончился.
    0x1407, // Тогда как бы ты это назвал? Нет специального слова для приёма пищи между ланчем и обедом, ведь так? Меня это тоже беспокоит, но я не знаю, какое слово подобрать.
    0x1528, // Не думаю, что между ланчем и обедом следует что-то есть.
    0x158D, // Но я голодная, и иначе мою восхитительную еду пришлось бы выбросить.
    0x160A, // У меня тут карри. Очень вкусное.
    0x1644, // Решительным движением Рин снова поднимает зажатую между пальцами ноги вилку и по меньшей мере неучтиво указывает ею прямо на меня.
    0x1735, // Так что, Накай, какими судьбами ты здесь оказался?
    0x1790, // Как я уже сказал, мне поручили поискать некоторые вещи.
    0x17F5, // Нет, в школе. Судя по внешнему виду, ты вроде здоров. Проблема где-то внутри?
    0x187E, // Я в полном замешательстве, не могу из себя ничего выдавить.
    0x18EA, // Я…
    0x18F0, // Попробую угадать. Я хорошо угадываю. Лучше, чем большинство людей.
    0x1969, // Рин обрывает меня на полуслове прежде, чем я успеваю ответить на вопрос или как-то его обойти. Не знаю, что бы я выбрал.
    0x1A40, // Я снова оказываюсь перед этой проблемой. Я ещё никому не рассказывал здесь о своём недуге. Впрочем, возможно, лишь потому, что об этом никто не спрашивал.
    0x1B57, // У меня сложилось впечатление, что игнорирование таких вопросов – часть здешних общественных норм, как сказал учитель.
    0x1C31, // Интересно, могут ли люди здесь найти общий язык? Наверное, не легче, чем обычные люди.
    0x1CCC, // Я не могу понять условия, в которых находятся Сидзунэ или Лилли.
    0x1D41, // Разумеется, пока я об этом размышляю, Рин с глубокомысленным выражением лица продолжает обдумывать, что со мной не так.
    0x1E1B, // Она помещает вилку в рот и откидывается назад, устремив взгляд в потолок, как если бы там был написан ответ.
    0x1EDF, // Луч света из окна освещает её лицо, создавая на другой его половине маску тени.
    0x1F6F, // Вряд ли дело в твоей голове, а какая-нибудь кишечная проблема была бы банально-скучной, как мой обед. Да вдобавок пресной.
    0x204C, // Должно быть, проблема у тебя в штанах!
    0x2091, // Такое утверждение в духе пьяного Шерлока Холмса, а также полное отсутствие такта, с которым это произносится, застаёт меня врасплох.
    0x2184, // Наверное, я неосознанно отшатываюсь, потому что глаза Рин расширяются от изумления и восторга.
    0x2232, // Так, значит, я права! У тебя что-то не в порядке с причиндалами?
    0x22A3, // Всё ещё в шоке, но осознавая необходимость как-то отреагировать, я выдаю первое, что приходит в голову.
    0x235E, // Нет! Ничего подобного! У меня проблемы с сердцем. Аритмия.
    0x23C7, // …
    0x23CB, // Я произнёс это. Скорее, конечно, выпалил, но всё же сказал вслух.
    0x243F, // Девушка кривит губки и сердито на меня смотрит, будучи явно очень расстроенной.
    0x24D1, // Как скучно. Проблема в штанах была бы куда более позорной.
    0x253B, // Что это за реакция?
    0x255E, // Извини, что подвёл.
    0x2581, // Я тебя прощаю. Просто я коллекционирую людей, и иметь человека с… ну, знаешь, такой проблемой было бы очень здорово.
    0x2654, // Коллекционируешь людей?
    0x2681, // Людей с разными проблемами.
    0x26B4, // Ты что, просто… ходишь и спрашиваешь у всех, что с ними не так?
    0x2725, // Именно.
    0x2733, // Понятно.
    0x2743, // …
    0x2747, // Разговор затухает, и Рин возобновляет приём пищи, а я продолжаю думать над тем, что она сказала.
    0x27F5, // Я впервые поведал кому-то о своём недуге. Все остальные либо уже знали, либо слышали о нём от кого-то ещё.
    0x28B3, // Или же им до настоящего момента необязательно было знать об этом, как и всем прочим ученикам этой школы.
    0x2971, // Мне следует упоминать его при знакомстве? От меня этого ожидают?
    0x29E7, // «Привет, меня зовут Хисао. У меня серьёзные проблемы с сердцем».
    0x2A5C, // Так мне теперь представляться людям?
    0x2AA0, // Как будто наши болезни характеризуют нас. Что за мерзкая идея?
    0x2B12, // Или, может быть, у этой Тедзуки просто странный интерес к подобным вещам?
    0x2B97, // Пока я иду в конец кабинета за вещами из Мишиного списка, мне представляется шанс краем глаза понаблюдать за Рин.
    0x2C66, // У неё светло-каштановые, почти рыжие, коротко стриженые волосы. Без рук с длинными волосами было бы, наверное, трудно управиться.
    0x2D51, // Из-за мужской школьной формы и отсутствия рук она выглядит очень худой, почти тощей.
    0x2DEB, // Она ничем особо не привлекательна, разве что тёмно-зелёными глазами, которыми беспрестанно моргает из-под короткой чёлки, даже когда ест.
    0x2EE7, // Из-за теней и расстояния создаётся ощущение, что они вообще не отражают свет, а, наоборот, поглощают его полностью, как глубокие колодцы.
    0x2FE0, // Движения её ног так же ловки, как и движения рук обычных людей.
    0x3052, // Однако, когда смотришь на это, может стать не по себе, особенно когда ногами едят. Во всяком случае, я себя чувствую немного неловко.
    0x3142, // Я стараюсь не думать о слове «неестественный», но уже поздно, да?
    0x31B8, // Я продолжаю шарить по ящикам и полкам, но со временем молчание становится слишком неудобным, поэтому я пробую разговорить эту странную девушку.
    0x32C0, // Ты всегда ешь одна и так поздно? Или заходят случайные посетители?
    0x3339, // Посетители… Наверное, ты – мой первый случайный посетитель. Но я не всегда ем одна.
    0x33D2, // Иногда я ем с определённым человеком на крыше, если она не носится где-нибудь.
    0x3460, // Носится?
    0x3470, // Она увлекается спортом.
    0x349C, // А…
    0x34A2, // Это всё, что приходит мне в голову в качестве ответа.
    0x3502, // Мы снова погружаемся в молчание, пока Рин доедает остатки своей еды.
    0x357F, // Я смотрю на свою поклажу, сверяясь с Мишиным списком. Похоже, я достал всё, за исключением фанеры.
    0x3630, // Эм-м… ну, думаю, я всё нашёл.
    0x3663, // Молодец. Можешь идти, я не возражаю. Я всё равно собиралась вздремнуть.
    0x36E4, // Тебе ведь нужно делать с этими вещами то, что собирался?
    0x374A, // Или, может быть, тебе нравится наблюдать за спящими девушками?
    0x37BC, // Э…
    0x37C2, // Я не уверен, как это следует понимать, но Рин выглядит серьёзной.
    0x3838, // Даже если бы и нравилось, полагаю, что мне пора.
    0x388E, // Ещё… Ещё увидимся, Тэдзука.
    0x38C1, // Можешь звать меня Рин.
    0x38EA, // Думаю, на данном этапе наших отношений я могу тебе такое позволить.
    0x3965, // Я собираюсь уйти, но поддаюсь внезапно нахлынувшему на меня желанию сказать что-то ещё.
    0x3A05, // Хорошо, тогда я – Хисао.
    0x3A31, // Тогда да.
    0x3A42, // …
    0x3A46, // Рин смотрит на меня прямо в упор, но угрожающего чувства, которое обычно бывает в такой ситуации, не возникает.
    0x3B10, // Будто она на меня и вовсе не смотрит.
    0x3B53, // Она пару раз моргает, и я не могу понять, почему внезапно между нами повисла пауза.
    0x3BE9, // До встречи, Хисао.
    0x3C0A, // Кажется, на её лице мелькает тень улыбки.
    0x3C55, // Я тихо пячусь вон из комнаты. Закрыв перед лицом дверь, я шепчу:
    0x3CC8, // Какая загадочная девушка…
    0x3CFA, // Из класса приглушённо, нараспев слышится:
    0x3D47, // А я слы~ша~ла!
};

#endif // KS_A1_WEDNESDAY_A_PRIVATE_LUNCH_RU_TL_INDEX