#ifndef KS_A1C4O1_RU_TL_INDEX
#define KS_A1C4O1_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1DBFC_ru_intl[] = {
    0x0000, // Привет! Я новенький, Хисао Накай. Мы с тобой в одном классе.
    0x006B, // …
    0x006F, // Эм… Я только на днях перевёлся. Может, ты не помнишь?
    0x00CF, // …
    0x00D3, // Девушка по-прежнему не произносит ни звука, лишь испуганно глядит на меня.
    0x015B, // Я пока ещё тут осваиваюсь и пытаюсь со всеми познакомиться.
    0x01C8, // Ну так… как тебя зовут?
    0x01F3, // Х… Ханако…
    0x0209, // Она говорит запинаясь и так тихо, что её едва слышно даже в безмолвии библиотеки.
    0x029D, // Думаю, я ошибся, приняв её за хулиганку.
    0x02E5, // Ханако, значит? А что ты читаешь?
    0x0320, // Она показывает мне книжку, при этом робко пряча за ней лицо.
    0x038D, // Должно быть, она заметила, как я пялился на её шрамы.
    0x03EC, // «Жизнь Пи»? Никогда о ней не слышал. О чём она?
    0x043F, // О мальчике… и о тигре…
    0x046A, // …на лодке…
    0x0480, // Видимо, это потребует времени.
    0x04B8, // Звучит интересно. Нравится?
    0x04EB, // Она молча кивает из-за книжки.
    0x0522, // Девочка выглядит очень напряжённой. Не совсем так, как Юко, она, скорее… оцепеневшая от ужаса, я бы сказал.
    0x05E4, // Таинственная незнакомка оказалась вовсе не хулиганкой. Сейчас она дрожит, будто боится меня до смерти.
    0x06A1, // Полагаю, единственный выход из этой ситуации – попытаться наладить нормальный разговор.
    0x0745, // Это библиотечная книжка? Я ищу, что бы почитать, но тут так много всего…
    0x07C8, // Н-нет. Моя.
    0x07DB, // А, ясно… Ты часто сюда приходишь?
    0x0818, // …
    0x081C, // По лицу Ханако разливается румянец, а глаза невероятно расширяются.
    0x0899, // Ой-ёй-ёй. Неужели она приняла мои потуги завязать разговор за неумелую попытку приударить за ней?
    0x094B, // То есть… э… Я не в том смысле, что…
    0x098C, // Я ещё представлялся классу…
    0x09C1, // …
};

#endif // KS_A1C4O1_RU_TL_INDEX