#ifndef KS_A1C3O2_RU_TL_INDEX
#define KS_A1C3O2_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1D83C_ru_intl[] = {
    0x0000, // Похоже, она хочет спровоцировать меня.
    0x0047, // Окинув взглядом доску, я убеждаюсь, что моя защита весьма неплоха, и я не собираюсь разрушать её необдуманными поступками.
    0x0127, // Но через несколько ходов я всё равно проигрываю.
    0x0180, // Сидзунэ поправляет очки и празднует победу, торжествующе взмахнув в воздухе кулачком.
    0x021F, // …
    0x0223, // Ва-ха-ха-ха~! Хиттян, ты проиграл ещё тогда, когда позволил мне захватить Северную Америку.
    0x02C7, // В смысле Ситтян, а не мне.
    0x02F5, // …
    0x02F9, // Получать контроль над Северной Америкой очень рискованно, ведь, хоть она и обеспечивает пять дополнительных армий, её можно атаковать с трёх сторон и приходится сосредотачиваться на защите~!
    0x0458, // …
    0x045C, // Не думала, что ты такой нерешительный. Какое разочарование.
    0x04C9, // Амбиции, Хиттян. Тебе нужно играть более уверенно! Амбиции, амбиции~!
    0x0546, // …
    0x054A, // Игра стала интереснее, когда ты захватил Южную Америку, но, получив небольшое преимущество, ушёл в оборону. Это плохо, Хиттян.
    0x062F, // Ты недостаточно рисковал, а если и рисковал, то не доводил дело до конца. Это ужасно, Хиттян.
    0x06D6, // Блин, какое ей дело до того, что я слишком осторожничал? Не обязательно бросать мне это в лицо.
    0x0781, // …
    0x0785, // Я начала сомневаться, что от тебя будет польза Школьному совету…
    0x07FD, // Это что, реверсивная психология?
    0x0839, // В таком случае мне не нужно беспокоиться о вступлении?
    0x089D, // …
    0x08A1, // Уже сдаёшься? Я ожидала от тебя большего.
    0x08EC, // Неужели Сидзунэ дразнит меня, пытаясь заманить в Совет?
    0x0952, // Я не хочу вступать туда сейчас. Ведь я в школе только второй день – в поспешном решении нет смысла.
    0x0A06, // Я ещё даже не взглянул на остальные кружки. Да и эти двое какие-то странные.
    0x0A8F, // Ладно, может быть я подумаю о вступлении, но сперва взгляну на другие кружки.
    0x0B1B, // Правда, Хиттян? Ты сказал это не для того, чтобы не огорчать нас?
    0x0B8F, // Нет, нет. Просто я ещё сам не решил, хочу ли я этого.
    0x0BEB, // Вот оно как…
    0x0C03, // …
    0x0C07, // Ладно, Хиттян. Но мы не собираемся сдаваться так просто. Ты сказал «может быть», значит ещё не всё потеряно~!
    0x0CCB, // …
    0x0CCF, // Ну же, это будет весело! Мы сможем ещё поиграть в «Риск», и, возможно, однажды ты сумеешь выиграть! Если мы не закончим школу раньше этого момента.
    0x0DD7, // Знаешь, это отнюдь не добавляет мне желания присоединяться к вам.
    0x0E4F, // …
    0x0E53, // Ва-ха-ха~! Уверена, ты неплох в настольных играх! Может, сыграем в игру, с которой ты знаком, чтобы дать тебе небольшую фору?
    0x0F31, // Знаешь, я всё-таки сказал «может быть» лишь для того, чтобы вы не расстроились.
    0x0FC0, // У-у-у, это жестоко, Хиттян…
};

#endif // KS_A1C3O2_RU_TL_INDEX