#ifndef KS_CHOICE_DONT_WANT_TALK_RU_TL_INDEX
#define KS_CHOICE_DONT_WANT_TALK_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_BFCD6512_ru_intl[] = {
    0x0000, // Я не скажу, смирись.
    0x0024, // Вот как~?
    0x0034, // Ага.
    0x003C, // На мгновение она задумывается.
    0x0075, // Это жестоко, Хиттян~!
    0x009B, // По её расстроенному и подавленному голосу я понимаю, что она дуется.
    0x0118, // Она снова отступает на некоторое время, чтобы посовещаться с мозговитой половиной их энергичного дуэта, после чего возвращается.
    0x0206, // Думаю, надо вместе перекусить и побеседовать на эту тему… говорит Ситтян.
    0x028E, // За наш счёт.
    0x02A4, // Кроме того, тебе нужно возместить утреннее отсутствие и нам нужна помощь в работе~!
    0x033C, // Остальные ученики начинают поглядывать на нас, возможно из-за того, что Миша так сильно перегнулась через парту, что почти касается моей головы своей. Её кудрявые волосы щекочут мне шею.
    0x0490, // Они пахнут шампунем и ещё чем-то, чем она, похоже, пользовалась, чтобы завить их.
    0x0521, // Сидящая впереди девушка, кажется, пытается подслушивать. Надеюсь, окружающие не поймут нас неправильно, хотя я не представляю, как можно эту ситуацию понять правильно.
    0x0654, // К счастью, Муто не обращает на нас внимания или нарочно игнорирует Мишу. Пока что.
    0x06E9, // Мне никак не выкрутиться, не так ли?
    0x072A, // Я пойду на ланч с Эми и её подругой.
    0x076A, // Пойду с Сидзунэ, я ведь, в конце концов, теперь в Совете.
};

#endif // KS_CHOICE_DONT_WANT_TALK_RU_TL_INDEX