#ifndef KS_CHOICE_FUN_AT_OFFICE_RU_TL_INDEX
#define KS_CHOICE_FUN_AT_OFFICE_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_8F650623_ru_intl[] = {
    0x0000, // Чёрт возьми. Она совершенно не знает, когда остановиться.
    0x0069, // Ладно, ладно. Расскажу. Я прекрасно провёл время.
    0x00C2, // Поутру у меня случился сердечный приступ и я несколько часов тусовался с фельдшером.
    0x015E, // Надо сказать, лучшее утро в моей жизни.
    0x01A5, // Грубо говорю я, пытаясь сымитировать её скачущую интонацию, только шёпотом, чтобы никто другой не услышал. Мои слова довольно резкие.
    0x0299, // Что-что с тобой случилось? Хиттян, ты серьёзно?
    0x02EE, // Перестань. Всё-то ты прекрасно слышала.
    0x0336, // Но, Хиттян, это серьёзно!
    0x0363, // Нет, правда. Отвяжись. Мы, кстати, на уроке.
    0x03B0, // Но, Хиттян!..
    0x03C6, // Миша, кажется, обеспокоена, возможно даже в панике. Интересно, осознаёт ли она, что быть такой назойливой – не лучшая идея?
    0x04A5, // …
    0x04A9, // Прежде чем ответить, я даю ей повариться немного в собственном соку. Сидзунэ этого не передать, но мне это безразлично.
    0x0582, // Отвали, Миша.
    0x059A, // И Сидзунэ скажи то же самое.
    0x05CD, // Я тут же жалею о том, что только что сказал. Но, как говорится, слово не воробей…
    0x065E, // Как ни странно, Миша действительно затыкается, хоть я и не проверяю, передала она моё послание Сидзунэ или нет. Это и неважно.
    0x0742, // Муто завершает урок какой-то общей речью о том, что фестиваль уже через два дня.
};

#endif // KS_CHOICE_FUN_AT_OFFICE_RU_TL_INDEX