#ifndef KS_A1_SATURDAY_AN_ASETHETICS_RU_TL_INDEX
#define KS_A1_SATURDAY_AN_ASETHETICS_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_3DAB6F25_ru_intl[] = {
    0x0000, // Минут через десять постоянного ёрзания за партой и попыток начать читать, Ханако закрывает книгу и тоже уходит.
    0x00CD, // Пора уйти и мне, поскольку задание я почти закончил, а больше в классе делать нечего.
    0x0167, // Однако каких-либо дел в других местах у меня тоже нет.
    0x01C9, // Школа напоминает пчелиный улей, но никто не обращает на меня внимания.
    0x024A, // Я прогуливаюсь мимо кабинетов, наполненных учениками, яростно вовлечёнными в какие-либо дела, суетящихся, словно рабочие пчёлы.
    0x0335, // И не скажешь, что учебный день закончился.
    0x0382, // Снаружи вроде немного тише, но только самую малость.
    0x03E2, // Народ вокруг суетится, изо всех сил стараясь успеть к сроку. Все кажутся занятыми и полными энергии.
    0x0499, // Я же испытываю противоположные чувства. Полуденное солнце словно бы вытягивает из меня весь дух, заставляя еле волочить ноги.
    0x0580, // Тёплый мягкий, как подушка, воздух задувает под рубашку.
    0x05E7, // Лениво зевая, я раздумываю о том, чем же заняться.
    0x0641, // Сначала скину книжки в общежитии, а потом… я ещё не решил.
    0x06AB, // Может быть, Кендзи у себя.
    0x06DA, // По дороге в общежитие я встречаю Эми. Она бежит, несмотря на то что сегодня не надела свои странные беговые протезы. Я машу ей, и она, притормозив, останавливается.
    0x0802, // Хай, Хисао!
    0x0816, // Её нос и подбородок украшают брызги белой и зелёной краски, но она, как всегда, широко улыбается.
    0x08C6, // Она всем телом подаётся ко мне, усиливая чувство, что изучает меня.
    0x0940, // Чё делаешь?
    0x0955, // Да ничего, собственно. Я ничего не готовлю к фестивалю, а все, кажется, заняты чем-то архиважным.
    0x0A03, // Прекрасно! Значит, ты сможешь помочь нам с Рин!
    0x0A58, // С подготовкой к фестивалю? Э-э, ну не знаю, будет ли от меня польза.
    0x0AD0, // Ничего страшного! От меня тоже пользы немного!
    0x0B25, // Эми хватает меня за запястье и с силой тащит обратно в школу.
    0x0B94, // Даже скорость её шага больше напоминает бег, из-за чего я спотыкаюсь, стараясь не отставать.
    0x0C3C, // Лестница немного замедляет темп Эми. Может быть, ей трудно подниматься по ступенькам или она просто запыхалась.
    0x0D09, // Мы поднимаемся на третий этаж, и я оказываюсь там же, откуда ушёл всего пять минут назад. Если б я знал, то мог бы просто остаться тут и подождать Эми.
    0x0E17, // Так вы… Рин всё ещё работает над фреской?
    0x0E63, // Именно! Ей нужны разные краски, кисти и прочее, так что я пошла взять их из кабинета рисования.
    0x0F0E, // И тебе нужно, чтоб я тебе помог.
    0x0F47, // Ну… Рин сказала, что ты ей уже помогал, и я подумала, что ты не будешь против.
    0x0FD2, // Понятно.
    0x0FE2, // Так, благодаря чудной логике Эми, я снова оказываюсь в кабинете рисования, собирая предметы для других людей.
    0x10AA, // Кроме нас и пылинок, витающих в воздухе, в кабинете никого нет. Эми тут же направляется в конец класса, вытаскивая из кармана маленький скомканный клочок бумаги.
    0x11D0, // Пока она пытается разобрать каракули, я внимательнее присматриваюсь к лежащему вокруг инвентарю.
    0x1284, // На полках расставлено множество банок и тюбиков с краской, в большинстве своём беспорядочно.
    0x132F, // Некоторые выглядят так, будто стоят тут десятилетиями, – реликвии прошлых поколений кружка рисования.
    0x13EC, // Рядом с массивными, аккуратно нагромождёнными стопками бумаги для рисования стоят коробки, полные кистей всевозможных размеров и не отсортированных цветных карандашей.
    0x1525, // В тяжёлом воздухе витают запахи краски, скипидара и свежей бумаги, перемешиваясь и создавая аромат, который ни с чем нельзя спутать, – аромат искусства.
    0x163C, // Эми изучает свои записи, сверяясь с этикетками на банках, и передаёт их мне, находя нужные.
    0x16E1, // Она вытягивает шею, чтобы заглянуть на верхнюю полку, но этого явно недостаточно.
    0x1776, // Как она ни пытается, уровень её глаз остаётся ниже полки. Эми сдаётся и просто смотрит на полку, словно ребёнок в магазине игрушек, пыхтя от недовольства.
    0x188E, // После мгновения нарастающей ярости, она начинает подпрыгивать, пытаясь успеть прочесть надписи за те доли секунды, на которые они оказываются в поле её зрения.
    0x19B3, // Неудивительно, что у неё ничего не получается и она едва не обрушивает весь стеллаж.
    0x1A4D, // Теперь я вижу, чем могу оказаться полезен.
    0x1A9A, // Эй, давай я. Тебе не прыгнуть достаточно высоко, а я не хочу, чтобы ты пострадала, пытаясь это сделать.
    0x1B52, // К тому же я тебя раза в два выше.
    0x1B8C, // Вот и нет!
    0x1B9E, // Она поворачивается ко мне, пыша негодованием и покраснев.
    0x1C08, // Да шучу я, просто шучу. И всё равно давай я посмотрю, ладно?
    0x1C72, // Она снова сердито на меня смотрит, но, не найдя что ответить, с недовольным «хм!» поворачивается ко мне спиной.
    0x1D3B, // Я принимаюсь рыскать по верхней полке в поисках нужной краски, в то время как Эми начинает копаться в ящиках, которые может достать.
    0x1E2C, // Убедившись дважды, что она не видит, я снисходительно качаю головой.
    0x1EA9, // То, что у Эми комплекс насчёт её роста, стало для меня неожиданностью. Я бы не подшучивал, если б знал.
    0x1F61, // Характер у неё лёгкий, но, видимо, у всех свои слабости.
    0x1FC5, // Только когда мы раскладываем все собранные предметы на парте, словно трофеи охотника за сокровищами, я понимаю, что она не обязательно обиделась именно на подколку о росте.
    0x2101, // Может быть, ей просто не нравится, когда другие говорят, что она чего-то не может. Например, прыгать.
    0x21B6, // Но Эми, кажется, сама уже обо всём этом забыла. Быстро обижается, быстро прощает… такой она человек?
    0x226C, // По крайней мере, на обратном пути к Рин она уже вовсю беспечно болтает. Видимо, она не принимает такие пустяки близко к сердцу.
    0x2352, // Я по-рыцарски несу кипу вещей, пока мы идём к фреске.
    0x23B1, // Рин очень волнуется, успеет ли закончить картину. Но сама виновата, надо было начинать раньше.
    0x245D, // А она успеет?
    0x2475, // Даже не знаю. По мне, так уже выглядит хорошо, но с Рин никогда не угадаешь.
    0x24FC, // Я нашла её сегодня утром в позе зародыша на крыльце общаги. Она не спала всю ночь. Поверить не могу, что дежурные медсёстры на неё не наткнулись.
    0x2602, // А теперь она снова рисует как сумасшедшая.
    0x2650, // Да, я… заметил, что она бывает… одержимой. Так сказать.
    0x26B5, // Эта фраза и нотки смущения в моём голосе вызывают у Эми искренний смех.
    0x2737, // Я не считаю это чем-то плохим. Просто иногда она бывает немного странной.
    0x27BC, // Насчёт этого могу с ней согласиться. В отличие от меня, Эми в ладах с… в общем, с тем, что так настораживает в Рин.
    0x2889, // Но всё же они, похоже, не так близки, как Миша с Сидзунэ. Те порой действуют как единая сущность, и трудно бывает сказать, где кончается одна и начинается другая.
    0x29AC, // Несмотря на то что они такие разные, как и Эми с Рин.
    0x2A0A, // А Рин отличается как от них, так и вообще ото всех, кого я когда-либо встречал.
    0x2A97, // Да, полагаю она очень… своеобразная личность.
    0x2AEC, // Я снова возвращаюсь к этому слову, будто оно заключает в себе характеристику Рин, хотя на самом деле является просто заменой длинному перечню её странностей.
    0x2C0D, // Эми задорно смеётся, пока я ищу более подходящее описание.
    0x2C78, // Она просто странная.
    0x2C9E, // Представляешь, недавно она просто просидела на коробке полчаса.
    0x2D14, // Сверля взглядом свои пальцы.
    0x2D49, // Она снова хихикает, словно не знает, что именно тут смешного, – просто смешно, и всё тут.
    0x2DE9, // Все полчаса.
    0x2E00, // На рабочей площадке царит полный беспорядок, но фреска стала занимать ещё большую часть стены с тех пор, как я её видел в последний раз.
    0x2EF7, // Искажённые фигуры людей раскрашены в основном в красные, розовые и оранжевые тона; причудливые, фантастические… штуковины заполонили промежутки между ними.
    0x3019, // Выглядит… неплохо. Я не могу придумать другого слова, которое описало бы работу лаконично и притом всеобъемлюще, поэтому склоняюсь к неопределённому «неплохо».
    0x3141, // Но, если честно, по мере продвижения фрески пространство вокруг стены превращается во всё больший бардак.
    0x3203, // Земля усеяна десятками банок с краской, разными принадлежностями и пустыми бутылками из-под газировки.
    0x32C1, // Сама Рин очень по-домашнему стоит среди всего этого хаоса и идеально вписывается в обстановку.
    0x336F, // Штанины закатаны до колен, выставляя напоказ тонкие ноги, щеголяющие боевой раскраской, подобной той, что у Эми на лице.
    0x344A, // Эми забегает вперёд и ликующе прыгает перед Рин.
    0x34A3, // Я вернулась!
    0x34BA, // Быстро. Опять бегала по коридорам?
    0x34F9, // Хисао мне помог.
    0x3517, // Эми победоносно указывает на меня.
    0x3557, // Следуя глазами за пальцем Эми, Рин поворачивается и в упор смотрит на меня.
    0x35E0, // Она рассеяно кивает. Вид у неё и в самом деле такой, будто она не спала со вчерашнего вечера: взгляд пустой, тусклый, она смотрит куда-то мимо меня, а движения вялы, словно в замедленной съёмке.
    0x373C, // Привет, Хисао. Спасибо за помощь.
    0x3778, // Да не благодари.
    0x3796, // Только что это сделала.
    0x37C1, // Проехали.
    0x37D3, // Похоже, ты продвинулась. Выглядит здорово, насколько я могу судить.
    0x384E, // Но теперь на тебя обрушится ещё больше невезения.
    0x38A9, // Знаю, я готов пойти на такой риск.
    0x38E6, // Это очень мило. Для меня, разумеется. Не для тебя.
    0x393F, // Поэтому художникам вечно не везёт. Им постоянно приходится смотреть на свои незаконченные картины.
    0x39F6, // Поэтому им не видать любовных приключений, их любимые сериалы снимают с показа или они умирают молодыми от какой-нибудь непонятной болезни. Это – глубокий и таинственный закон Вселенной.
    0x3B4E, // Если только они не слепые.
    0x3B7E, // Она обдумывает это какое-то время, выглядя так, будто сейчас уснёт.
    0x3BF8, // Есть один мальчик.
    0x3C1A, // В кружке рисования. Слепой мальчик. Так вот, он не видит.
    0x3C80, // Ему нужно стать художником. Никакого невезения, гарантировано.
    0x3CF4, // Вам это не кажется хорошей мыслью?
    0x3D33, // Что только слепым следует становиться художниками? Нет, не особо.
    0x3DAB, // …
    0x3DAF, // Возможно, ты прав.
    0x3DD0, // Бросив думать на эту тему, она снова переключается на мысли о работе и начинает напевать какую-то мелодию, которую я даже узнаю, только не могу вспомнить название.
    0x3EF9, // Эми расставляет принесённые вещи и передвигает несколько банок с краской, пытаясь навести какой-никакой порядок.
    0x3FCA, // Эми, мне нужна прусская лазурь.
    0x4003, // Какая же из них – прусская лазурь?..
    0x4044, // Она беспомощно смотрит на семь или восемь банок с разными оттенками синего.
    0x40CF, // Та, в которой прусская лазурь.
    0x4106, // Господи, Рин! Это совсем не помогло!
    0x4147, // Я тоже начинаю смотреть по сторонам, хоть и не знаю, как выглядит эта прусская лазурь. Интересно, какое отношение она имеет к Пруссии.
    0x423A, // …И что такое вообще эта Пруссия. Звучит знакомо, но никак не могу вспомнить.
    0x42C5, // Хоть по виду своему ни одна банка не выделяется среди остальных своей пруссистостью, по ярлычкам вполне ясно, что содержание у них тоже не прусское.
    0x43D4, // Нет здесь прусской лазури.
    0x4405, // Ты мне уже рассказывала.
    0x4432, // Мы переглядываемся с Эми – я понимаю, что она тоже уже слышала эту историю.
    0x44BB, // Ни один из нас ничего не говорит Рин, и та продолжает бубнить, словно плохой комик.
};

#endif // KS_A1_SATURDAY_AN_ASETHETICS_RU_TL_INDEX