#ifndef KS_A1_MONDAY_ENTER_STAGE_LEFT_RU_TL_INDEX
#define KS_A1_MONDAY_ENTER_STAGE_LEFT_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_70DD5068_ru_intl[] = {
    0x0000, // Ну же, соберись! Я понимаю, что это важный шаг, но… Наверное, нет причин так сильно переживать, по крайней мере пока.
    0x00D2, // Я вхожу в класс следом за учителем и оглядываюсь, стараясь не встречаться с любопытными взглядами моих новых одноклассников.
    0x01B8, // В классе довольно просторно: высокий потолок и широкие проходы между партами.
    0x0247, // Доска занимает всю стену, а из-за больших, старомодного вида окон, расположенных на уровне головы, она кажется ещё больше.
    0x0325, // Простые деревянные парты с полочками для книг. Простые деревянные стулья с металлическим каркасом. Незамысловато и эффективно.
    0x0410, // Я поворачиваюсь лицом к ученикам. На первый взгляд они выглядят так же, как и ученики любой другой школы. Но тогда почему они здесь?
    0x04FF, // Наверное, их недуги не видны на первый взгляд, как и у меня. Потом я замечаю, что у одной из девочек не хватает большого пальца на правой руке. Это немного обескураживает.
    0x0633, // Вопреки нормальной практике слушать, когда кто-то говорит о тебе, примерно с середины речи мои мысли начинают заглушать слова учителя, представляющего меня классу.
    0x0760, // Я ловлю на себе робкий взгляд девочки, сидящей на последнем ряду. Моё внимание привлекает блеск её прямых длинных волос. Заметив, что я смотрю, она быстро закрывает лицо руками, будто это поможет ей стать невидимкой.
    0x08E9, // Дальше сидит какой-то парень с тростью, прислонённой к шкафчикам. Странно видеть кого-то столь молодого с тростью.
    0x09BA, // Другая девочка совершает какие-то странные движения руками. Язык жестов? Она бросает на меня взгляд поверх очков и снова возвращается к своему занятию.
    0x0AD0, // Она довольно мила, как и её соседка – весёлого вида девчонка с розовыми волосами. Её трудно не заметить – не знаю, как я не обратил на неё внимания, когда вошёл в класс…
    0x0C03, // …пожалуйста, поприветствуйте нашего нового ученика.
    0x0C65, // Он начинает аплодировать, и все вторят ему, кроме однорукой девочки в первом ряду. Стараясь скрыть свою растерянность, я благодарю их поклоном за эти незаслуженные аплодисменты.
    0x0DAB, // Я слушаю, как учитель бубнит о том, что нам стоит подружиться, а сам смотрю по сторонам.
    0x0E49, // Кажется, все внимательно его слушают, и, когда он заканчивает, снова ему хлопают, что выглядит довольно странно.
    0x0F15, // В этот раз хлопает даже девочка из первого ряда, ладошкой здоровой руки по запястью другой, которая оканчивается перебинтованной культёй.
    0x1013, // Меня начинает слегка мутить.
    0x1048, // Сегодня мы будем работать в группах, так что у тебя будет шанс пообщаться с ребятами. Как ты на это смотришь?
    0x110D, // Замечательно, ничего не имею против.
    0x1150, // Хорошо, ты будешь работать с Хакамити. Она – староста класса.
    0x11C0, // Она расскажет всё, что тебе будет нужно узнать. Никто не справится с этим лучше неё, верно?
    0x1264, // Мне-то откуда знать?
    0x1289, // Учитель раздаёт задания и объявляет, что мы будем работать в группах по трое.
    0x1316, // Внезапно я понимаю, что не знаю, кто из них Хакамити. Чёрт. Учитель, кажется, замечает мою растерянность.
    0x13D3, // А, точно. Хакамити вон там. Сидзунэ Хакамити.
    0x1424, // Как только он называет её имя, симпатичная девочка с ярко-розовыми волосами и золотистыми глазами энергично машет мне рукой. Я сажусь рядом с ней, у окна.
    0x153C, // Привет, ты, наверное, Хакамити, да? Приятно познакомиться.
    0x15A5, // Ха-ха-ха~!
    0x15B6, // В чём дело? Её смех застаёт меня врасплох.
    0x1602, // Я тоже рада познакомиться!{w=0.5} Но~!
    0x1641, // Я тоже рада познакомиться! Но~!{fast} Я не Хакамити, я Миша! Хакамити – вот. Ситтян~!
    0x16D2, // Хихикая, Миша указывает на девочку, сидящую рядом с ней, – ту, что пользовалась языком жестов. Похоже, она наблюдала за мной всё это время. Она безразлично кивает мне, давая понять, что осведомлена о моём присутствии, но её это не слишком волнует.
    0x1890, // У неё короткие, аккуратно уложенные волосы и тёмно-синие глаза, смотрящие то изучающе, то равнодушно поверх овальных очков на изящном носике.
    0x1993, // Рад познакомиться.
    0x19B6, // …
    0x19BA, // Она тут же обращает взгляд к Мише, которая улыбается и делает пару быстрых движений руками.
    0x1A61, // Хакамити кивает и отвечает несколькими жестами.
    0x1ABA, // Я задумываюсь, не пошутил ли учитель насчёт «пообщаться с ребятами» и «она всё тебе расскажет».
    0x1B69, // Я вижу, ты немного сбит с толку, да? Да? Но я понимаю, почему ты принял меня за Ситтян!
    0x1C01, // Ситтян – глухонемая, а я передаю сообщения от неё и для неё.
    0x1C6E, // Я словно переводчик~! Она говорит, что ей тоже приятно с тобой познакомиться!
    0x1CFA, // …
    0x1CFE, // Ты ведь новый ученик, да? Конечно же да, Ситтян! Если бы он им не был, то не было бы смысла в том его выступлении перед классом, правильно? Правильно~!
    0x1E09, // Мы знали, что должен прийти новенький, но не думали, что это будет сегодня. Так скоро! Да, Хиттян?
    0x1EB7, // Хиттян?..
    0x1EC7, // Угу~! Тебе идёт, не правда ли?
    0x1EFB, // Я сказал это вслух? Это просто от неожиданности. Мне никогда не нравилась эта кличка.
    0x1F96, // Не вижу, каким образом.
    0x1FC0, // Идёт~! Ты выглядишь точно так, как я себе представляла!
    0x2023, // …
    0x2027, // Ха-ха-ха~! Да-да, ты выглядишь в точности как Хиттян!
    0x2084, // Интересно, почему все так считают…
    0x20C5, // …
    0x20C9, // Хакамити стучит пальцами по столу, привлекая внимание Миши. Затем они начинают жестикулировать так оживлённо, что движения становятся практически неразличимы.
    0x21F0, // Мише, кажется, немного трудно воспринять это всё зараз.
    0x2255, // А-ха-ха~! Ой, прости!
    0x2278, // Ситтян просит передать, что она староста класса и, если тебе нужно о чём-то узнать, можешь её спрашивать.
    0x2336, // …
    0x233A, // Как тебе школа? Мы можем показать тебе окрестности, если ты ещё не успел побродить и…{w=0.5}{nw}
    0x23E1, // ознакомиться?{w=0.5}{nw}
    0x2406, // со всем самостоятельно!
    0x2432, // Миша на мгновение спотыкается на трудном слове, невольно выделив его на фоне в целом беглого перевода.
    0x24EE, // Спасибо, это было бы здорово. Я, как приехал, сразу отправился в класс.
    0x256D, // …
    0x2571, // Ха-ха-ха~!
    0x2582, // Нехорошо! Нужно заранее как можно больше узнавать о местах, в которые собираешься отправиться. И это касается не только школы~!
    0x266A, // Всегда! Даже если это поход в магазин! Так ведь, Ситтян? Ха-ха-ха~!
    0x26DF, // Узнавать о местах, в которые отправляешься? Я так никогда не поступал, точнее никогда не заботился о таких вещах.
    0x27AD, // Я не желал этого перевода, просто кое-как мирился с ним.
    0x2812, // Я ничего не произношу вслух, и Миша делает несколько жестов, под конец пожав плечами. Что это было? Видимо, что-то обо мне.
    0x28EE, // Я чувствую себя так, будто сел мимо стула. Они улыбаются, но это её пожатие плечами неожиданно сильно меня задело.
    0x29BD, // Ты какой-то грустный, с тобой всё в порядке?
    0x2A0C, // …
    0x2A10, // Пожалуйста, не пойми меня неправильно~! Ненавижу, когда люди боятся задавать вопросы! Ведь только так и можно научиться чему-либо – спрашивая~!
    0x2B15, // Просить помощи совершенно нормально, так же как и нуждаться в ней! Прекрати выглядеть так, словно ты только что провалился на экзамене!
    0x2C0C, // Ва-ха-ха-ха~!
    0x2C22, // Хорошо.
    0x2C30, // …
    0x2C34, // А, и ещё! Тебе не обязательно обращаться к Ситтян официально – «Хакамити» или «староста», – можешь звать её просто Ситтян!
    0x2D14, // …
    0x2D18, // А-ха-ха~! Ладно, наверное это слишком нескромно. Может, «Сидзунэ» будет лучше?
    0x2DA4, // …
    0x2DA8, // Угу, угу~! «Сидзунэ» подходит!
    0x2DDE, // Хех, ладно. Мне так будет намного проще.
    0x2E26, // Мне становится гораздо спокойнее. Они кажутся столь дружелюбными, что я чувствую себя глупо из-за недавнего страха. Особенно из-за Сидзунэ, которая, как я думал, будет слишком строгой.
    0x2F75, // То есть она такая и есть. Просто не настолько, насколько я опасался.
    0x2FF0, // …!
    0x2FF5, // А? Точно, мы же ещё даже не притронулись к заданию! Надо сейчас же начинать работать, иначе Ситтян рассердится.
    0x30BE, // К тому же задание довольно большое, так что если мы не приступим сейчас, то не успеем до конца урока.
    0x3174, // Ва-ха-ха~! И это тоже!
    0x3199, // …
    0x319D, // Сидзунэ нетерпеливо на нас смотрит. Не требуется знать язык жестов, чтобы понять этот взгляд.
    0x3248, // Ладно, ладно, я понял.
    0x326F, // …
    0x3273, // После занятий мы сможем погулять вместе. Сегодня такой хороший день! Ладно~?
    0x32FE, // Над заданием действительно приходится поработать: оно весьма трудное и чересчур большое.
    0x33A3, // И всё же, начав с опозданием, мы заканчиваем раньше всех в классе. Сидзунэ и Миша и правда весьма способные.
    0x3466, // Однако они абсолютно разные. Староста спокойная и деловая, каковой и выглядит, Миша же гораздо более весёлая и легкомысленная. И совсем не такая усидчивая.
    0x3582, // По правде говоря, большую часть работы выполнили они. Мне от этого даже как-то неловко.
    0x3620, // На башне с часами бьёт колокол, возвещая конец урока. Время ланча.
    0x3698, // Мне ничего не остаётся, кроме как последовать за Мишей, которая ведёт меня в коридор и дальше, вниз по лестнице.
    0x3763, // После этого в классе повисает пауза, намекающая мне, что следует наконец что-то сказать.
    0x3804, // Ну… Я – Хисао Накай.
    0x382A, // И что ещё?
    0x383C, // Я увлекаюсь чтением и футболом. Надеюсь, что мы поладим, хоть я здесь и новенький.
    0x38D0, // А ещё что?
    0x38E2, // Я ужасно скучен. Самопредставление до невозможности банальное. Надо придумать что-нибудь ещё. Что-нибудь поинтереснее.
    0x39BD, // …В итоге я так ничего и не говорю и учитель продолжает за меня.
    0x3A30, // Впрочем, кажется, все вполне удовлетворены и той малостью, что я рассказал. Несколько девочек перешёптываются, бросая на меня взгляды. Могло быть и хуже.
    0x3B47, // …
    0x3B4B, // После этого в классе повисает пауза, которую никто не торопится прервать.
    0x3BD2, // Учитель понимает, что пора сказать что-нибудь ещё. Он неразборчиво произносит моё имя и умолкает, потеряв настрой.
    0x3CA3, // После этого он пытается рассказать обо мне классу, но никто не проявляет особого интереса.
    0x3D49, // Может быть, мне стоило представиться самому?
    0x3D9B, // Вероятно, поняв, что толком ничего обо мне не знает, он заканчивает тем, что снова перевирает моё имя и просит написать его на доске.
    0x3E8B, // Я делаю это и поворачиваюсь к классу, чувствуя себя идиотом.
    0x3EF9, // Похоже, он очень интересный человек, правда~?
    0x3F4B, // Миша окидывает меня странным взглядом, а затем продолжает.
    0x3FB7, // Мы о нём почти ничего не знаем, но, наверное, узнаем позже.
    0x4020, // Всё же мне следовало рассказать о себе самостоятельно. Что угодно – это позволило бы сложить первое впечатление о себе куда лучше, чем невнятное бормотание учителя и путаница с именем.
};

#endif // KS_A1_MONDAY_ENTER_STAGE_LEFT_RU_TL_INDEX