#ifndef KS_A1_SATURDAY_SUPPORT_RU_TL_INDEX
#define KS_A1_SATURDAY_SUPPORT_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_4C687FDF_ru_intl[] = {
    0x0000, // На утренний субботний урок одноклассники являются с красными от недосыпания глазами, будто работали всю ночь напролёт.
    0x00DC, // Когда на подготовку остаётся всего один день, это неудивительно. Хорошо, что страдать нам на уроке только до большой перемены, а потом мы станем хозяевами своего времени.
    0x0213, // Муто, покачиваясь, усталой походкой входит в класс. Полагаю, ученики – не единственные здесь, кто любит весело проводить вечер пятницы.
    0x030B, // Не говоря ни слова, он корябает на доске номера страниц и вопросов и плюхается за свой стол.
    0x03B2, // Это совсем на него не похоже, но, кажется, никто из класса не возражает.
    0x0433, // Все молча листают учебники и принимаются за работу. Не желая выделяться, я поступаю так же.
    0x04D9, // Усталость делает всех в классе замкнутыми; помимо шуршания бумаги, сейчас не слышно ни писка.
    0x0584, // Отчасти вносит свой вклад и то, что два места рядом со мной сейчас пустые. По какой-то причине Миша и Сидзунэ отсутствуют – возможно, они выполняют связанную с фестивалем работу в Совете.
    0x06D9, // Без Миши в классе очень спокойно.
    0x0716, // Интересно, она от рождения такая шумная или пытается «возместить» отсутствие голоса у Сидзунэ?
    0x07C5, // Накай, можно тебя на минутку?
    0x07FA, // Я так поглощён мыслями о Мише, что не замечаю, как Муто подходит к моей парте.
    0x0886, // Конечно… слушаю.
    0x08A6, // Наверное, лучше будет поговорить вне класса…
    0x08FA, // Что-то мне это не очень нравится, но я встаю и выхожу вслед за ним.
    0x0971, // Уже стоя в коридоре, Муто чешет затылок, собираясь с мыслями. Не понимая, что происходит, я просто стою и жду.
    0x0A36, // Тогда перейдём ко второму вопросу: как тебе учёба? Я понимаю, что ты довольно долго не занимался. Мы не слишком далеко ушли?
    0x0B16, // Нет, не думаю. Я старался не отставать, пока лежал в больнице, поэтому догнать было не так сложно.
    0x0BC6, // Муто задумчиво постукивает себя по подбородку и приподнимает бровь, переваривая информацию.
    0x0C71, // Вот оно как… Всё же остались ещё ученики, осознающие важность образования…
    0x0CFD, // Это, конечно, громко сказано. Я просто пытался чем-то занять себя, сидя в крохотной жизнеподдерживающей тюрьме.
    0x0DC8, // Ну да. В таких вещах отставать нельзя, так ведь?
    0x0E1E, // Именно так. Один неверный шаг в этом мире – и ты останешься далеко позади, верно?
    0x0EB1, // Э-э, да. Не хотел бы я, чтобы такое случилось.
    0x0F01, // Конечно, не хотел бы. Научные открытия совершают каждую неделю. Большинство из них ничего не дают простому обывателю, но любое из них может стать ключевым на пути к Следующему Великому Открытию.
    0x1064, // Я это запомню…
    0x1080, // На этом, очевидно, Серьёзный Разговор Муто заканчивается, и он возвращается к своему обычному, слегка рассеянному подходу к жизни.
    0x116F, // Вспоминая предыдущие разговоры с ним, я думаю, таким он мне нравится больше. Он чуть более предсказуем благодаря своей непредсказуемости.
    0x126C, // Ну, думаю, сказано было достаточно. Давай вернёмся в класс.
    0x12D7, // От этого предложения я испытываю ни с чем не соизмеримое облегчение.
    0x1355, // Конечно. Вы ведь главный, верно?
    0x138F, // Муто на секунду останавливается.
    0x13CC, // Кажется, никто из учеников мне ещё такого не говорил.
    0x142D, // Я на мгновение задумываюсь, стоит ли на это ответить, но что-то глубоко внутри подсказывает мне, что лучше бы заткнуться и вернуться в класс.
    0x152D, // Несколько ребят вздрагивает от звука открывающейся двери, тут же пытаясь притвориться работающими над заданием.
    0x15FD, // Некоторые же так и продолжают дремать, положив головы на парты. К счастью, Муто их даже не замечает.
    0x16B2, // Вернувшись за свой стол, он достаёт из выдвижного ящика научный журнал. Наверное, это из-за нашего с ним разговора.
    0x1783, // В классе воцаряется та же почти полная тишина, в которой мы с Муто его оставляли, уходя на разговор.
    0x1838, // В комнате витают смешанные чувства усталости и ожидания. Каждый ожидает либо шанса отдохнуть, либо возможности приступить к последней фазе приготовлений.
    0x1955, // Настенные часы лениво отсчитывают время до конца урока, пока наконец не звонит колокол, освобождающий от мучений.
    0x1A26, // Пока вы не ушли, напоминаю, что в понедельник я жду от вас ответы к задачам.
    0x1AAE, // Все как один вздыхают, тут же жалея о потраченном зря времени на уроке, но всё ещё остро ощущая давление более насущных задач.
    0x1B93, // Кабинет в мгновение ока пустеет, поскольку все спешат приступить к последним приготовлениям перед праздником.
    0x1C5F, // Я остаюсь и пытаюсь быстро дорешать задачи, чтобы не беспокоиться о них остаток выходных, потому что завтра фестиваль и всё такое.
    0x1D4D, // Кроме меня в классе задерживается только Ханако, вероятно ожидающая Лилли.
    0x1DD7, // Странно, что Лилли идёт аж до нашего класса, чтобы забрать Ханако. Ей приходится делать крюк, и мне кажется, что передвигаться по школе для неё всё же несколько труднее, чем для Ханако.
    0x1F25, // Но это не моё дело, поэтому я, естественно, не спрашиваю Ханако об этом.
    0x1FA6, // Несмотря на относительную близость наших мест, никто из нас не пытается завязать беседу на какую-нибудь тему, и в классе воцаряется гнетущая тишина.
    0x20B6, // Время проходит в молчании. Те пятнадцать минут, что мы вот так сидим, по ощущениям тянутся гораздо дольше. Я листаю свою тетрадь. Ханако листает свою книгу.
    0x21D1, // Грифель моего механического карандаша рассыпается о бумагу, как раз когда я собираюсь дописать абзац.
    0x228D, // Звук моего раздражённого вздоха и следующая за ним возня, кажется, рушат атмосферу.
    0x2326, // Ханако решительно избегает смотреть в мою сторону.
    0x2384, // Вскоре в дверях появляется высокая фигура Лилли.
    0x23DE, // Ханако?
    0x23EC, // Ханако оказывается достаточно того, что её позвали по имени, чтобы вскочить и подбежать к Лилли.
    0x249C, // Они недолго спокойно разговаривают, затем Лилли уходит, а Ханако возвращается в класс и снова садится за парту.
    0x2568, // Из чистого любопытства я краем глаза слежу за ней: почему же они разделились?
    0x25F5, // Пару минут она просто сидит, подперев рукой подбородок и уныло уставившись в парту.
    0x268E, // Однако скука её одолевает, и она вынимает из портфеля тонкую книжку.
    0x270B, // Кстати, это не та, которую, как я видел, она читала в библиотеке. Должно быть, она быстро читает, раз меняет их так часто.
    0x27E3, // Фельдшер сказал, что у тебя недавно случился инцидент.
    0x2847, // А, так вот в чём дело.
    0x286D, // Ну, вроде того, но здесь не о чем волноваться.
    0x28BF, // Вообще-то есть о чём. Следует волноваться обо всём, что подвергает опасности твоё здоровье.
    0x2966, // Мы здесь изо всех сил стараемся подготовить тебя к самостоятельной жизни. А к подготовке относится знание пределов твоих возможностей и того, как с ними обходиться.
    0x2A94, // С моей стороны было бы беспечно не поговорить с тобой об этом.
    0x2B05, // Хорошо, я понял. Мне жаль.
    0x2B33, // Муто с недовольным видом закрывает глаза, и мне в голову приходит мысль, что это, возможно, был не лучший ответ.
    0x2BFD, // Что-то мне подсказывает, что ты не сожалеешь. Притворяйся сколько хочешь, но это – не обычная школа.
    0x2CB3, // Многие люди потратили много времени, усилий и денег, чтобы ты, как и любой другой ученик здесь, получил такой же уровень образования, как и твои ровесники.
    0x2DCC, // Сводить на нет все эти усилия, пренебрегая советом, – а тем более медицинским советом, – просто эгоистично.
    0x2E91, // Я не уверен, действительно ли он так считает или же просто разыгрывает неоднократно отрепетированную сцену наставления ученика на путь истинный. Но в любом случае это работает.
    0x2FD6, // Хорошо, я понял. Я ещё не освоился здесь, поэтому прошу прощения. Теперь я знаю пределы своих возможностей и постараюсь впредь их придерживаться.
    0x30DF, // Муто одобрительно улыбается, удовлетворённый тем, что смог до меня достучаться.
    0x3172, // Ну, рассказывай, как дела?
    0x31A1, // Дела?
    0x31AB, // Я знаю, что Муто умеет говорить загадками, но это переходит все границы.
    0x322E, // Ну да. Просто уже прошла неделя, как ты осваиваешься здесь, поэтому я и спрашиваю.
    0x32C2, // Э… Думаю, всё нормально.
    0x32EF, // Ясно. А как твоё… состояние?
    0x3323, // Пауза перед «состоянием» кажется немного лишней.
    0x337E, // Пока никаких проблем не было.
    0x33B4, // По лицу Муто проскальзывает тень облегчения.
    0x3407, // Хорошо. Это хорошо. Школьный фельдшер волновался, что ты, возможно, будешь слишком перенапрягаться.
    0x34BD, // Он попросил меня присматривать за тобой, когда сам не может.
    0x352B, // Понятно…
    0x353D, // Я бы попросил, чтобы ты не отмахивался от нас. Несмотря на то что мы пытаемся дать тебе уровень образования, который ты мог бы получить в обычной школе, тебе нужно осознавать, что у твоих возможностей есть границы.
    0x36C1, // Наша цель – удостовериться в том, что ты осознаёшь, где твой предел и как раскрыть свой потенциал, не выходя за него. Понимаешь, к чему я веду?
    0x37C2, // Наверное. В смысле, я не собираюсь делать глупостей.
    0x3821, // Ну, думаю, для начала уже хорошо.
    0x385C, // Минут через десять постоянного ёрзания за партой и попыток начать читать, Ханако закрывает книгу и тоже уходит.
    0x3929, // Пора уйти и мне, поскольку задание я почти закончил, а больше в классе делать нечего.
    0x39C3, // Не испытывая особого желания чем-либо заниматься, я просто направляюсь прямо к себе в комнату и провожу остаток дня за чтением.
};

#endif // KS_A1_SATURDAY_SUPPORT_RU_TL_INDEX