#ifndef KS_A1_WEDNESDAY_THE_OTHER_GREEN_RU_TL_INDEX
#define KS_A1_WEDNESDAY_THE_OTHER_GREEN_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_1B8DE187_ru_intl[] = {
    0x0000, // Мы выходим из главного здания, Рин ведёт меня в сторону общежитий.
    0x0079, // Мы останавливаемся у небольшого клочка зелени перед зданием общежития.
    0x00FD, // Оно построено на небольшом возвышении, окружено стеной и несколькими деревьями, которые всем каждый раз приходится обходить. Это, наверное, единственный просчёт в планировке школы.
    0x024A, // Вся стена, сложенная из таких же кирпичей, что и само здание, покрыта своего рода картиной.
    0x02EF, // Большая её часть – не более, чем набросок – быстрые мазки, сделанные чёрной и белой красками по серой штукатурке, покрывающей практически всю длину стены, – но некоторые места выглядят более законченными.
    0x0468, // Тут лица людей, ноги и руки. Однако я не могу с уверенностью сказать, что именно изображает картина в целом.
    0x052B, // Стопки чего-то, напоминающего банки с красками, штабелями располагаются на земле вдоль стены.
    0x05D7, // Видишь, работа над левой частью едва сдвинулась.
    0x0630, // Всё потому, что вчера у меня не было настроения и я сдалась, а взамен пошла медитировать. И тут внезапно настало утро.
    0x0705, // Надо бы мне над ней поработать, но ребята из кружка рисования помогают с фонами и основными поверхностями лишь от случая к случаю – вот в чём проблема.
    0x0819, // Легче рисовать большие участки, когда много народу, с руками.
    0x0889, // Им проще дотянуться до верха, и дело идёт быстрее.
    0x08E4, // Совсем отходя от прежней темы, она машет рукой… ну, или той её частью, которая у неё есть, чтобы наглядно продемонстрировать, хотя я и так уже всё понял.
    0x09F8, // Её белый рукав развевается, и мне приходит в голову мысль, что зрелище могло выйти печальнее, чем получилось.
    0x0ABF, // Но всё же это заставляет меня чувствовать себя не в своей тарелке, как и практически любое напоминание об… особенностях учеников «Ямаку», которые я получал в течение последних нескольких дней.
    0x0C22, // Девушка, конечно, не замечает моих мрачных чувств, как и того, что я перестал её слушать… и продолжает болтать.
    0x0CEC, // …и поэтому я пытаюсь выяснить, есть ли что-то, что нужно выяснять, и выяснить это прежде, чем будет слишком поздно и всякая надежда будет потеряна.
    0x0DF7, // А почему надежда может потеряться?
    0x0E37, // Потому что краску надо нанести, потом она должна высохнуть, а потом быть закрашена слоем другой краски.
    0x0EF4, // На это нужно время.
    0x0F17, // Она наконец останавливается, по-видимому думая, что пришла к какому-то логическому заключению.
    0x0FC5, // Полагаю, лучше начать сначала.
    0x0FFD, // Так, значит, это твой проект? Ты сделала… это?
    0x1050, // Да. Да.
    0x105C, // Всё целиком?
    0x1073, // Да.
    0x1079, // Очень здорово. Но…
    0x109C, // Я запинаюсь, вдруг почувствовав, что забрёл прямо в центр минного поля неполиткорректности.
    0x1145, // Всё нормально, можешь сказать это вслух. Может быть, я даже не разозлюсь.
    0x11C9, // Я сильно краснею. Даже не знаю, что правильнее будет сказать, если вообще стоит говорить хоть что-то. Однако кажется, что я куда более чувствительный, чем Рин.
    0x12E8, // Неловкая ситуация.
    0x130B, // Ты не хочешь спросить?
    0x1334, // …Как ты рисуешь без рук?
    0x1361, // Видишь, со мной легко говорить, правда? Рисую ногами.
    0x13C1, // Я, в общем-то, догадался, но разве это не трудно?
    0x1417, // Ты догадлив. Как бы то ни было, думаю, что не трудно. Но, может быть, я просто уже привыкла.
    0x14B8, // Я и представить себе не мог, что она может быть художницей, но, вспомнив, как мастерски она управлялась с вилкой, решаю, что и рисование, возможно, не представляет проблем.
    0x15EE, // Больше по этому поводу нам сказать нечего.
    0x163C, // А при свете дня довольно неплохо. Я боялась, что будет выглядеть слишком плоско, но в конце концов оказалось, что нет.
    0x1711, // Вообще, мне кажется, она довольно интересная. Я хотела посмотреть, как она выглядит при тусклом свете. Как по-твоему, не слишком плоская?
    0x1809, // Э… ну, картины обычно плоские.
    0x1841, // Не в этом смысле плоская. Понимаешь, плоская. Как некоторые люди – без содержимого, без мяса там, где оно должно быть.
    0x1916, // Я знаю нескольких девочек, у которых—{w=.5}{nw}
    0x1966, // Ладно, я понял. Но я ничем не могу помочь, потому что не слишком хорошо разбираюсь в искусстве. Я не способен перечислить так уж много художников или специальных терминов.
    0x1A9D, // Так что мне нечего сказать.
    0x1ACF, // Рин пожимает плечами, как бы говоря: «Ну, как знаешь», – и смотрит в небо, как будто выискивая там что-то.
    0x1B8C, // Я не думала, что буду сегодня над ней работать, но если ты мне поможешь с красками, то дотемна успею что-нибудь сделать.
    0x1C64, // Я хотела раздобыть галогенную лампу, как на стадионах, но тут нет ни одной.
    0x1CEC, // Рин быстро привлекает меня к работе, как и Сидзунэ. Складывается ощущение, что фестиваль – действительно серьёзное мероприятие, для которого дорога каждая пара рук.
    0x1E1B, // Почему бы и нет? Правда, не знаю, смогу ли я тебе чем-то помочь.
    0x1E8B, // Просто посмешиваешь краски, ты это сможешь. Наверное. У тебя есть проблемы с моторикой, как у… ну, знаешь, людей с такими проблемами?
    0x1F7C, // Может быть, церебральный паралич?
    0x1FBA, // Вроде бы нет.
    0x1FD2, // Ясно. Твоя сердечная болячка на это не влияет.
    0x2026, // Ни с того ни с сего она бросает на меня лукавый взгляд.
    0x2089, // Никоим образом.
    0x20A6, // Ну, тогда начнём.
    0x20C5, // И вот она садится на пустой деревянный ящик и совершенно естественным жестом берёт толстую кисть босой правой ногой.
    0x219C, // Я открываю несколько банок и выливаю немного их содержимого в пустые чаши для смешивания.
    0x2241, // Краска густо струится из банки в чашу, как патока.
    0x229C, // Я мешаю их, создавая забавные, гипнотизирующего вида спиральные узоры, которые быстро тают друг в друге, образуя новый однородный цвет.
    0x2394, // Рин приступает к работе, то и дело прося у меня той или иной помощи.
    0x240E, // …
    0x2412, // Находить разные кисти легко, а вот смешивать краски для получения определённого тона, который эта девушка, вероятно, видит у себя в голове, кажется сущим адом.
    0x2534, // Она хочет точности до последнего миллиметра, прежде чем удовлетворяется, но её инструкции по меньшей мере туманны.
    0x2607, // Добавь пол-ливка зелёного.
    0x2638, // Я приседаю подобрать банку ярко-зелёной краски.
    0x2690, // Другого зелёного. Этого зелёного.
    0x26CE, // Я аккуратно наливаю немного «другого зелёного» в чашу.
    0x2733, // Нет, это почти целый ливок. Больше белого.
    0x277F, // А зелёный сюда вообще подойдёт?
    0x27B9, // Без понятия. Это же ты у нас художник.
    0x27FD, // В уголках её губ появляется тень улыбки.
    0x2847, // У тебя нет своего мнения?
    0x2875, // Нет, просто не знаю, как будет лучше.
    0x28B7, // Это ничего, потому что я только что поняла, как будет лучше. Добавь ещё белого.
    0x2945, // После этого восклицания я наливаю немного белого в чашу и перемешиваю. Цвет становится чуть-чуть… белее.
    0x2A06, // Так не пойдёт. Он должен быть как… как цвет, когда ты просыпаешься и {b}знаешь{/b}, что ты видел во сне смысл жизни, но не можешь его вспомнить.
    0x2B03, // Может быть, это жёлтый…
    0x2B2F, // …
    0x2B33, // Несмотря на неспособность намешать цвет «смены времён года» или ещё какой-нибудь вздор, который от меня требуется, я наслаждаюсь процессом больше, чем мог ожидать.
    0x2C5F, // Рождение картины на оштукатуренной стене похоже на чудо.
    0x2CC8, // Я провожу время между смешиванием красок, сидя на тротуаре и просто созерцая её работу.
    0x2D68, // Поначалу возникает чувство, будто я стою у неё над душой, вторгаюсь в интимность акта творчества, но Рин, кажется, нет до этого никакого дела. Наверное, я сам себе надумал, что могу ей помешать.
    0x2EC5, // От неё исходит совсем иная аура, когда она терпеливо работает над деталями, покрывая слои краски новыми слоями и уверенно двигает ногой вдоль стены, добавляя новые формы.
    0x2FFD, // Когда мне удаётся добиться приемлемого цвета смеси красок, улыбка, которая при этом возникает на её лице, становится, как ни странно, наградой для меня.
    0x3112, // Не считая редких реплик во время обсуждения смесей, никто из нас подолгу не произносит ни слова.
    0x31C2, // И даже эти короткие дискуссии вскоре превращаются в кодовый язык: мы оба придумываем и используем странные импровизированные слова для обозначения разных красок и оттенков.
    0x3302, // Как если бы была какая-то необходимость беречь слова, дыхание и звуки.
    0x3382, // Мы задерживаемся здесь до позднего вечера, пока не становится слишком темно, чтобы рисовать.
};

#endif // KS_A1_WEDNESDAY_THE_OTHER_GREEN_RU_TL_INDEX