#ifndef KS_A1_THURSDAY_SOAP_RU_TL_INDEX
#define KS_A1_THURSDAY_SOAP_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_DA59C7FA_ru_intl[] = {
    0x0000, // Я отправляюсь в общежитие, чтобы помыться и сменить одежду.
    0x006D, // Меня одолевает соблазн принять по-настоящему долгий горячий душ – эта беготня всерьёз меня утомила, – но мне хочется попасть в класс до того, как в коридорах начнётся утренняя суматоха.
    0x01C2, // …И всё же в итоге торчу в душе дольше, чем собирался. Вытершись полотенцем, я выхожу из душевой кабинки.
    0x027F, // Сквозь густую пелену пара ко мне приближается знакомый силуэт, пробуждая во мне наихудшие предчувствия.
    0x033F, // Как оно?
    0x034E, // Эй, хватит меня так пугать! Что ты тут забыл?
    0x039E, // Это я у тебя должен спросить. Чувак, я тебя повсюду искал.
    0x0406, // Где это – «повсюду»?
    0x042C, // Я решаю не уточнять, не искал ли он меня прямо так, в чём мать родила.
    0x04A8, // Вспомнив, что я всё ещё не одет, я поспешно прикрываюсь рубашкой, но Кендзи, кажется, всё равно ничего не видит.
    0x0571, // Его очки напрочь запотели. Но почему он их не протирает? Неужели у него настолько плохое зрение, что буквально всё видится как в плотном тумане?
    0x0677, // Ну, знаешь, в твоей комнате… и, в общем-то, всё. Но ради этого мне, как видишь, пришлось встать с постели. Ладно, ближе к делу. Одолжишь мне немного денег?
    0x0789, // Он рассеянно водит взглядом по сторонам, стараясь выглядеть как можно более буднично. Но это бесполезно, потому что его намерения столь же прозрачны, как и его огромные очки.
    0x08C7, // Мне довольно неловко оттого, что я веду беседу как ни в чём не бывало, стоя перед ним нагишом.
    0x0970, // И ещё больше смущает то, что он этого не видит. Да к тому же он и сам без одежды.
    0x09FE, // Я пытаюсь отогнать это неловкое чувство, но безуспешно.
    0x0A64, // Денег? Запросто.
    0x0A82, // Супер.
    0x0A8E, // Постой-ка, а зачем они тебе?
    0x0AC0, // Э…
    0x0AC6, // Можешь одолжить их мне просто потому, что я был так любезен и не стал шарить по твоим карманам, пока ты был в душе? Я мог, но проявил выдержку. Поэтому мои помыслы, как видишь, чисты. Так что будь другом.
    0x0C31, // Помыслы человека, который с трудом сдерживает в себе желание обшарить чужие карманы, вряд ли можно назвать чистыми. Да и скрытность Кендзи напрочь отбивает желание помогать ему. Прямо так я ему и говорю.
    0x0DA4, // Ты меня серьёзно обидел, чувак, но, думаю, мне придётся принять твои правила. Я хочу заказать пиццу, и у меня набралась почти вся сумма. Теперь мне нужна твоя финансовая поддержка.
    0x0EE9, // Ты ведь поделишься, правда?
    0x0F1B, // Нет.
    0x0F23, // Ты серьёзно?
    0x0F3A, // Ага. Я бы поделился, но у тебя уроки и нет времени на пиццу.
    0x0FA4, // А у тебя?!
    0x0FB5, // А я не пойду. Мне надо дождаться пиццу и заплатить курьеру. А потом съесть её. Это непросто. Нужно забирать пиццу украдкой, иначе все тебя увидят. Тебя и пиццу. И каждый попросит поделиться.
    0x110B, // Там, снаружи, жестокий мир, в котором каждый норовит отхватить кусок. И ты рискуешь остаться один, без пиццы, в этом суровом и равнодушном мире. Поверь, знаю по своему опыту.
    0x1244, // Каждый день я мечтаю о возмездии. Этим подлецам не удастся уйти от правосудия. Когда они осмелятся заказать пиццу, я буду рядом!
    0x132D, // Кендзи грозно поднимает руку, будто собирается начать вершить правосудие прямо здесь и сейчас.
    0x13DC, // Но сейчас мне нужно всего-то четыреста иен. Пожалуйста! Ты моя единственная надежда! Чтобы купить пиццу в магазине, придётся идти слишком далеко!
    0x14E5, // Я стараюсь не покидать комнату без крайней необходимости. Сейчас я расскажу тебе, что случилось, когда я в последний раз вышел, забыв принять все меры предосторожности.
    0x1619, // Я был снаружи. Не помню, что я там делал. Что-то. Наверное, стоял. Может быть, размышляя при этом, как я там оказался.
    0x16E8, // И вдруг, ни с того ни с сего, на меня свалилась эта напасть.
    0x1752, // Словно вспышка молнии, рассёкшая небо, словно нож, стремительно разрезавший пополам сэндвич, пролетавшая мимо птица осквернила мою макушку своим дерьмом.
    0x186E, // Это был второй раз за мою жизнь, когда я испытал столь ужасное потрясение.
    0x18F5, // А какой был первый?
    0x1918, // Но он продолжает толкать свою речь дальше, не обращая на меня никакого внимания. Мне хочется его встряхнуть. Он что, боится потерять нить рассказа? Буду считать так, хотя, скорее всего, он просто не услышал моего вопроса.
    0x1AA8, // Это было словно в опенинге какого-нибудь аниме, когда главный чувак сражается со своим соперником и они в полёте скрещивают мечи, а всё вокруг пылает и взрывается, и всё это в самых пафосных ракурсах.
    0x1C14, // Вот всё было точно так же, только с помётом.
    0x1C63, // Ясно.
    0x1C6D, // Поэтому мне нужны деньги. Тысячи иен должно хватить. Пожалуйста, чувак, не бросай меня в беде!
    0x1D17, // Ты же говорил, что нужно четыреста.
    0x1D57, // …Ладно.
    0x1D66, // Что?
    0x1D6E, // Ладно, я тебе их верну. Клянусь.
    0x1DA7, // Естественно, ведь это и значит «брать в долг».
    0x1DFB, // Но я точно не знаю, когда смогу их вернуть.
    0x1E48, // У тебя неделя.
    0x1E62, // А-а-ар-р-р-г-г-г-х-х-х!…
    0x1E89, // Кендзи вздрагивает всем телом и воет, как умирающая корова, при этом его достоинство свободно болтается, ничем не прикрытое, что ужасает ещё больше.
    0x1F98, // Не жмись ты так насчёт денег, мы ведь братья по оружию, чувак. Мужикам и так живётся несладко. Ты знаешь, что мужчины-порнозвёзды зарабатывают в два раза меньше, чем женщины-порнозвёзды?
    0x20E9, // Ну и что, ты же не порнозвезда.
    0x2120, // А что, если я на стороне подрабатываю порнозвездой, пытаясь свести концы с концами, параллельно ведя борьбу с заговором феминисток? А ты, гад, со мной и крохами не можешь поделиться. Никто меня не понимает. Никто.
    0x22A1, // Разве феминистки не выступают против порнографии?
    0x22FE, // Опять ты про этот заговор?
    0x232E, // Это очень важно. Тебе, может, и пофиг, но, чувак, это действительно серьёзно. Феминистки – самый опасный враг, с которым сталкивалось человечество. Если будешь неосторожен, однажды – бац! – проснёшься с ножом в горле.
    0x24B8, // Как же ты проснёшься, если тебя во сне закололи?
    0x250F, // Женщины не особо умеют закалывать.
    0x254F, // Ты же говорил, что их нельзя недооценивать.
    0x259E, // Ну, я имел в виду, нельзя недооценивать их в целом. Поодиночке они не опасны, но, если бы началась война, где с одной стороны оказались бы мужчины, а с другой – феминистки, вот тогда начались бы неприятности.
    0x2714, // Грядёт день, когда все феминистки мира выйдут из своей сверхсекретной центральной международной штаб-квартиры и скажут: «Началось, ублюдки!»
    0x2818, // Это нелепо. Где, по-твоему, на планете можно спрятать крепость, которая вместила бы разом всех феминисток мира?
    0x28E2, // А кто сказал, что она на нашей планете?
    0x2928, // Я отворачиваюсь к зеркалу и начинаю строить гримасы, пытаясь найти ту, что наиболее точно выражала бы моё отношение ко всему этому бреду. Всё равно Кендзи меня не видит.
    0x2A5C, // Это, увы, также означает, что он продолжает нести всякую околесицу.
    0x2AD6, // Да, идёт война. Великая война, о которой пока знают лишь немногие, но скоро она захлестнёт весь мир! И тогда наступит черёд выбирать сторону. Мы должны будем выстоять. На самом деле это уже происходит.
    0x2C41, // Представь себе эту кровавую баню. Бесконечную битву без чести и жалости.
    0x2CC6, // И я был близок к тому, чтобы сдаться, когда подумал, что моё дело безнадёжно… Когда устал от ежедневной борьбы… Когда я спутал отключение электричества с нашествием феминисток и решил, что конец близок…
    0x2E3B, // Но потом понял, что если я сдамся, то всё будет кончено, и я такой: «Ого!» – и решил, что нужно взяться за дело всерьёз. Потому что я – последний здравомыслящий человек в безумном мире. Выстоять – мой долг.
    0x2FAD, // Хреновое, должно быть, сопротивление, раз оно целиком и полностью зависит от одного парня, голышом разглагольствующего посреди душевой о коварных заговорах мирового масштаба.
    0x30F0, // Так ты одолжишь мне денег?
    0x3120, // Он продолжает загораживать выход. Мне остаётся лишь согласиться, потому что уже становится прохладно и я хочу побыстрее пойти в класс.
    0x3217, // Зашибись! Спасибо, чувак. Нам как-нибудь надо будет сходить с тобой в боулинг.
    0x32A4, // Боулинг?
    0x32B4, // Да, это величайший вид спорта. Знаешь почему? Женщин-боулеров практически не существует. Боулинг – лишь для настоящих мужчин.
    0x339A, // Как думаешь, какую из рубашек для боулинга мне лучше надеть: розовую, к которой у меня есть обувь в цвет, или светло-зелёную с цветочными узорами?
    0x34A2, // У тебя есть специальные рубашки для боулинга?
    0x34F6, // Возможно.
    0x3508, // Ладно. В общем, не забудь вернуть деньги.
    0x3552, // Я ведь могу расплатиться натурой, так?
    0x3598, // Мне некогда уточнять, что он имеет в виду.
    0x35E4, // Не знаю. Мне пора на урок, а ты мешаешь мне пройти.
    0x363E, // А. Прости. Не буду задерживать, у самого дел по горло. Час пробил!
    0x36B3, // Какой час?
    0x36C6, // Мне ужасно нравится эта фраза, люблю говорить её по любому поводу.
    0x373F, // Но сейчас тот самый час и в самом деле пробил.
    0x3792, // Да какой час-то?
    0x37AF, // Мне нужно пописать. Выметайся.
    0x37E7, // Что я и собирался сделать. И вообще, к чему ты это? Душевая-то большая.
    0x3865, // И что? Мне надо быть одному, иначе я не смогу сходить. Начинаю нервничать в присутствии других…
    0x3913, // Ясно. Но что, если кто-нибудь зайдёт?
    0x3955, // …
    0x3959, // Я что-нибудь придумаю.
    0x3982, // Я корчу одну из гримас, которые практиковал перед зеркалом, но, отражённая в его очках, она выглядит глупо. Впрочем, он, как всегда, ничего не замечает, поэтому я одеваюсь и поспешно возвращаюсь в комнату, чувствуя себя так, будто с момента моего пробуждения прошла целая вечность.
    0x3B7F, // Потраченное на него время уже не вернуть. Я ему как-нибудь отплачу за это.
    0x3C05, // Но сейчас надо спешить на урок.
};

#endif // KS_A1_THURSDAY_SOAP_RU_TL_INDEX