#ifndef KS_A1C7O2_RU_TL_INDEX
#define KS_A1C7O2_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1E740_ru_intl[] = {
    0x0000, // Может быть, но… то есть…
    0x002E, // После моей фразы в его глазах появляется что-то похожее на угрозу, отчего мне хочется взять свои слова обратно.
    0x00F9, // То есть я не знаю… я всё ещё пытаюсь привыкнуть к школе.
    0x015F, // Однако я обещаю попробовать.
    0x0194, // Звучит не очень убедительно, Хисао. Совет первый: медработники не любят, когда к их рекомендациям относятся несерьёзно.
    0x026F, // Да что с ним такое? Как будто день или два сыграют большую роль.
    0x02E2, // Я и в больнице ничего не делал.
    0x031A, // Да, хорошо. Извините.
};

#endif // KS_A1C7O2_RU_TL_INDEX