#ifndef KS_A1C2O3_RU_TL_INDEX
#define KS_A1C2O3_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EED1D47C_ru_intl[] = {
    0x0000, // Честно говоря, на ум ничего не приходит.
    0x0049, // О! Значит, мы были хорошими проводниками, правда, правда~?
    0x00B1, // …
    0x00B5, // Э… Как скажешь…
    0x00D4, // Миша радостно улыбается и быстро переводит мои слова, после чего улыбка появляется и на лице Сидзунэ.
    0x018E, // На их избыточный энтузиазм я качаю головой и сосредотачиваюсь на еде.
};

#endif // KS_A1C2O3_RU_TL_INDEX