#ifndef KS_A1_TUESDAY_RISK_VS_REWARD_RU_TL_INDEX
#define KS_A1_TUESDAY_RISK_VS_REWARD_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_7B388FC9_ru_intl[] = {
    0x0000, // После занятий Сидзунэ и Миша настигают и окружают меня в вестибюле первого этажа, отрезав пути к отступлению с обоих флангов.
    0x00E6, // Я немного уязвлён, хотя и подумывал о побеге. Тем не менее меня настораживает тот факт, что им приходится быть настолько бдительными, – видимо, от них вот так сбежало уже немало народу.
    0x0236, // Что за конвой? Я чувствую себя неуютно.
    0x027D, // Словно опасный преступник, сопровождаемый в камеру.
    0x02DD, // Ва-ха-ха-ха! Что не так, Хиттян?
    0x0314, // …
    0x0318, // Вот-вот, мы же просто собирались поиграть в «Риск», забыл?
    0x0381, // Не знаю, Миша, это выглядит зловеще. Я начинаю думать, что, как только мы сядем играть, вы свяжете меня и будете пытать, пока я не стану молить о приёме в Школьный совет.
    0x04B0, // Это, конечно, маловероятно, но всё же… От них как будто всего можно ожидать…
    0x053C, // Добраться до места несложно: всего два поворота – и мы уже у кабинета Совета.
    0x05C9, // И это всё? Мы уже на месте? Мне кажется, вы, ребята, перестарались с конвоем.
    0x0651, // …
    0x0655, // Неправда, Хиттян. Ситтян говорит, что, когда жизнь человека под угрозой, он может проявить чудеса в плане скорости бега.
    0x072F, // «Жизнь под угрозой»?
    0x0755, // Миша, не меняясь в лице, что-то радостно жестикулирует Сидзунэ, и та, нацепив маску загадочности, прячет руки за спину, принимая самодовольный вид.
    0x0860, // М-м~ Хм-хм-хм~…
    0x087A, // Миша начинает весело напевать, притворяясь, что не услышала меня. Прекрати! У тебя, в отличие от Сидзунэ, нет оправданий!
    0x0955, // Сидзунэ открывает дверь в кабинет Школьного совета – просторную комнату со строгой обстановкой безо всяких излишеств.
    0x0A31, // В центре стоит большой стол, окружённый стульями, а чуть в стороне – стол поменьше, который, как я понимаю, принадлежит Сидзунэ. Ещё несколько парт со стульями стоят вдоль стены, вероятно просто на всякий случай.
    0x0BB3, // Кроме этой мебели, комнате практически нечем похвастаться. Пара шкафов и полок, набитых старыми школьными документами и папками, – вот, в общем-то, и всё.
    0x0CCB, // Какое мрачное помещение. Могли бы хоть что-нибудь вроде горшочка с цветами поставить. Но больше всего бросается в глаза то, что мы здесь одни.
    0x0DCD, // Мы слишком рано?
    0x0DEB, // …
    0x0DEF, // Нет~.
    0x0DF8, // Что значит «нет»? Сегодня, кроме нас, больше никто не придёт?
    0x0E66, // …
    0x0E6A, // Так точно~.
    0x0E7E, // Прежде чем я успеваю спросить, почему так получилось, Сидзунэ очень энергично хлопает в ладоши.
    0x0F2D, // …
    0x0F31, // Хиттян, давай играть в «Риск»! Ты ведь обещал, правда? Значит, должен сдержать слово~!
    0x0FCB, // Ха-ха-ха~! Да, да, да~! Хочешь узнать правила? Я расскажу, пока мы тут всё готовим!
    0x105A, // В это время Сидзунэ достаёт из шкафа нечто, напоминающее настольную игру, и бросает на стол.
    0x1102, // Выглядит игра, пожалуй, довольно интересно.
    0x1152, // Миша начинает с несвойственной ей медлительностью путано объяснять основные правила, но Сидзунэ, не вытерпев, вмешивается, резким взмахом руки провозглашая начало игры.
    0x128A, // Агрессивный настрой Сидзунэ передаётся и мне. Я наконец-то проникаюсь духом соперничества, которого не было и в помине, когда я соглашался на участие в игре.
    0x13A9, // Посреди игры, в то время как я пытаюсь продумать защиту от атак сразу на два фронта, Сидзунэ нарушает ход моих мыслей, пытаясь привлечь моё внимание постукиванием пальцами о край стола.
    0x14FB, // …
    0x14FF, // Хиттян, Ситтян хочет заметить, что ты слишком долго думаешь над своими ходами.
    0x158E, // Ещё Ситтян говорит, что оставит тебе Австралию, если ты согласишься вступить в Совет!
    0x162A, // Я думал, это просто игра, безо всякого подтекста.
    0x1683, // Факт того, что она трясёт этим предложением у меня перед носом, означает, что она догадалась о моём желании выиграть.
    0x1758, // И всё равно – нет!
    0x1779, // …
    0x177D, // Ситтян восхищена твоим боевым духом и обещает быть великодушным диктатором, который пощадит твой народ, если ты согласишься вступить в Совет!
    0x1882, // Ха-ха-ха-ха~!
    0x1898, // Ты слишком азартная, Сидзунэ.
    0x18CE, // Кажется, она воспринимает это как комплимент.
    0x1922, // Я ожидал, что президент Школьного совета будет более… благожелательным.
    0x19A8, // Бла-го-же-ла-тель-ным?
    0x19CF, // Похоже, она не знает, что означает это слово или как оно показывается жестами, поэтому берёт лист бумаги и пишет его для Сидзунэ, которая в ответ показывает несколько жестов.
    0x1B0C, // Миша прижимает указательный палец к виску, словно пытаясь впечатать это слово в свою память.
    0x1BB6, // …
    0x1BBA, // Внезапно Сидзунэ разражается потоком жестов. Миша выглядит ошеломлённой той скоростью, с которой Сидзунэ жестикулирует.
    0x1C99, // Ах, пожалуйста, помедленнее, Ситтян… Хм, Хиттян~! Ситтян говорит, что ты проиграешь!
    0x1D31, // Скажи ей, что я разрушу её империю своим восстанием.
    0x1D90, // А… Хорошо…
    0x1DA6, // Её глаза сверкают детским озорством.
    0x1DEA, // …
    0x1DEE, // Взглянув на настенные часы, я понимаю, что прошло гораздо больше времени, чем я собирался здесь провести.
    0x1EAE, // А теперь простите, но я хотел зайти в библиотеку. Она ведь ещё открыта?
    0x1F2E, // Почесав затылок, Сидзунэ что-то жестикулирует Мише.
    0x1F8D, // Так сложно определить, открыта ли она, когда часы висят рядом?
    0x1FFE, // …
    0x2002, // Должна бы, если библиотекарь ещё там.
    0x2046, // Думаю, ты права, Ситтян.
    0x2071, // Мы… пришли к мнению, что она открыта. Она на втором этаже, мимо не пройдёшь. Хочешь, мы тебя туда проводим?
    0x2131, // Нет, спасибо. До завтра.
    0x215C, // Пока-пока!
    0x216F, // Она говорит, что если ты продолжишь так играть, то у тебя нет шансов. Ни единого~!
    0x2201, // В этом есть смысл. Перейти в атаку!
    0x2240, // Это ловушка, лучше уйти в оборону.
};

#endif // KS_A1_TUESDAY_RISK_VS_REWARD_RU_TL_INDEX