#ifndef KS_A1_MONDAY_BUNDLE_OF_HISAO_RU_TL_INDEX
#define KS_A1_MONDAY_BUNDLE_OF_HISAO_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_8A5E92DC_ru_intl[] = {
    0x0000, // После моего сердечного приступа прошло четыре месяца.
    0x0064, // {vspace=60}За это время все разы, когда я покидал палату без присмотра, можно сосчитать по пальцам одной руки.
    0x0123, // Четыре месяца – довольно долгий срок, когда остаёшься наедине со своими мыслями. У меня было достаточно времени, чтобы смириться со своим положением.
    0x0236, // Аритмия.
    0x0246, // Странное слово. Незнакомое, чужое. Такое, с которым не хочется иметь ничего общего.
    0x02DD, // Редкая болезнь. Вызывает перебои в работе сердца, иногда заставляя его биться слишком быстро. Это может быть смертельно.
    0x03BA, // Очевидно, она была у меня уже давно. Мне сказали, это просто чудо, что я смог прожить так долго безо всяких происшествий.
    0x0494, // Чудо ли это? Мне кажется, что так они просто хотели заставить меня чуть больше ценить свою жизнь.
    0x0544, // Однако это нисколько меня не ободрило.
    0x058B, // {vspace=150}Думаю, мои родители были потрясены куда сильнее меня. Их обоих чуть удар не хватил.
    0x062E, // {vspace=30}У меня, по крайней мере, был целый день, чтобы переварить это. Для них же это стало полнейшей неожиданностью. Они готовы были даже продать дом, чтобы заплатить за лекарство от этой болезни.
    0x078F, // {vspace=60}Но, конечно, лекарства не существует.
    0x07DE, // {vspace=30}Из-за позднего обнаружения этого… состояния, я должен был оставаться в больнице до полного восстановления.
    0x08AF, // Вначале, когда ко мне начали приходить посетители, казалось, будто они по мне скучают…
    0x094E, // Примерно неделю моя палата была полна цветов, воздушных шаров и открыток.
    0x09D5, // Но вскоре поток посетителей стал редеть, и все их подарки с пожеланиями скорейшего выздоровления понемногу иссякли.
    0x0AAB, // Я понял, что единственной причиной, по которой я получил так много открыток и цветов, было то, что выражение сочувствия ко мне превратили в задание для класса.
    0x0BCC, // Может, некоторые и правда волновались, но я сомневаюсь в этом. Даже с самого начала ко мне приходили нечасто. К концу первого месяца меня продолжали регулярно навещать лишь родители.
    0x0D19, // Иванако перестала приходить последней.
    0x0D62, // Спустя полтора месяца я перестал видеть её в больнице. В любом случае нам не о чем было разговаривать.
    0x0E1C, // Мы никогда больше не касались темы, которая свела нас в тот снежный день.
    0x0EA1, // {vspace=30}Больница?
    0x0EBE, // Это точно не то место, где я хотел бы быть.
    0x0F0A, // Доктора и медсёстры казались отстранёнными и безликими.
    0x0F72, // Думаю, потому что они спешат и у них миллион других пациентов, о которых нужно заботиться… но мне от этого становится не по себе.
    0x105D, // На протяжении первого месяца каждый раз, когда я встречал главного кардиолога, я спрашивал о хотя бы приблизительной дате, когда смогу покинуть больницу.
    0x1177, // Он никогда не отвечал прямо, говоря только, что надо подождать и понять, насколько эффективно идёт лечение и насколько успешно прошла операция.
    0x127E, // {vspace=30}Поэтому мне оставалось лишь наблюдать, как шрам, оставшийся на груди после операции, со временем меняется. Он казался клеймом, оставленным судьбой.
    0x1397, // Я продолжал спрашивать кардиолога о сроках моей выписки, но уже практически не надеялся услышать ответ, поэтому его отсутствие меня не разочаровывало. То, какие слова он использовал, уходя от ответа, по крайней мере оставляло хоть какую-то надежду.
    0x155D, // {vspace=120}В какой-то момент я перестал смотреть телевизор. Не знаю почему. Просто перестал, и всё.
    0x1608, // Возможно, в моей ситуации, это был неподходящий способ ухода от реальности.
    0x1692, // {vspace=30}Вместо этого я начал читать. В больнице была небольшая «библиотека», которая, впрочем, больше походила на кладовку. Я поглощал книгу за книгой, проглатывая по небольшой стопке, и возвращался за добавкой.
    0x1810, // Внезапно я обнаружил, что мне нравится чтение, я даже немного пристрастился к нему. Я стал чувствовать себя голым без книги в руках.
    0x1900, // {vspace=30}Но мне так нравились все эти истории…
    0x1951, // {vspace=30}Так я и жил.
    0x1971, // {vspace=30}Дни становились всё более одноликими, различались только погода за окном да обложка книги у меня в руках. Время словно превратилось в какую-то клейкую массу, в которой я увязал, вместо того чтобы плыть дальше.
    0x1AF9, // Я не замечал, как пролетали недели.
    0x1B39, // Случалось, что я даже не знал, какое сегодня число.
    0x1B95, // Но иногда окружающая действительность вдруг пробивалась через барьер безразличия, которым я себя окружил.
    0x1C5A, // Страницы книги начинали казаться острыми и жгли руки, а тяжесть в груди становилась невыносимой. Я вынужден был откладывать книгу и просто лежать некоторое время, глядя в потолок, словно собираясь заплакать.
    0x1DD7, // Но это случалось нечасто.
    0x1E06, // {vspace=30}Да я даже не мог плакать.
    0x1E3E, // Сегодня ко мне с улыбкой на лице пришёл доктор. Он кажется слегка взволнованным. Как будто он пытается порадоваться и от моего имени.
    0x1F31, // Мои родители тоже здесь. Я не видел их несколько дней. Они даже одеты как-то по-праздничному. Сегодня должно произойти что-то особенное? Не слишком похоже на вечеринку.
    0x2062, // Начинается привычный ритуал главного кардиолога: он не спеша раскладывает бумаги, затем убирает их в сторону, словно подчёркивая бессмысленность этого действия.
    0x218C, // Он небрежно садится на край соседней койки и пару мгновений смотрит мне в глаза.
    0x221F, // Здравствуй, Хисао. Как ты себя чувствуешь?
    0x226C, // Я молчу, но слегка улыбаюсь в ответ.
    0x22AD, // Думаю, ты уже можешь вернуться домой. Твоё сердце стало сильнее, и, если ты будешь соблюдать некоторые меры предосторожности, всё будет в порядке.
    0x23B7, // Мы определились с необходимыми для тебя лекарствами. Я отдам рецепт твоему отцу.
    0x244B, // Доктор протягивает ему лист бумаги. Когда отец пробегается глазами по рецепту, его лицо принимает каменное выражение.
    0x2524, // Так много…
    0x2539, // Я беру листок у него из рук, чтобы посмотреть самому, и ошеломлённо замираю. Как ещё мне на это реагировать?
    0x25FC, // Абсурдно длинный список лекарств, смотрящий на меня с листа бумаги, кажется недоступным для восприятия. Текст сливается в сплошное море букв.
    0x2700, // Это безумие.
    0x2717, // Побочные эффекты, противопоказания и дозировки перечислены строка за строкой с холодной точностью.
    0x27CF, // Я пытаюсь прочесть, что там написано, но тщетно.
    0x2826, // Я не могу понять ни слова. Попытки сделать это лишь вызывают раздражение.
    0x28AC, // Всё это… каждый день, всю мою оставшуюся жизнь?
    0x2903, // Боюсь, это всё, что мы пока можем сделать.
    0x294E, // Однако постоянно появляются новые лекарства, и я не удивлюсь, если с годами список уменьшится.
    0x29FB, // С годами… Каким образом это должно вселить в меня уверенность? Я бы чувствовал себя спокойнее, если бы он промолчал.
    0x2AD0, // И ещё. Я поговорил с твоими родителями, и мы решили, что тебе лучше не возвращаться в твою прежнюю школу.
    0x2B8D, // Что?!
    0x2B96, // Хисао, пожалуйста, успокойся. Послушай, что скажет доктор.
    0x2C00, // Успокоиться? Тон, которым он просит об этом, показывает, что он предвидел моё недовольство. Я что, перевожусь на домашнее обучение?
    0x2CEE, // Но все мои проявления беспокойства игнорируются.
    0x2D49, // Мы все понимаем, что твоё образование – это главное. Вместе с тем оставлять тебя без медицинского присмотра будет неразумно.
    0x2E2E, // По крайней мере, пока мы не убедимся, что эти лекарства тебе подходят.
    0x2EAD, // Так что я поговорил с твоими родителями о переводе.
    0x2F0B, // Речь идёт о школе «Ямаку», созданной специально для учащихся с ограниченными физическими возможностями.
    0x2FCC, // С ограниченными возможностями? Что? Получается, я…
    0x302A, // Их медперсонал работает круглосуточно, и всего в нескольких минутах находится престижная больница. Большинство учеников живёт в общежитии при школе.
    0x313E, // Считай это своего рода престижной частной школой. Она организована так, чтобы ученики могли научиться самостоятельности и при этом помощь всегда находилась неподалёку.
    0x3275, // «Самостоятельности»? Это школа для детей-инвалидов. Не пытайтесь это скрыть!
    0x3302, // Будь она на самом деле такой «свободной», там бы не было постоянного медицинского надзора и наличие поблизости больницы не было бы включено в её рекламу.
    0x341B, // Конечно, тебе решать, переводиться туда или нет. Но… мы с мамой не сможем обучать тебя дома.
    0x34C2, // Мы ездили туда пару недель назад и внимательно присмотрелись к ней. Думаю, тебе там понравится.
    0x3570, // Кажется, у меня и правда нет выбора.
    0x35B1, // Люди с проблемой вроде твоей обычно живут дольше, чем люди с другими сердечными заболеваниями. Однажды тебе понадобится работа, и это хорошая возможность продолжить обучение.
    0x36F3, // Это не возможность, не называйте это возможностью. Какая это, к чертям, возможность?
    0x378C, // Ты должен радоваться такому шансу. Я помню, как ты хотел снова вернуться в школу, и пусть это не та же самая…
    0x3851, // Специальная школа… Это же…
    0x3885, // Оскорбление. Вот что я хочу сказать. Это шаг назад.
    0x38E1, // Это не то, о чём ты думаешь. Все ученики там ведут достаточно активный образ жизни, каждый по-своему.
    0x3997, // Школа создана специально для ребят, которые продолжают жить своей жизнью и учиться, но нуждаются в небольшой помощи… того или иного рода.
    0x3A94, // Твой отец прав. И немалое число выпускников этой школы достигли поразительно многого. Инвалидность не должна препятствовать развитию человека.
    0x3B9D, // Один мой коллега из другой больницы – их выпускник.
    0x3BFC, // Мне плевать. Инвалидность не должна препятствовать развитию? Как раз препятствием она и является.
    0x3CB0, // Меня ужасно злит, что столь важное решение было принято за меня. Но что я могу поделать? О нормальной жизни теперь не может быть и речи.
    0x3DA5, // Забавно, я всегда думал, что моя жизнь довольно скучна, но теперь мне её не хватает.
    0x3E3C, // Я хочу протестовать, но мне остаётся только списать мою вялую реакцию на шок или усталость. Я мог бы закричать, что я, несмотря ни на что, хочу вернуться в прежнюю школу. Но нет.
    0x3F7B, // Я молчу, потому что знаю, что это бесполезно.
    0x3FCC, // Я окидываю взглядом свою палату, и меня охватывает усталость от всего этого. От больницы, от докторов, от болезни – всего. Не вижу ничего, что заставило бы меня изменить настрой.
    0x410F, // Выбора действительно нет. Я знаю это, но мысль о том, чтобы пойти в школу для инвалидов… Какая она вообще? Очень трудно думать об этом в позитивном ключе.
    0x4226, // Но я должен попытаться.
    0x4251, // Новое начало – не так уж и плохо.
    0x428D, // Это всё, о чём я могу думать, чтобы заставить себя пережить это. По крайней мере, у меня остаётся ещё хоть что-то, даже спецшкола всё же лучше, чем ничего. Это новое начало, не всё потеряно. Я не могу позволить себе думать иначе.
    0x4425, // Я хотя бы должен увидеть, на что будет похожа моя новая жизнь.
};

#endif // KS_A1_MONDAY_BUNDLE_OF_HISAO_RU_TL_INDEX