#ifndef KS_A1C14O1_RU_TL_INDEX
#define KS_A1C14O1_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_EB67709F_ru_intl[] = {
    0x0000, // Я и сам себя об этом спрашиваю. Наверное, потому что больше нечем заняться.
    0x0088, // Он весело смеётся, а затем бросает взгляд на часы.
    0x00E3, // Мне уже пора бежать. Тедзука, я доволен, что этот небольшой проект так хорошо продвигается.
    0x0189, // Я только заскочил напомнить, чтобы ты завтра никуда не убегала. Я пригласил на фестиваль кое-каких людей и уверен, что они будут рады с тобой встретиться.
    0x02A1, // И ещё, в понедельник занятие в кружке отменяется, поскольку я уеду из города. Думаю, что вы, ребятишки, сами найдёте чем заняться.
    0x038B, // Он уходит, напыщенно повернувшись и зашагав прочь настолько театрально, насколько возможно.
    0x0435, // Какой странный учитель.
    0x0461, // Я тоже пойду. Увидимся, Рин.
    0x0493, // Подняв в знак прощания руку, я направляюсь вверх по лестнице к общежитиям.
    0x051B, // Может, если мне удастся дочитать сегодня эти книги, завтра весь день будет свободен для фестиваля.
};

#endif // KS_A1C14O1_RU_TL_INDEX