#ifndef KS_A1_SUNDAY_NC5XB3_RU_TL_INDEX
#define KS_A1_SUNDAY_NC5XB3_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_7DCA7FE2_ru_intl[] = {
    0x0000, // Лилли, похоже, не в лучшем настроении, и я не могу её винить.
    0x006C, // Помимо проблем с киоском ей, похоже, приходится волноваться за Ханако.
    0x00ED, // С первым я не могу ей по-настоящему помочь, так что, думаю, единственный для меня способ оказать ей помощь – снять с неё заботу о нашем общем застенчивом друге.
    0x020F, // Поставив плошку на прилавок, я зову Лилли.
    0x025C, // Эй, Лилли, не волнуйся за Ханако. Я обязательно прогуляюсь с ней, когда отыщу, договорились?
    0x0302, // Я вижу, как на лице Лилли появляется выражение облегчения.
    0x036D, // Спасибо, Хисао. И, если заметишь кого-нибудь из моего класса, будь добр, скажи им зайти сюда.
    0x0413, // Обязательно. Желаю приятно провести время. И не забудь сделать перерыв, хорошо?
    0x04A4, // Если получится. Увидимся позже, Хисао.
    0x04EA, // Я оставляю Лилли за прилавком и направляюсь на поиски Ханако.
    0x055B, // Я отчасти виню себя за то, что оставил её одну, но, пусть на её долю и выпала немалая нагрузка, мне всё же кажется, что она вполне довольна.
    0x0654, // Проходы забиты колышущейся толпой, слоняющейся туда-сюда по праздничным угодьям.
    0x06EA, // Если я что-то знаю о Ханако, так это то, что она к такому даже не приблизится.
    0x0774, // И, учитывая, что некоторые ученики показывают друзьям и семье свои комнаты в общежитии, сомневаюсь, что она найдётся и там.
    0x0854, // Положившись на слепую интуицию, я неохотно погружаюсь в людскую массу.
    0x08D6, // К счастью, толпа не такая шумная, как обычно бывает на праздниках, – я предполагаю, из предупредительности к физическим недостаткам учеников.
    0x09DA, // Я пробиваюсь сквозь скопления людей, и вскоре они редеют, а позже и вовсе исчезают.
    0x0A71, // Неудивительно, учитывая, что я стою перед библиотекой.
    0x0AD5, // Даже самые дотошные из учеников не станут никому показывать эту часть школы.
    0x0B62, // Когда я захожу внутрь, шум праздника тает позади, превращаясь в глухое гудение где-то на заднем плане, и вскоре я оказываюсь в отведённой для чтения дальней части помещения.
    0x0C9E, // Позади одного из огороженных столов я замечаю чью-то макушку с тёмными прямыми волосами, привлекающую моё внимание.
    0x0D73, // Привет, Ханако. У меня было чувство, что я найду тебя здесь…
    0x0DE0, // Она вздрагивает от изумления, прежде чем медленно показаться над перегородкой.
    0x0E72, // Х-Хисао?
    0x0E81, // Ага. Лилли изрядно занята, так что послала меня найти тебя.
    0x0EEC, // В-вот как. Хочешь присесть?
    0x0F1D, // Вообще-то я слегка голоден. Не хочешь пойти перехватить чего-нибудь с лотков?
    0x0FAA, // Ум… Я… Я взяла с собой еду, поэтому…
    0x0FEE, // Что и неудивительно, но всё-таки попытаться стоило. Ожидать, что она выйдет сегодня наружу, – слишком смелое предположение.
    0x10D0, // А как насчёт поесть в чайной комнате? Я прошёл мимо неё по пути сюда, и там никого не было.
    0x1172, // Там мы сможем заварить себе чай, и вообще так будет удобней. Что скажешь?
    0x11F6, // К-конечно. Пойдём.
    0x1217, // Ханако закрывает книгу и отработанным движением откладывает её в сторону.
    0x12A0, // Готова к походу?
    0x12BE, // А… ага.
    0x12CC, // Мы выходим из библиотеки в направлении чайной комнаты.
    0x1331, // Как и ожидалось, вокруг ни души.
    0x136B, // Если бы не доносящийся из-за стен гомон толпы, то и не скажешь, что снаружи сейчас большое празднество.
    0x1426, // Ханако несёт портфель обеими руками и глядит в пол.
    0x1484, // Время от времени она, кажется, делает короткие шажки вместо обычных.
    0x1501, // В первый раз я не обращаю внимания, но вскоре замечаю, что она делает так постоянно.
    0x1599, // С тобой всё в порядке?
    0x15C1, // Она резко замирает на полушаге.
    0x15FB, // Ч-что?
    0x1606, // Не знаю… Кажется, будто ты спотыкаешься или типа того…
    0x166C, // Розовый румянец окрашивает её щёки, и взгляд её снова утыкается в пол.
    0x16EC, // Нет… всё в порядке.
    0x1710, // Знаешь, когда ты вот так говоришь «всё в порядке», то прямо подталкиваешь задать тебе ещё вопрос.
    0x17C1, // Секунду мне кажется, что она не ответит.
    0x180A, // Приготовившись оставить эту тему, я собираюсь снова отправиться дальше, как…
    0x1899, // Это… игра.
    0x18AD, // Игра?
    0x18B7, // Ты… видел, какие тут полы?
    0x18E7, // Странный вопрос. Полы выглядят точно как любые другие полы, расчерченные ячейками из квадратов линолеума.
    0x19AA, // Ничего примечательного.
    0x19D7, // Ну, да. А что с ними?
    0x19FA, // Иногда… когда никого нет рядом… я наступаю только на тёмные…
    0x1A6D, // Голос Ханако становится всё тише и тише по ходу объяснения, до такой степени, что я едва могу её расслышать в звенящей тишине пустого коридора.
    0x1B72, // Тёмные?
    0x1B80, // Шаркнув ногой, Ханако указывает носком своей туфли на кусочек, который выглядит чуть-чуть темнее прочих.
    0x1C40, // В-вот такие.
    0x1C56, // А, понятно. Значит, вот эти не годятся?
    0x1C9B, // Я показываю на соседний квадратик.
    0x1CDB, // А-ага. Примерно… примерно так.
    0x1D13, // Угу, ясно. Ты часто так играешь?
    0x1D4C, // Ханако качает головой.
    0x1D76, // Только когда в коридорах пусто?
    0x1DB0, // Она кивает.
    0x1DC5, // Что ж, не будем задерживаться, а то скоро я по-настоящему проголодаюсь.
    0x1E46, // Она снова кивает, на сей раз с большим воодушевлением.
    0x1EA9, // Ну, тогда пойдём.
    0x1EC8, // Мы продолжаем путь по коридору, но на этот раз я замечаю, что Ханако чуть реже глядит на пол.
    0x1F6F, // Интересно, насколько человек должен быть одинок, чтобы додуматься до игры вроде этой?
    0x200C, // Не успев понять, что я делаю, я замечаю, что стараюсь выверять каждый шаг, чтобы наступать только на правильные квадратики.
    0x20EC, // В чайной комнате шум фестиваля слышен чуть сильнее, но ветерок, дующий из открытого окошка, того стоит.
    0x21A8, // Я не раздумывая подхожу к подоконнику и делаю глубокий вдох. Иногда я забываю, насколько легко здесь дышится по сравнению с моим родным городом.
    0x22B0, // Ты… будешь чаю?
    0x22CD, // Было бы здорово, спасибо.
    0x22FB, // Мне приходит в голову, что это первый раз, когда я остаюсь наедине с Ханако и при этом она не пытается куда-нибудь сбежать.
    0x23D9, // Отвернувшись от окошка, я гляжу, как она заваривает чай в простом чайничке и выкладывает на тарелку несколько бутербродов.
    0x24BA, // Я не раз видел, как она это делает, но сейчас она кажется чуть другой.
    0x2537, // Как будто она…{w} спокойна.
    0x2568, // Вскоре она опускает на стол маленький поднос и наливает две чашки чая.
    0x25E9, // Аромат свежезаваренного чая смешивается с ветерком, и на миг мне представляется, будто я нахожусь с миром один на один.
    0x26C3, // Пожалуй, теперь я понимаю, почему тебе нравится эта комната.
    0x2731, // Эм… Я не совсем поняла, о чём ты.
    0x276C, // Ну, там, подальше, немало народу, но здесь будто совершенно другой мир.
    0x27EC, // Можно вообразить, что тут нет никого на километры вокруг.
    0x2855, // И-и верно.
    0x2867, // Словно мир позабыл об этой комнате.
    0x28A8, // И п-поэтому можно забыть о том, что снаружи.
    0x28F7, // В некоторых случаях это привлекательно.
    0x2941, // Насколько я могу судить, издевательства в своей классической форме в этой школе не практикуются.
    0x29F3, // Но при всём при том я не видел ни единого человека, разговаривающего с Ханако, кроме Лилли.
    0x2A98, // Если тебя игнорирует мир, то место, где ты можешь забыть о его существовании, будет обладать особой притягательностью.
    0x2B71, // Верно, в этом её плюс. Эта комната словно дарит нам своего рода свободу.
    0x2BF3, // Д-да.
    0x2BFC, // Скажи… А ты в шахматы играешь?
    0x2C34, // Шахматы? Думаю, немножко умею.
    0x2C6B, // Я так понимаю, ты раньше играла?
    0x2CA5, // Чуть-чуть…
    0x2CBA, // Ханако, не проронив более ни слова, подходит к одному из буфетов и достаёт из него маленький шахматный набор.
    0x2D81, // Ты… ты хочешь…
    0x2D9E, // Конечно, почему бы нет?
    0x2DC8, // Я прерываю её на полуслове, но она, очевидно, не в обиде.
    0x2E2D, // Мы расставляем фигуры и вскорости уже посылаем пешек навстречу их неизбежной судьбе.
    0x2ECA, // Я не тороплюсь и внимательно изучаю каждый ход и его последствия, и ностальгия по игре отходит на задний план.
    0x2F93, // Поначалу игра представляет собой длительную войну на истощение, но тут я замечаю брешь в её построениях и прорываю линию обороны.
    0x3081, // Спустя несколько ходов её король попадает в окружение моих фигур.
    0x30FA, // Шах и мат.
    0x310C, // А ты неплохо играешь, да?
    0x3139, // Честная оценка. Её техника довольно хороша, но несколько раз мне удалось использовать её слабость в предвидении.
    0x3208, // Я поднимаю фигурку к глазам и внимательно её рассматриваю. Она кажется относительно новой, но уже потрёпанной.
    0x32D3, // Я… я думаю, нет.
    0x32F0, // А Лилли играет?
    0x330C, // Пауза перед ответом Ханако заставляет меня задуматься над своим вопросом.
    0x3395, // Н-немножко…
    0x33AC, // Э-это первый раз, когда я играла с кем-то… кроме неё или…
    0x3414, // Или?..
    0x341E, // Она резко обрывает себя, а мой вопрос остаётся невысказанным. Видимо, она имела в виду человека, которого знала ещё до поступления в «Ямаку».
    0x351F, // Что ж, я польщён, что мне довелось с тобой сыграть.
    0x357A, // Эм-м… Мы можем сыграть ещё?
    0x35AC, // Она спрашивает так неуверенно, будто просит меня отрезать себе руки. У неё разыгрался азарт?
    0x3655, // Конечно. Хотя на сей раз не жди от меня пощады…
    0x36AB, // Хотя не то чтобы я поддавался раньше. Боевой настрой ей, похоже, нравится.
    0x3731, // И… и ты от меня тоже…
};

#endif // KS_A1_SUNDAY_NC5XB3_RU_TL_INDEX