#ifndef KS_A1_TUESDAY_PSEUDO_TEA_COSY_RU_TL_INDEX
#define KS_A1_TUESDAY_PSEUDO_TEA_COSY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_BF523EBA_ru_intl[] = {
    0x0000, // Всего один лестничный пролёт, и я уже сталкиваюсь с проблемами.
    0x0074, // Второй этаж – точная копия третьего.
    0x00B8, // Передо мной очередной широкий прямой коридор.
    0x010D, // И отыскать здесь библиотеку – задача намного более сложная, чем мне казалось вначале.
    0x01AB, // Помимо пронумерованных классов, здесь ещё множество дверей безо всяких обозначений.
    0x0247, // Библиотека за одной из них? Или где-то дальше?
    0x029A, // Остановившись на втором, я решаю пойти наугад.
    0x02EF, // За углом я обнаруживаю незакрытую дверь.
    0x033A, // Она приоткрыта совсем чуть-чуть – ровно настолько, чтобы было заметно, что тут не заперто.
    0x03DF, // Я полагал, что дверь школьной библиотеки должна быть гостеприимно распахнутой, но сейчас меня обнадёживает и этот маленький зазор.
    0x04D0, // По крайней мере, внутри должен быть кто-то, у кого я могу спросить дорогу, пусть мне и неловко.
    0x057A, // Нервничая и готовясь в любой момент отпрянуть, я осторожно толкаю дверь кончиками пальцев.
    0x0621, // В этой школе я чувствую себя посторонним. Меня постоянно преследует ощущение, что я здесь чужой, поэтому даже такую простую вещь я боюсь сделать неправильно.
    0x0741, // Скрип двери напоминает кряхтение человека, пробуждающегося от долгого сна, хотя она поддаётся моему толчку неожиданно легко.
    0x0828, // Чтобы побыстрее увидеть комнату, я заглядываю внутрь, но робкое приветствие замирает у меня на устах.
    0x08E2, // …
    0x08E6, // Такого… я не ожидал.
    0x090C, // Я рассеянно распахиваю дверь настежь. Всё моё внимание приковывает одинокая фигура в центре комнаты.
    0x09C6, // Я безмолвно застываю в дверном проёме, уставившись на удивительно красивую девушку.
    0x0A61, // Оценив ситуацию, девушка аккуратно ставит чашку с чаем на стол и открывает глаза, не глядя, однако, в мою сторону.
    0x0B2F, // Приветствую. Могу я чем-нибудь помочь?
    0x0B75, // Она сидит, глядя перед собой, и, кажется, не слова, а лишь движения её губ нарушают покой.
    0x0C15, // Из-за её неподвижности звук мягкого, размеренного голоса звучит будто бы сам по себе.
    0x0CB1, // Она выглядит как иностранка, но всё же сильно отличается от тех иностранцев, что я встречал раньше. Кроме того, она – самая высокая девушка, которую я когда-либо видел.
    0x0DE2, // Прошу прощения за вторжение, я тут немного… потерялся.
    0x0E47, // Она слегка медлит с ответом. Все её слова и движения точны и грациозны, словно заранее тщательно отрепетированы.
    0x0F15, // Не желаешь ли присесть?
    0x0F40, // …Неожиданно, учитывая то, как я к ней ворвался.
    0x0F96, // Эм-м-м… спасибо.
    0x0FB4, // Я не спеша занимаю место за столом напротив неё. Между нами стоит чашка с чаем.
    0x1043, // Она не следит за мной взглядом, что… вместе с туманной дымкой в её глазах говорит о проблемах со зрением, как у Кендзи.
    0x111B, // Кстати, говорит она без какого-либо акцента. Вероятно, она наполовину японка.
    0x11A8, // Я удивлён её собранностью и тем спокойствием, что царит в комнате. Даже молчание здесь не вызывает неловкости.
    0x1272, // Атмосфера совсем иная, нежели в кабинете Школьного совета.
    0x12DE, // Полагаю, ты перевёлся в «Ямаку» недавно?
    0x1328, // А, да. Только вчера.
    0x134B, // Я чувствую, как мои неуклюжие слова контрастируют с изяществом её речи. Её благородный сдержанный поклон усугубляет это чувство ещё больше.
    0x144C, // Я отвечаю на него, хотя тут же осознаю бессмысленность своего действия.
    0x14CF, // Меня зовут Лилли Сато. Приятно познакомиться…
    0x1525, // Хисао. Хисао Накай.
    0x1548, // Она кивает и указывает в сторону чашки.
    0x1590, // Не желаешь ли чаю?
    0x15B1, // Да, конечно.
    0x15C7, // Как бы обидно мне ни было, я не могу полностью соответствовать галантности её манер.
    0x1661, // На мою просьбу Лилли спокойно кивает.
    0x16A6, // Не говоря ни слова, она встаёт и заваривает вторую чашку чая, используя припасы, разложенные вдоль полок.
    0x1766, // Раз за разом, наливая, Лилли легко касается чётким и отточенным движением левой руки то чайника, то чашки. Кажется, будто она выполняла эти действия уже десятки раз.
    0x1892, // Я чуть наклоняюсь и, выглядывая из-за её спины, вижу, что она проверяет уровень воды в чашке своим длинным изящным пальчиком.
    0x1975, // Одно дело – видеть людей с различными физическими недостатками на уроках, и совсем другое – наблюдать, как они адаптируются в быту.
    0x1A67, // Сидзунэ и Миша без проблем работают сообща, общаясь со мной. Лилли, на мой взгляд, тоже нашла решение для проблем, о которых я даже не задумывался.
    0x1B70, // Я чувствую себя слегка виноватым из-за того, что ей приходится всё делать самой… Впрочем, кажется, ей нравится быть радушной хозяйкой, готовя мне напиток.
    0x1C8A, // Итак…
    0x1C96, // Её мягкий голос прерывает моё безмолвное наблюдение.
    0x1CF8, // Что именно ты искал? В этот кабинет не так часто заходят после занятий.
    0x1D79, // Школьную библиотеку. Сидзунэ и Ми… то есть мои одноклассницы сказали, что она на этом этаже.
    0x1E22, // Кивнув, она заканчивает наливать воду в чашку и, судя по металлическому звону, начинает помешивать в ней ложкой.
    0x1EEF, // Я знаю мисс Хакамити – думаю, её знают почти все ученики. Но, раз вы с ней одноклассники, значит ты тоже в классе 3-3, верно?
    0x1FCB, // Именно. Кабинет естественных наук Муто.
    0x2014, // Она хихикает и, положив чайную ложку, медленно направляется к столу с чашкой и блюдцем в руках.
    0x20C1, // Он такой оригинал, его здесь любят. Полагаю, и тебе он тоже скоро понравится.
    0x214C, // Я аккуратно беру чашку и делаю глоток. На самом деле я предпочитаю кофе, но сейчас не лучший момент упоминать об этом.
    0x2222, // Тем более что запах довольно приятный. Не думаю, что будет сложно выпить всю чашку до дна.
    0x22C5, // Спасибо, Сато. Очень вкусный чай.
    0x2301, // Она с улыбкой отмахивается.
    0x2334, // Пожалуйста, зови меня Лилли. Не нужно формальностей.
    0x2394, // Произносит она чрезвычайно благовоспитанным тоном. Что ж, ладно.
    0x240B, // Думаю, стоит попробовать задать ей вопрос о ней самой, раз она проявляет такую заботу обо мне.
    0x24B6, // А из какого ты класса? Третий год обучения, да?
    0x250A, // Именно. Кабинет 3-2 – на том же этаже, что и ваш. Нас учит Мияги. Это класс для учеников с проблемами со зрением.
    0x25D1, // Очевидно.{w} Ой, я х-хотел сказать, эм, извини…
    0x2623, // Хочется стукнуть себя по лбу за такую промашку. Хотя, судя по выражению её лица, это вовсе её не задело.
    0x26DE, // Что ты, что ты! Не нужно стараться подбирать из-за меня слова.
    0x274D, // Да, конечно. Извини, я здесь новенький и постоянно это всем показываю.
    0x27CC, // Твоё окружение полностью изменилось, и мне не в чем винить тебя. Не буду говорить за всех, но многие смирились со своим состоянием.
    0x28BA, // Думаю, она входит в их число. Эта беседа смущает меня, и я пытаюсь сменить тему.
    0x2949, // Ты здесь часто пьёшь чай? Место действительно очень хорошее.
    0x29B8, // Наверное, для неё эта комната – как мой уголок, где я любил перекусывать, позади здания в старой школе.
    0x2A73, // Я часто прихожу сюда во время ланча. Мои обязанности старосты класса не оставляют времени на кружки и прочее, так что мы с подругой используем эту комнату для чаепитий.
    0x2BA6, // Староста, значит?
    0x2BC6, // Она и Сидзунэ – полные противоположности. Сидзунэ резкая и энергичная, Лилли же – спокойная и расслабленная, чуть отстранённая.
    0x2CB2, // Кстати, думаю, от неё можно услышать более непредвзятое мнение о школьных кружках.
    0x2D49, // А какие кружки тут вообще есть?
    0x2D82, // Хм… У нас наиболее популярны кружки лёгкой атлетики и бейсбола, а также литературный кружок, расположенный возле библиотеки.
    0x2E69, // Есть и множество мелких, как, например, кружок рисования и музыкальный кружок.
    0x2EF8, // Перспектива вступления куда-либо сразу после перевода выглядит для меня не слишком привлекательно.
    0x2FB0, // Интересно, действует ли здесь то же правило насчёт кружков, что и в моей прежней школе…
    0x3050, // Членство в кружке обязательно?
    0x3089, // Нет, просто желательно.
    0x30B4, // Хорошо. Гора с плеч.
    0x30D8, // Я и правда расслабился рядом с этой девушкой, раз позволил этой мысли слететь с моего языка. Кажется, это её слегка радует.
    0x31B7, // Мы с Лилли начинаем наконец пить чай, пока он окончательно не остыл.
    0x3233, // Взглянув Лилли через плечо, я замечаю, что из окна струится оранжевый закатный свет.
    0x32CD, // Даже здесь время не стоит на месте.
    0x330D, // Мда, время быстро пролетело.
    0x3341, // Прости?
    0x334F, // Точно. Она слепая. И, конечно же, не может увидеть, что солнце садится.
    0x33CD, // Кажется, солнце клонится к закату.
    0x340C, // Похоже, это становится для неё неожиданностью. Видимо, она потеряла счёт времени.
    0x34A1, // Извини, Хисао. Я не хотела тебя так задерживать.
    0x34F8, // Я пытаюсь развеять её беспокойство.
    0x353A, // Да нет, ничего страшного. Библиотека ведь ещё открыта?
    0x359D, // Она замолкает и ненадолго задумывается.
    0x35E7, // Наверное, мне стоило задать этот вопрос Сидзунэ, когда был шанс. Впрочем, и Лилли наверняка легко может на него ответить.
    0x36C3, // Верно. Она открыта до половины седьмого по будням.
    0x371F, // Беглый взгляд на часы подтверждает, что у меня ещё достаточно времени.
    0x37A0, // Хм, в таком случае я пойду. Приятно было поболтать, Лилли.
    0x3808, // Сохраняя всё ту же благочестивую позу, она с вежливой улыбкой кивает мне.
    0x388E, // Взаимно.
    0x389E, // Кстати… может, мне стоит тебя проводить?
    0x38E9, // Нет-нет, ты и так очень помогла мне. Думаю, я без труда её отыщу.
    0x395B, // Ну, если только навык ориентирования на местности меня не подведёт.{w} А такое нередко случается.
    0x3A0B, // Это нисколько меня не затруднит, я как раз собиралась поговорить с библиотекарем. Могу представить тебя ей.
    0x3AD0, // Всё лучше и лучше. От такого предложения сложно отказаться.
    0x3B3D, // Было бы здорово, раз ты не против. Спасибо.
    0x3B8A, // Она встаёт и, взяв прислонённую к её портфелю трость, следует за мной.
    0x3C09, // Её трость гораздо тоньше и длиннее, чем у моего одноклассника. Наверное, потому что она использует её для того, чтобы ориентироваться в пространстве, а не для опоры при ходьбе.
    0x3D49, // Направляясь в библиотеку, мы выходим из комнаты и оказываемся в пустом коридоре.
    0x3DDD, // Я иду не торопясь, подстраиваясь под её неспешные шаги.
    0x3E42, // Спустя некоторое время мы подходим к двери уютно выглядящего помещения, расположенного посередине этажа, а не в одном из крыльев здания.
    0x3F3D, // Дамы вперёд.
    0x3F54, // Она признательно улыбается в ответ на этот жест и заходит внутрь.
    0x3FCC, // Слева от входа располагается стол библиотекаря, книжные полки ровными рядами стоят по правую руку.
    0x4082, // По сравнению с библиотекой моей прежней школы, эта кажется мне просто огромной. Запах старых книг придаёт этому месту, можно сказать, дух старины.
    0x418D, // Читателей в этот час здесь почти нет: все гуляют или отдыхают в общежитии.
    0x4214, // Юко, ты здесь?
    0x422D, // Она задаёт этот вопрос в пустоту, потому что библиотекаря, кажется, нет на месте, а Лилли этого, конечно, не видит.
    0x42FB, // Но, к моему удивлению, ответ всё же следует.
    0x434A, // Из-под стола библиотекаря раздаётся звук удара, а следом за ним тихий стон.
    0x43D3, // Ай-яй-яй!
    0x43E3, // Голос принадлежит девушке, которая уже выбралась из-под стола и теперь стоит перед нами, неуклюже потирая затылок.
    0x44B5, // Привет, Лилли. Чем могу помочь?
    0x44ED, // Она старается, чтобы её голос звучал как ни в чём не бывало.
    0x4559, // Добрый день. Что произошло? Я слышала какой-то странный звук.
    0x45C8, // Ничего, я всего лишь немного ушиблась.
    0x460E, // Видишь ли, я уронила ластик под стол, а пока искала, упал и карандаш, я стала искать и его, а потом ты пришла и позвала меня так неожиданно…
    0x4709, // Ты в порядке? Прошу прощения, я не нарочно—
    0x4758, // Всё нормально! Я в полном порядке – не переживай за меня.
    0x47C0, // Это ерунда, со мной и похуже бывало.
    0x4801, // Она спешно прерывает извинения Лилли, словно отвергает саму возможность, что шишка на голове может её хоть сколько-нибудь беспокоить.
    0x48F7, // Да… бывало и похуже, хе-хе-хе…
    0x492F, // Она нервно перебирает пальцами, а с лица Лилли никак не сходит встревоженное выражение; затем Юко без видимой причины начинает перекладывать с места на место какие-то бумаги.
    0x4A6F, // Юко немного ниже Лилли, на покрытом веснушками носике небрежно сидят очки. Её облик идеально соответствует стереотипам о внешнем виде библиотекаря.
    0x4B80, // Ах да, Лилли, ты получила моё сообщение?
    0x4BC8, // Сообщение… хм…
    0x4BE6, // А, о том, что прибыли новые зарубежные книги?
    0x4C37, // Именно! Именно! Наконец-то их доставили! Невероятно, что так долго, но—
    0x4CB8, // Внезапно прервав своё ликование, она обращает внимание на меня, отчасти – я почти уверен – чтобы сменить тему разговора, и застывает на месте.
    0x4DBD, // Ой, простите, я вас не сразу заметила!
    0x4E01, // Вы хотели взять книгу? Или вернуть? Извините! Извините!
    0x4E65, // Такая резкая смена настроения сбивает меня с толку.
    0x4EC4, // Он пришёл со мной. Юко, это Хисао, новый ученик. Хисао, это Юко, школьный библиотекарь.
    0x4F5F, // Приятно познакомиться.
    0x4F8A, // Хисао. Верно. Хисао. Я тоже рада познакомиться. Хисао.
    0x4FEB, // Она явно пытается отпечатать моё имя у себя в голове.
    0x504C, // Юко часто заказывает для меня книги на Брайле.
    0x50A1, // Ты не расскажешь Хисао вкратце о библиотеке?
    0x50F3, // Невинное предложение Лилли повергает библиотекаря в панику.
    0x5163, // Я… умоляю, Лилли, я не могу. Я не знаю, что именно его интересует. Это слишком большая ответственность.
    0x521D, // Я не понимаю, каким образом это может считаться ответственностью, но она выглядит так, будто скорее сгорит на месте, чем покажет мне полки с ранобэ.
    0x532A, // Но…
    0x5332, // А много здесь книг на Брайле?
    0x5367, // Я пытаюсь спасти ситуацию, спросив первое, что приходит в голову. Отчасти это срабатывает: Юко… не то чтобы приходит в себя, но начинает держаться чуть более расслабленно.
    0x54A0, // Ну… Думаю, примерно треть или четверть библиотеки «Ямаку» либо на Брайле, либо в аудиоформате.
    0x554E, // Резонно, учитывая количество слепых учеников.
    0x55A3, // А как вообще получилось, что библиотека настолько обширная?
    0x5611, // М-м-м, ну, мы регулярно получаем новые книги, потому что у школы хорошее финансирование. Наверное, так.
    0x56CA, // На книги тратится больше денег, чем на мою зарплату, а мне их потом ещё приходится по полкам расставлять.
    0x5789, // Книги ужасно тяжёлые, и расставлять их так трудно, что я иногда хочу уволиться.
    0x5819, // …
    0x581D, // За этими откровениями следует неловкое молчание.
    0x5878, // М-м, я, пожалуй, пойду осмотрюсь.
    0x58B2, // Думаю, для всех будет лучше, если этот разговор на этом и завершится.
    0x592F, // Очень хорошо. А пока, Юко, я хотела бы забрать те книги, если ты не против.
};

#endif // KS_A1_TUESDAY_PSEUDO_TEA_COSY_RU_TL_INDEX