#ifndef KS_SEPARATE_OF_SSS_AND_MC_RU_TL_INDEX
#define KS_SEPARATE_OF_SSS_AND_MC_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_C7A8F46F_ru_intl[] = {
    0x0000, // Ай!
    0x0006, // Придя в себя, я встречаю взгляд двух зелёных глаз размером с блюдца, удивлённо уставившихся на меня снизу.
    0x00C8, // Они принадлежат виновнице столкновения – низенькой девочке, распластавшейся передо мной на полу.
    0x017D, // Она озабоченно хмурит брови. Она одета в физкультурную форму, что довольно странно для большой перемены.
    0x023D, // …Однако больше всего в её внешности меня поражает то, что у неё нет ног.
    0x02C0, // Точнее, есть, но ненастоящие. Её бледные ножки заканчиваются бёдрами, а голени и ступни заменяет устройство то ли из металла, то ли из пластика чёрного цвета.
    0x03DF, // Это смотрится чрезвычайно неестественно. На мгновение я даже забываю о боли в груди.
    0x047A, // Девочка морщится, трёт нос и вскакивает.
    0x04C4, // Вот чёрт… Эй, ты в порядке? Прости, пожалуйста!
    0x0519, // Я бежала, а ты вдруг появился из ниоткуда… Прости, я нечаянно!
    0x058A, // Она смотрит на меня виноватыми глазами, будто наказанный щенок.
    0x05FF, // Я тут же забываю о всяком негодовании, ведь щеночки с таким вот взглядом – моя слабость.
    0x06A0, // Всё в порядке. Не волнуйся об этом… ай…
    0x06E9, // Хоть я и сказал, что всё в порядке, но понимаю, что подобный удар – одна из сильнейших опасностей; в моей груди растёт острая боль.
    0x07D5, // Не перегружать себя, не забывать про лекарства и, самое главное, остерегаться ударов в грудь.
    0x087F, // Я пытаюсь помассировать солнечное сплетение, чтобы ослабить боль, задерживаю дыхание, чтобы услышать сердцебиение.
    0x0954, // Кажется, всё уже в порядке…
    0x0987, // Эй, позвать врача?
    0x09A8, // Взволнованный, пронзительный голосок девочки приводит меня в чувство.
    0x0A2A, // Простояв в оцепенении несколько секунд, я внезапно осознаю, что сложившийся пополам и с болезненной гримасой на лице я выгляжу куда хуже, чем чувствую себя на самом деле.
    0x0B61, // Чёрт, я слишком беспокоюсь о своём сердце.
    0x0BAE, // Эм… не стоит, я уже в порядке.
    0x0BE4, // Я нахожу в себе силы выпрямиться, потирая напоследок рёбра, и делаю глубокий вдох.
    0x0C7A, // Она только что чуть не вышибла из меня дух. Но, похоже, обошлось.
    0x0CEE, // Точно в порядке? Я тебя крепко стукнула.
    0x0D37, // Всё нормально, я же сказал. Ничего не сломано. Жить буду.
    0x0D9D, // Это хорошо! Я—
};

#endif // KS_SEPARATE_OF_SSS_AND_MC_RU_TL_INDEX