#ifndef KS_A1_THURSDAY_ABOVE_AND_BEYOND_RU_TL_INDEX
#define KS_A1_THURSDAY_ABOVE_AND_BEYOND_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_D9415948_ru_intl[] = {
    0x0000, // Ханако не появляется на первом уроке, и её место на заднем ряду выглядит пустым и одиноким.
    0x00A6, // Если встречу её позже, надо будет сказать ей, что Лилли искала её.
    0x011D, // По сравнению с утренними событиями, урок невероятно скучный. Я лениво переворачиваю страницы учебника.
    0x01DB, // Несмотря на стремление не отставать по учёбе, пока я лежал в больнице, мне ещё во многом нужно нагонять школьную программу, но я совсем от этого не в восторге.
    0x02FB, // Часы над доской тикают невыносимо громко. Учитель ничего не говорит целых семь минут, вместо этого покрывая доску рядами формул, переписанных прямо из учебника.
    0x0422, // Мел постукивает по доске в такт тиканью часов.
    0x0477, // Я начинаю переписывать формулы, просто чтобы убить время, хоть они и взяты из учебника.
    0x0516, // После звонка заняться мне нечем и я ненадолго задерживаюсь, просматривая пройденный на уроке материал; я всё равно предпочитаю уходить последним, чтобы избежать столпотворения в коридоре.
    0x0671, // Сидзунэ и Миша тоже остаются, разговаривая с кем-то из другого класса.
    0x06F1, // Сидзунэ так быстро жестикулирует, что её руки свистят, как мечи, рассекающие воздух.
    0x078B, // Может быть, в этом есть сдерживаемая злоба.
    0x07DA, // Миша отчаянно пытается поспеть за ней, но ясно, что даже она с трудом её понимает.
    0x086E, // Я опускаю голову. Что бы они там ни обсуждали, это, кажется, дело серьёзное.
    0x08F6, // Сидзунэ жестикулирует так, что у неё хрустят запястья, а Миша пытается это всё протараторить.
    0x09A1, // Иногда она запинается, будто пытаясь произнести скороговорку. Но самое главное – ей ещё приходится переводить на язык жестов всё, что говорит их собеседница.
    0x0AC3, // Похоже, это непростая работёнка.
    0x0AFF, // Миша выглядит уставшей, будто вот-вот свалится в обморок.
    0x0B68, // К счастью для неё, дело вскоре решается и девушки садятся обратно на свои места.
    0x0BFA, // Уа-а-ах! Я так устала!
    0x0C20, // Она с измождённым видом опускает голову на парту.
    0x0C7B, // Я решаю использовать эту возможность, чтобы помириться с Сидзунэ, без повторного втягивания в разговор о Школьном совете, хотя подозреваю, что теперь эта дверь для меня закрыта.
    0x0DC0, // Должно быть, подготовка к фестивалю – дело утомительное.
    0x0E29, // В самом деле, все в этой школе воспринимают фестиваль очень серьёзно. Когда встречаю бездельничающих до или после уроков учеников, они всегда обсуждают свои планы, связанные с ним.
    0x0F73, // Приятно видеть всех настолько воодушевлёнными.
    0x0FCB, // Я, наверное, единственный, кому нечего делать.
    0x101F, // Сидзунэ сперва усмехается, будто решая, проигнорировать меня или сказать колкость, но в конце концов начинает жестикулировать, не сделав ни того, ни другого.
    0x113F, // Миша оживляется, наблюдая за её руками немного мутными глазами.
    0x11B4, // …
    0x11B8, // Она жестикулирует грубыми, тяжёлыми, театральными взмахами.
    0x1227, // Миша преобразует её жесты в слова.
    0x1266, // Она очень хорошо справляется, как будто на самом деле это Сидзунэ говорит, передавая через Мишу свои мысли.
    0x132A, // Она наверняка усердно тренировалась.
    0x136F, // Ну, мы в Школьном совете, знаешь ли, так что довольно заняты.
    0x13DC, // …
    0x13E0, // Обеспечение проведения фестиваля – наша важнейшая обязанность.
    0x1457, // …
    0x145B, // Мы опозорим себя перед старшими поколениями Школьного совета, если фестиваль не удастся.
    0x14FF, // …
    0x1503, // Поэтому не должно быть никаких упущений, никаких… э… по-моему, это было «помех», и ничего, что могло бы нарушить безукоризненность фестиваля.
    0x1607, // Снова так хорошо знакомая пылкая речь Сидзунэ и Мишина подача.
    0x167A, // А? Привет~!
    0x168D, // Взглянув через плечо, я замечаю Ханако, которая робко заглядывает в класс, спрятавшись за дверью.
    0x173F, // Эй! Опять изображаешь хулиганку?
    0x177B, // Лицо Ханако заливается краской в ответ на откровенный укол Миши, хоть та и сказала это в шутку.
    0x1828, // …
    0x182C, // Сидзунэ изучающе на неё поглядывает, заставляя Ханако опустить взгляд и попятиться, пока на виду не остаются лишь её пальцы, нервно стискивающие край двери.
    0x194B, // Может быть, её неприязнь к Ханако вызвана неприязнью к Лилли.
    0x19BB, // Похоже на то, и Ханако, вероятно, тоже это известно.
    0x1A18, // В чём дело, Ханако?
    0x1A3A, // С… Сюда приходила Лилли?
    0x1A68, // Извини, Сато здесь нет. Но она, м, утром заскакивала.
    0x1AC6, // Ханако продолжает скованно смотреть на Сидзунэ, которая глядит на неё в ответ изучающим взглядом. Что она пытается сделать?
    0x1BA9, // Конечно, Сидзунэ не собирается отводить взгляд, и она и без того устрашающая, так что я могу только догадываться, в каком ужасе сейчас Ханако.
    0x1CAB, // Немного неудобно наблюдать, как реагирует Ханако на обычное поведение Сидзунэ. Похоже, вот что случается, когда встречаются две абсолютные противоположности.
    0x1DCF, // Вы… вы не знаете, где она?
    0x1DFE, // …
    0x1E02, // Если в ней есть хоть капля здравого смысла, то она в своём классе, готовится к фестивалю. Но кто знает, где шатается эта женщина.
};

#endif // KS_A1_THURSDAY_ABOVE_AND_BEYOND_RU_TL_INDEX