#ifndef KS_A1_SATURDAY_QUIET_RU_TL_INDEX
#define KS_A1_SATURDAY_QUIET_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_CC05EA44_ru_intl[] = {
    0x0000, // Библиотека – место ничуть не хуже, чем остальные. Ханако, казалось, застиг врасплох уход Лилли, поэтому ей, возможно, хочется с кем-нибудь поговорить.
    0x0111, // Закинув портфель за плечо, я выхожу из класса.
    0x0165, // Я иду к библиотеке по коридору, проходя мимо множества закрытых дверей.
    0x01E8, // Из-за каждой доносится шум самоотверженных репетиций. За одной из них слышно ревущую почти как на концерте рок-музыку.
    0x02C1, // Думаю, в этом преимущество частной школы: здесь полно комнат, куда можно пойти в подобное время.
    0x0370, // И, кстати говоря, дворы и здания школы поддерживают в отличном состоянии. Наверняка это недёшево.
    0x0422, // Я слышал, что у этого места серьёзные спонсоры.
    0x0478, // Стены библиотеки лишь частично изолируют её от шума подготовки к фестивалю, доносящегося снаружи, но никаких других звуков больше не слышно.
    0x057B, // В ней не видно ни души. Все, видимо, либо наслаждаются погодой во дворе, либо работают над фестивальными проектами.
    0x064C, // Юко нигде нет. Наверное, она не работает по субботам.
    0x06AC, // Я спокойно прохожу по библиотеке, уже знакомый с её планировкой, и направляюсь в заднюю её часть, к маленькому уголку Ханако.
    0x0790, // По пути я провожу рукой по корешкам книг, ощущая неповторимую фактуру каждой, и пробегаю взглядом по названиям.
    0x085C, // В больничной библиотеке я делал так постоянно. Некоторые вещи, видимо, не меняются.
    0x08F4, // Как и запах библиотеки. Неважно, как вы заботитесь о ней, книжная бумага со временем портится.
    0x099F, // Наверное, в какую библиотеку вы бы ни пошли, где угодно в мире, там будет такой же запах.
    0x0A3E, // Я нахожу какое-то лёгкое чтиво, в которое можно углубиться, особо не включая мозг, и направляюсь в читальную зону искать Ханако.
    0x0B27, // И снова она сидит на пуфе, прислонившись спиной к книжной полке. Она медленно листает страницы той же книги, которую читала в классе.
    0x0C19, // В отличие от прошлого раза, когда мы здесь виделись, я тихо присаживаюсь на пуф. Шум привлекает её внимание, но не пугает.
    0x0CF5, // Этот деликатный обряд, через который нужно проходить каждый раз, когда я пытаюсь с ней заговорить, напоминает выслеживание зайца.
    0x0DE3, // Та же книга?
    0x0DF9, // Д-да… Я почти дочитала…
    0x0E26, // Круто.
    0x0E32, // Интересно, стоит ли мне…
    0x0E60, // Можно мне её одолжить, когда закончишь?
    0x0EA8, // Похоже, язык у меня опережает мысли.
    0x0EEA, // К-конечно… тебе м-может не понравиться, но…
    0x0F3B, // Уверен, она не так плоха. В конце концов, тебя ведь она затянула?
    0x0FAF, // Н-наверное.
    0x0FC4, // Я устраиваюсь поудобнее на своём пуфе и принимаюсь за книгу, лежавшую на дне моего портфеля.
    0x106D, // Это ранобэ про пиратов. Если честно, я едва пробегаю взглядом по словам, да и выбрал я эту книгу лишь потому, что обычно не читаю этот жанр.
    0x1168, // Чувствуя, что не смогу её осилить, и принимая во внимание то, что я уже отвлёк Ханако, я решаю попытаться начать разговор.
    0x1244, // Так, я смотрю, Лилли ушла без тебя?
    0x1282, // Она кивает прежде, чем отрывает взгляд от книги. Должно быть, она действительно ей сильно увлеклась.
    0x1339, // Лилли сказала, что ей надо пойти и… встретиться кое с кем…
    0x13A5, // Да?
    0x13AB, // С А-Акирой. Её сестрой…
    0x13D6, // Сестрой? Она не рассказывала про свою семью…
    0x1429, // Она… она раньше жила вместе с Акирой.
    0x146E, // Я думал, все ученики живут в общежитиях.
    0x14B7, // О-они… То есть мы… не обязаны.
    0x14EF, // Но так ведь легче, верно? То есть тут кормят и школа близко… Я в жизни так часто не приходил на уроки вовремя.
    0x15B5, // Она, на радость мне, украдкой улыбается.
    0x15FE, // Где-то в глубине меня сверлят мысли о домашней работе, но в библиотеке очень уютно. И никто меня не найдёт и не заставит работать ни над каким проектом.
    0x1711, // Мысль о фестивале наталкивает меня ещё на один вопрос…
    0x1777, // Эй, Ханако, а что ты планируешь делать на фестивале?
    0x17D5, // На долю секунды мне кажется, что она от неожиданности вот-вот подбросит книжку в воздух.
    0x1876, // П-прости?..
    0x1889, // Я спросил, что ты делаешь завтра на фестивале. Запланировала что-нибудь?
    0x190D, // Я… я не знаю.
    0x1925, // Ответ Ханако намекает на то, что она не желает, чтобы её расспрашивали. Думаю, толпы народа и громкая музыка – действительно не по ней.
    0x1A1A, // А, ладно.
    0x1A2A, // Смени тему, смени тему…
    0x1A56, // А какая из себя сестра Лилли?
    0x1A8B, // Она… она славная. Она симпатичная, как Лилли, но одевается… по-деловому…
    0x1B12, // По-деловому?
    0x1B29, // Она… она постоянно ходит в костюме…
    0x1B6D, // А, понятно. И от этого она выглядит менее симпатичной?
    0x1BCF, // Ханако смущённо трясёт головой.
    0x1C0A, // Н-нет… просто… по-другому.
    0x1C3C, // Признаю, я заинтригован. Во-первых, тем, что Ханако говорит о ком-то, кроме Лилли, а во-вторых, тем, что отзывается о ней лестно…
    0x1D22, // Но, пытаясь вообразить внешний вид этой таинственной сестры, я представляю только Лилли в костюме. И такая картина кажется довольно симпатичной. Весьма.
    0x1E3A, // Ну, как-нибудь меня с ней познакомишь.
    0x1E7F, // Х-хорошо.
    0x1E90, // Наша краткая беседа обрывается так же внезапно, как началась, и мы оба возвращаемся к своим книжкам.
    0x1F47, // Ход времени отражает только движение солнечного зайчика, отбрасываемого оконным стеклом.
    0x1FED, // Постепенно шумы от всевозможных репетиций в здании затихают, а затем и вовсе смолкают по мере того, как ученики устают и отправляются есть.
    0x20EC, // Уже сама мысль об этом заставляет мой желудок завязаться в узел. Видимо, пора возвращаться.
    0x2193, // Как ты думаешь, Лилли уже вернулась? Вернусь-ка я в общежитие. Утомился за эту неделю.
    0x222E, // И это правда. Переход в новую школу, которая готовится к главному событию года, оказался, мягко говоря, тягостным.
    0x22FD, // Я чувствую, как начинаю клевать носом за чтением.
    0x2357, // Х-хорошо. Я… я, наверное, ещё посижу тут.
    0x23A0, // Взглянув на книгу Ханако, я замечаю, что ей до конца осталось всего несколько страниц.
    0x243D, // Поначалу решив подождать её, я меняю решение, когда желудок снова принимается урчать.
    0x24DA, // Конечно. Ну, я пойду, пока не стемнело. Ещё увидимся, ладно?
    0x2544, // Д-да. Увидимся, Хисао.
    0x256B, // Пока.
    0x2575, // Х-Хисао?
    0x2584, // М-м?
    0x258B, // С-спасибо. Ч-что побыл со мной.
    0x25C2, // Я вижу, как трудно ей произнести это простое предложение. На секунду я замираю.
    0x2652, // Вот как. Выходит, в этой школе есть кто-то ещё более одинокий, чем я. Может быть, «одинокий» и неподходящее слово, ведь я не страдал отсутствием общества на протяжении всей недели, но всё равно чувствовал себя здесь чужим.
    0x27E3, // Может, «одинокая» и для Ханако слово неподходящее: у неё, в конце концов, есть Лилли, ведь так?
    0x288D, // Я понимаю, что уже слишком долго стою без ответа, и расплываюсь в широкой, искренней улыбке.
    0x2934, // Всегда пожалуйста.
    0x2957, // Спокойной ночи, Ханако.
    0x2982, // С-спокойной ночи.
    0x29A2, // Я ухожу, оставляя её дочитывать книгу, и направляюсь в общежитие в надежде наконец-то поесть…
};

#endif // KS_A1_SATURDAY_QUIET_RU_TL_INDEX