#ifndef KS_A1_THURSDAY_COLD_WAR_RU_TL_INDEX
#define KS_A1_THURSDAY_COLD_WAR_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_9C179BFC_ru_intl[] = {
    0x0000, // Сегодня я вхожу в класс первым и понимаю, что пришёл слишком рано. Но всё же сидеть здесь одному двадцать минут куда лучше, чем мучиться, проводя их с Кендзи.
    0x011D, // От утомлённости в сочетании с разочарованием и скукой я чувствую себя смертельно уставшим.
    0x01C5, // Отключившись на секунду, я просыпаюсь от удара головой о парту. Потирая лоб, я понимаю, что сейчас не стоит засыпать, а в будущем – приходить в класс так рано.
    0x02E4, // Наконец я слышу постукивание в коридоре и в дверном проёме появляется высокая фигура Лилли. Должно быть, она ищет Ханако.
    0x03C2, // Лилли нерешительно замирает в дверях, будто вампир, который не может войти, если его не пригласить. Думаю, надо позвать её, так как она, стоя там, выглядит покинутой.
    0x04ED, // Однако она входит по собственной воле, после того как расправляет юбку и поправляет воротник, как будто важно выглядеть опрятно, когда входишь в наш класс.
    0x0609, // Извините.
    0x061B, // Она пробует учтивым голосом обратиться к тихой комнате. Я догадываюсь, что из-за слепоты тишина её, возможно, тревожит, и поэтому нарушаю молчание.
    0x0727, // Доброе утро, Лилли.
    0x074A, // Хисао? Доброе утро. Я не слышала, как ты вошёл.
    0x079D, // Интересно, ей кажется подозрительным, что я не сказал ничего раньше? Вероятно. Если я теперь скажу что-то неправдоподобное, это меня потопит.
    0x089E, // Ну, я уже был здесь, просто спал.
    0x08D8, // Понятно. А ты сегодня, случайно, не видел Ханако?
    0x0930, // Нет, она обычно приходит перед самым звонком… Или после. Я могу ей что-нибудь передать.
    0x09CF, // В этом нет необходимости. Странно, но мне кажется, что мы сейчас с тобой одни в школе: я никого не слышала, пока шла сюда.
    0x0AA8, // Наверное, не стоило мне сегодня так рано вставать.
    0x0B04, // Ты себя ругаешь за то, что не помешало бы делать другим? Пунктуальность – хорошая черта. По крайней мере, я так считаю.
    0x0BDB, // Сегодня суетливое утро. Близится фестиваль, а сегодня – последний срок регистрации мероприятий, сдачи бюджетных отчётов и прочих официальных бумаг.
    0x0CED, // Такое ощущение, что все пытаются заполнить формы в последнюю минуту. Может быть, поэтому сегодня так тихо.
    0x0DAF, // Привет-привет~!
    0x0DCB, // В комнату, как по сигналу суфлёра, входят Сидзунэ и Миша. Последняя кричит своё приветствие так громко, что Лилли заметно вздрагивает.
    0x0EC0, // Привет, Хиттян~!
    0x0EDD, // Привет.
    0x0EEB, // …
    0x0EEF, // Посмотрите, это же староста~! Здрасьте~!
    0x0F37, // Лилли улыбается, видимо позабавленная словом «посмотрите» от Миши (или Сидзунэ).
    0x0FCB, // Доброе утро.
    0x0FE2, // …
    0x0FE6, // Ты, конечно, староста не этого класса, верно, верно~?
    0x1044, // Не этого.
    0x1055, // Во время разговора с Сидзунэ Лилли подбирает слова гораздо тщательнее, чем на днях в разговоре со мной. Думаю, они совсем не ладят.
    0x1143, // Затем до меня доходит, что Лилли может в действительности не знать, здесь ли Сидзунэ, и пытается определить это, чтобы понять, с кем именно разговаривает.
    0x125B, // Всё, что она знает, – это то, что говорит с Мишей. Но, поскольку всем известно, что они с Сидзунэ практически неразлучны, Лилли, скорее всего, подозревает, что на самом деле «говорит» именно Сидзунэ.
    0x13C1, // Чёрт, как всё сложно. Я решаю помочь Лилли, скорее для собственного спокойствия.
    0x1453, // Ты сегодня рано, Сидзунэ.
    0x1481, // …
    0x1485, // Да ты ещё раньше нас пришёл!
    0x14B8, // Миша злобно надувает щёки. Почему она злится? Ей передаются эмоции Сидзунэ?
    0x1542, // Однако неудивительно, что Сидзунэ не нравится моя реплика. Действительно, я пришёл раньше них, так что подобную мою фразу можно истолковать как угодно.
    0x1657, // Тем более Сидзунэ не может определить смысл по тону.
    0x16B7, // Пока я оцениваю, следует ли мне извиниться, Сидзунэ продолжает.
    0x172B, // …
    0x172F, // Староста~! Хорошо, что ты здесь~! Нам надо поговорить.
    0x178F, // …
    0x1793, // Фестиваль уже через три дня, так? Остальные классы уже сдали свои отчёты по бюджету! Даже первоклашки! Все, кроме тебя~!
    0x186B, // Ва-ха-ха~!
    0x187C, // Ведь ещё есть время, чтобы сдать, верно?
    0x18C4, // …
    0x18C8, // Сегодня! Сегодня – последний срок! Ты как-то не торопишься, да? Если бы всё было по-моему, я бы уже давно собрала все нужные бумаги, но кое-кто~! решил попросить: «Пожалуйста, отодвиньте сроки~!»
    0x1A24, // Да, это была я. Планировать что-то такого масштаба – нелёгкая задача, и недели слишком мало, чтобы ожидать от целого класса полного её решения.
    0x1B28, // …
    0x1B2C, // Хочешь знать, что труднее, чем распределять бюджет для одного класса? Решать тот же вопрос для каждого класса в школе и ещё многое другое~! Тот, кто это делает, – я!
    0x1C54, // Миша, выпрямившись, упирает руки в боки. Ух, как вжилась в роль. Однако Лилли совсем не до смеха.
    0x1D01, // Эй, Сидзунэ, не слишком ли ты с ней сурова? Ещё ведь есть целый день.
    0x1D7B, // Не надо, Хисао. Всё в порядке.
    0x1DB0, // Лилли, кажется, рада, что я принял её сторону, но, видимо, смущена мыслью о том, что я могу подумать, будто она сама за себя не может постоять.
    0x1EAD, // Если ты говоришь о бюджетной отчётности, то меня печалит, что ты думаешь, будто я о ней забыла. Я понимаю, как она важна.
    0x1F85, // …
    0x1F89, // Тогда~! Прошу, передай её мне.
    0x1FBE, // Сидзунэ, у Лилли может не быть её с собой.
    0x2009, // Она сейчас не здесь. Я попросила двух учеников с ней разобраться. Учеников из моего класса.
    0x20AF, // Последнее предложение она, к моему удивлению, выделяет особо. Она знает о попытках Сидзунэ и Миши затащить меня в Школьный совет?
    0x219B, // Наверное, разошлись слухи и теперь она использует меня в качестве оружия против Сидзунэ. Становится всё интереснее…
    0x2272, // …
    0x2276, // Это было твоей обязанностью~! Бюджетную отчётность нельзя просто переложить на кого-то; держать всё под контролем – твоя работа как старосты! Подобное пренебрежение порядками – просто ужас~!
    0x23D5, // Они были способны его завершить и сделали это, но недавно заболели, поэтому не могли прийти в школу, чтобы вернуть его мне. Если хочешь, я от их имени извинюсь перед тобой за болезнь.
    0x251F, // Давай~!
    0x252C, // Хотя Миша и не понимает небольшую подколку Лилли, Сидзунэ всё ясно, и она, кажется, разрывается между тем, чтобы оскорбиться, и тем, чтобы возрадоваться возможности начать перепалку.
    0x2678, // …
    0x267C, // Лилли, они разве не возле школы живут? Это всего пять минут пешком~.
    0x26F6, // Что у них есть такого важного, что не даёт им выкроить и пяти минут из своего «плотного графика»… ради того, чтобы занести вещь, которая повлияет на веселье для всего их класса?
    0x2838, // Лилли открывает рот, чтобы что-то сказать, но Сидзунэ подходит к Лилли и начинает яростно жестикулировать, размахивая руками, как дирижёр.
    0x2935, // Миша пытается изо всех сил передать ту же страсть, но не может избавиться от своего обычного весёлого тона. Результат получается интересным и в чём-то сюрреалистичным.
    0x2A68, // …
    0x2A6C, // И что это вообще за позиция~? Я говорила, что это не то, что можно переложить на других; ты староста класса или нет?
    0x2B3A, // Назови мне имена тех двоих: им нужно занять твоё место, раз ты не можешь справиться даже с такой простой задачей.
    0x2C07, // Мои обязанности не ограничиваются заполнением одной-единственной формы.
    0x2C8E, // Тон Лилли становится немного нетерпеливым, но она хорошо скрывает от Сидзунэ своё волнение. Она не раскрывает свои карты.
    0x2D6D, // Зато Сидзунэ с улыбкой придерживает пальцами очки, зная, что Лилли не может ни видеть, ни слышать того, как она возбуждена.
    0x2E4C, // …
    0x2E50, // О, конечно, ты так занята, староста~! Быть тобой наверняка так трудно~!
    0x2ECE, // Лилли сжимает губы в ответ на слова Миши, ясно понимая их цель, хотя Миша и передала их даже без намёка на сарказм.
    0x2F9D, // Сидзунэ и Лилли друг друга не любят, это ясно, но это уже слишком. Терпение Лилли, похоже, лопается, и она готовится нанести ответный удар.
    0x3097, // Перед тем как ты пришла, я как раз обсуждала бюджетную отчётность. Ты, наверное, очень одарённая, раз смогла закончить все свои дела в Совете так быстро, что можешь теперь выслеживать меня, дабы убедиться, что я не забуду о своих.
    0x3236, // Ты обвиняешь меня в безделье? Похоже, ты путаешь меня с собой~!
    0x32A7, // Не думаю. Для меня это было бы сложновато – сравнивать себя с тобой.
    0x3323, // Ты права, мы с тобой – как рай и ад.
    0x3362, // И нетрудно догадаться, что именно олицетворяешь ты.
    0x33C1, // Воздух между ними дрожит от жара их неприязни. Ну, не в прямом смысле, конечно. Но всё равно они не могут её больше скрывать. Даже Миша, кажется, начинает понимать истинную суть этого разговора.
    0x351F, // …
    0x3523, // Хиттян~! Ты тоже не сачкуй~!
    0x3554, // О чём ты?
    0x3564, // …
    0x3568, // Разве ты не идёшь на фестиваль, Хиттян? Ведь идёшь же? Тогда~! Надеюсь, ты постараешься на его благо лучше, чем она~!
    0x3637, // Не втягивай меня в это! Я свою часть сделал!
    0x3686, // Эй, да ладно тебе. Дай нам с Лилли поблажку…
    0x36D6, // Лилли, скоро начнётся урок, мы потом ещё сможем поговорить. Я передам Ханако, что ты её искала.
    0x3781, // Я затылком чувствую, что Сидзунэ прямо оцепенела. Наверное, её впервые настолько грубо проигнорировали.
    0x3840, // Спасибо, Хисао. Тогда я пойду.
    0x3876, // Она улыбается мне самой милой улыбкой, что я видел за эту неделю, и разворачивается, чтобы выйти.
    0x3926, // Как только Лилли выходит за дверь, я вдруг начинаю ощущать сильное нежелание поворачиваться лицом к Сидзунэ.
    0x39EE, // Я чувствую, как её взгляд впивается мне в спину, и не могу заставить себя посмотреть на неё. Она, должно быть, в ярости. Я жду, что Миша что-нибудь скажет, чтобы смягчить напряжение, но, видимо, ожидаю слишком многого.
    0x3B73, // В конце концов я сажусь на своё место, слушая шаги удаляющейся из класса Сидзунэ. Она возвращается только за несколько минут до начала урока.
    0x3C75, // Потом иду и сажусь на своё место, не прислушиваясь к концу спора между Лилли и Сидзунэ.
    0x3D13, // Наконец Лилли покидает наш класс, а Сидзунэ с Мишей молча рассаживаются.
    0x3D98, // Я чувствую, как взгляд Сидзунэ впивается мне в спину. Она наверняка злится на меня, но я тоже на неё зол.
    0x3E54, // Не понимаю, зачем ей надо было втягивать меня в ссору.
    0x3EB6, // Я поворачиваюсь к ним спиной.
};

#endif // KS_A1_THURSDAY_COLD_WAR_RU_TL_INDEX