#ifndef KS_A1_TUESDAY_SHARED_LIBRARY_RU_TL_INDEX
#define KS_A1_TUESDAY_SHARED_LIBRARY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_C5D0C529_ru_intl[] = {
    0x0000, // Моё первое впечатление оправдалось: библиотека удивительно большая.
    0x007F, // Прогуливаясь узкими проходами, я изучаю корешки книг, время от времени вытаскивая какую-нибудь, чтобы прочитать аннотацию и забрать, если книга покажется интересной.
    0x01B0, // Через несколько минут у меня набирается порядочная стопка.
    0x021D, // Думаю, проблем с выбором у меня здесь не возникнет.
    0x027A, // Это место пропитано знакомой мне атмосферой. Несмотря на множество книг с крупным шрифтом и на Брайле, это самая настоящая библиотека.
    0x0371, // Кажется, что безмятежность комнаты, в которой мы с Лилли пили чай, перебралась сюда вместе с нами. Или она была здесь всегда?
    0x0453, // Благодаря этому ощущению ко мне возвращается прежнее умиротворение.
    0x04D2, // Дойдя до конца прохода, я вижу несколько парт, поставленных для занятий. Но любопытство ведёт меня дальше, вперёд, где я обнаруживаю уютный уголок за стеллажами.
    0x05F8, // В то время как в остальных частях библиотеки можно изредка встретить читающего или украдкой спящего ученика, эта часть кажется безлюдной.
    0x06F6, // Но, оглядевшись по сторонам, я замечаю кое-кого знакомого на одном из пуфов.
    0x0780, // Темноволосая девочка из моего класса. Та, что ушла с середины урока.
    0x07FC, // Она читает книгу. И очень увлечённо, судя по тому, как она уткнулась в неё носом.
    0x088D, // Сегодняшним своим поведением она произвела впечатление скорее хулиганки, нежели книжного червя. Её таинственное исчезновение из класса породило у меня в голове кучу вопросов.
    0x09D1, // Интерес медленно, но верно берёт своё, и я сам не замечаю, как направляюсь в её сторону.
    0x0A6F, // Думаю, ничего страшного, если я ей представлюсь. Она же, в конце концов, моя одноклассница.
    0x0B13, // Пройдя к соседнему пуфу, я сажусь и кладу книги рядом.
    0x0B75, // Девочка вздрагивает и испуганно смотрит на меня из-под чёлки.
    0x0BE6, // Впервые я вижу её так близко. Под длинной, густой чёлкой по меньшей мере треть лица, если не половина, покрыта серьёзными шрамами.
    0x0CD2, // Я бросаю взгляд на шрамы, неосознанно пытаясь увидеть их сквозь волосы, и случайно встречаюсь с ней глазами.
    0x0D98, // Смутившись, я спешу перевести взгляд на её книгу, впрочем сразу сообразив, что так будет только хуже.
    0x0E50, // Я…
    0x0E56, // Я… Я…
    0x0E62, // Я?..
    0x0E68, // Ядолжнаидтиуменядела!
    0x0E92, // Без предупреждения Ханако срывается и бежит к выходу.
    0x0EF5, // Её действия застают меня врасплох, что даёт ей немалую фору, прежде чем я отправляюсь в погоню.
    0x0FA2, // Когда я добегаю до стойки библиотекаря, её уже нигде не видно.
    0x1013, // Лилли и Юко беззаботно болтают в сторонке.
    0x1061, // Понимая, что ни за что не догоню Ханако, я подхожу к ним.
    0x10C6, // Эй, вы не видели… э… не заметили пробегавшую мимо девочку?
    0x1132, // М, возможно… как она выглядела?
    0x116C, // Длинные тёмные волосы. Немного стеснительная. И у неё были… ну… шрамы… на лице.
    0x11FF, // Уж не о Ханако ли ты говоришь?
    0x1235, // Да, именно о ней. Я увидел, как она читала, и хотел поговорить с ней, но, думаю, я её спугнул или что-то вроде того.
    0x12FF, // Ах, боже мой. Юко, с твоего позволения, мне лучше пойти и найти её.
    0x1375, // К-конечно. Я просто подожду тут с книгами.
    0x13C1, // Эй, что происходит?
    0x13E4, // Извини, но объяснения придётся отложить до следующего раза.
    0x1452, // Ладно. Тогда до встречи…
    0x1480, // Лилли стремительно хватает свою трость и спешит прочь, оставив меня наедине с Юко.
    0x1517, // Думаю, я никогда не научусь себя здесь вести.
    0x1569, // Я сделал что-то неправильно?
    0x159D, // А что ты сделал?
    0x15BA, // Но как же мне тогда вести себя с этими людьми? Держаться как ни в чём не бывало будет лицемерно.
    0x1667, // Как будто я пытаюсь не обращать внимания на очевидную проблему.
    0x16DC, // Юко начинает ёрзать, будто хочет что-то сказать, но не решается.
    0x1750, // Думаю, это проблема только в том случае, если ты её так воспринимаешь.
    0x17CF, // Вероятно, она не слишком сдержана. Я лишь слегка улыбаюсь, и она заливается краской.
    0x1868, // Ч… Что? Я сказала глупость?
    0x189A, // Нет-нет, наоборот, это очень мудро. Наверное, ты права: дело скорее во мне.
    0x191F, // К этому нечего добавить. Чтобы заполнить тишину, Юко начинает перебирать на столе какие-то бумаги.
    0x19D3, // Я заметил, что люди, у которых водятся бумаги на столе, любят это дело.
    0x1A52, // Ты выбрал какие-нибудь книги? Мне скоро закрываться. То есть библиотека закрывается. Но закрыть её должна я. Надеюсь, это не причинит тебе неудобств?
    0x1B61, // А, да, я взял несколько книг, но оставил их там, потому что…
    0x1BCC, // …Короче, сейчас принесу.
    0x1BFA, // Я возвращаюсь за стопкой книг, оставленной у пуфов, где мы столкнулись с Ханако.
    0x1C8C, // Ух. Ты так много читаешь?
    0x1CB9, // Честно говоря, сам удивляюсь. Когда задумываюсь над этим.
    0x1D22, // Последние несколько месяцев у меня было много свободного времени, и я просто… начал читать, чтобы убить время. Больше я ничего и не мог.
    0x1E1A, // Ясно.
    0x1E24, // Больше она не произносит ни слова, молча оформляя выдачу книг.
    0x1E96, // Видимо, это тут и зовётся тактом.
    0x1ED2, // Привет! Я новенький, Хисао Накай. Твой одноклассник.
    0x1F31, // Извини, я не хотел тебя напугать.
    0x1F6D, // Ничего! Я просто… говорил с ней. Пытался познакомиться. Хотя даже толком не начал…
    0x2005, // Юко вздыхает. Похоже, мои слова встревожили её ещё больше.
    0x206F, // Думаю, не «неправильно», а скорее «бестактно».
    0x20C4, // «Бестактно»?
    0x20DC, // Та девочка – особый случай. Она почти ни с кем не разговаривает.
    0x2151, // По-моему, это немного… ненормально.
    0x2193, // Может быть… но уж такая она, и тут ничего не поделаешь, наверное.
    0x2209, // Слова Юко звучат не слишком убедительно, но, возможно, здесь подобное в порядке вещей.
    0x22A6, // У каждого тут свои проблемы, иначе они сюда не попали бы.
    0x230D, // Наверное, я и правда поступил бестактно.
    0x2357, // Ничего! Я просто смотрел книги, а она внезапно вскочила и убежала.
    0x23CF, // Самое оскорбительное, что я мог сделать, – пару раз посмотреть в её сторону.
    0x245A, // Ну, она очень робкая девочка.
    0x248F, // Тебе надо быть с ней осторожным. Она может очень сильно нервничать, потому что не привыкла общаться с людьми.
    0x2556, // По-моему, это немного… ненормально.
    0x2598, // Может быть… но уж такая она, и тут ничего не поделаешь, наверное.
    0x260E, // Слова Юко звучат не слишком убедительно, но, возможно, тут такое в порядке вещей.
    0x26A1, // У каждого тут свои проблемы, иначе они сюда не попали бы.
};

#endif // KS_A1_TUESDAY_SHARED_LIBRARY_RU_TL_INDEX