#ifndef KS_A1_TUESDAY_BIZARRE_AND_SURREAL_RU_TL_INDEX
#define KS_A1_TUESDAY_BIZARRE_AND_SURREAL_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_01AD85B6_ru_intl[] = {
    0x0000, // Удерживая стопку книг одной рукой, я нащупываю в кармане ключ от двери.
    0x0082, // Внезапно раздавшийся за спиной звук заставляет меня вздрогнуть, и я чуть не роняю и книги, и ключ, который уже почти вставил в замок.
    0x0173, // Кто это?
    0x0182, // Я поворачиваюсь на голос. Это Кендзи. Похоже, он в хорошем расположении духа, но отсвет очков в темноте придаёт ему зловещий вид.
    0x026C, // Всего лишь я.
    0x0284, // Он молчит, нервно облизывая губы.
    0x02C1, // Какой ещё «я»? Не знаю никаких «я». Снова какой-то новенький?
    0x032F, // Его речь вдруг становится быстрой и напряжённой.
    0x0389, // Да… но мы уже встречались. Вчера.
    0x03C6, // Не думаю. Я бы запомнил того, кого видел только вчера. Когда это было? Какой сегодня день?
    0x0467, // Я ничего не отвечаю. Он что, так шутит?
    0x04AC, // Докажи, что мы уже встречались!
    0x04E5, // Ты живёшь напротив. Тебя зовут Кендзи.
    0x052B, // Кендзи отскакивает назад, его глаза наполняются страхом и недоумением.
    0x05AE, // Откуда ты знаешь моё имя? Чёрт, это может значить только одно из двух: либо мы и правда встречались и я забыл об этом, либо ты шпион.
    0x069B, // Он делает паузу.
    0x06B9, // Шпион-экстрасенс.
    0x06DA, // Он мечется взглядом по сторонам, пытаясь заглянуть в комнату за моей спиной, хотя у меня сложилось впечатление, что он едва ли видит что-то через свои толстенные очки.
    0x080A, // Из дружелюбного его настроение менее чем за минуту превратилось в маниакальное.
    0x089E, // Я не экстрасенс.
    0x08BC, // Откуда мне знать? Я не умею читать мысли.
    0x0906, // Кендзи осуждающе тычет пальцем мне в лицо.
    0x0954, // …В отличие от тебя!
    0x0978, // Прекрати, чувак. Мы вчера встречались. Да что с тобой? Я живу в этой комнате.
    0x0A01, // Ложь. Если ты считаешь, что сможешь выдать себя за Хисао только потому, что у меня проблемы со зрением, ты глубоко ошибаешься.
    0x0AE5, // Ты даже на него не похож. То есть сходство очень, очень отдалённое. Разве что издалека, но кого ты пытаешься обмануть?
    0x0BBA, // Мне хочется схватить его за плечи и встряхнуть. Я раздражённо тру глаза и вздыхаю.
    0x0C50, // Стой на месте.
    0x0C6A, // Кендзи начинает аккуратно, шаг за шагом, приближаться. Я стою ровно, чтобы не спровоцировать его… Хотя сомневаюсь, что он сможет причинить много вреда.
    0x0D7F, // А, стоп, теперь вижу. Блин, это и правда ты.
    0x0DCB, // Тяжело вздохнув ещё раз, а затем и ещё раз, я на всякий случай отхожу назад.
    0x0E53, // Как жизнь, чувак? Ты неважно выглядишь… кажется. Что-то случилось?
    0x0ECC, // Ничего особенного. Просто со мной приключилась дурацкая история. Точнее, даже несколько, не считая этой.
    0x0F8B, // Я не могу наладить нормальный контакт с людьми здесь и не могу понять, во мне дело или в них.
    0x1032, // Не знаю, зачем я всё это рассказываю Кендзи. Ведь с ним у нас тоже вроде как не очень ладится.
    0x10DA, // Это печально, чувак. Кстати, прости за то, что назвал тебя шпионом-экстрасенсом и прочее: лучше перебдеть, чем недобдеть.
    0x11B5, // Такова наша жестокая реальность.
    0x11F2, // Думаю, у Кендзи реальность всё-таки какая-то своя.
    0x124D, // Понимаешь, так уж устроен мир. В нём нет справедливости. Понимаешь? Но, даже проигрывая, я выигрываю, потому что усвоил урок.
    0x132E, // …Ты это вообще к чему?
    0x1357, // Проехали.
    0x1369, // Он резко отмахивается.
    0x1393, // Так что стряслось? Почему такой угрюмый? Ты ведь угрюмый?
    0x13FB, // Да ничего. Просто случайно спугнул одну девушку. Она в прямом смысле слова убежала от меня.
    0x14A1, // Думаю, я сам виноват. Просто… не привык к здешним порядкам.
    0x150D, // Девушку? Симпатичную?
    0x1535, // Симпатичную? Сложный вопрос. У неё красивая фигура и поистине роскошные волосы… но лицо…
    0x15DA, // Тут много милашек. Просто парадоксальное количество… Я считаю, что это один из тёмных секретов нашей школы.
    0x16A0, // Я пытался предупредить, но слушал ли ты…
    0x16EB, // Не припоминаю подобных предупреждений.
    0x1734, // Тёмных секретов?
    0x1753, // Да, тёмных секретов. Чрезвычайно тёмных. Как чёрная дыра.
    0x17BB, // Ты заметил, что девушек в этой школе пусть ненамного, но явно больше, чем парней? Примерно шестьдесят к сорока.
    0x1884, // Он отворачивается, устремив взгляд вдаль.
    0x18D1, // Почему так? На первый взгляд всё в порядке, но это же разница в целых двадцать процентов!
    0x1972, // Можно было бы подумать, что школа с такой кучей женщин – мечта любого мужчины. Но нет!
    0x1A0E, // То, что я сейчас скажу, сорвёт тебе башню. Ты готов?
    0x1A6A, // Я не знаю, к чему всё это, но решаю, что не слишком много потеряю, если не стану его слушать.
    0x1B0E, // Нет, не готов.
    0x1B27, // Я уже берусь за дверную ручку, но Кендзи продолжает говорить – очевидно, его самого перспектива сноса моей башни волнует мало.
    0x1C0F, // Я считаю, что эта школа – поле битвы. Отсюда начнётся феминистское нашествие.
    0x1C9D, // Неравенство численности мужчин и женщин – верный знак того, что они преуспели. Если «холодная» война станет «горячей», у них будет численный перевес.
    0x1DB0, // И это лишь очередной бой в бесконечной войне против феминистских сил… Они повсюду. В Японии женщин больше, чем мужчин. Пока отношение не 60 к 40, но, чувак, это только вопрос времени…
    0x1EF9, // Даже в Америке женщин – большинство. Они набирают мощь. Исторически наращение военных сил всегда было верным знаком надвигающейся войны.
    0x1FF6, // Япония – это только первый шаг. Наша экономика очень крута, а сама страна, хоть небольшая и изолированная, всё же играет огромную роль в тихоокеанской политике.
    0x211B, // Идеальная цель. Они коварны… Как и подобает женщинам.
    0x217E, // Настанет день, когда…
    0x21A7, // Кендзи угрожающе замолкает.
    0x21DB, // Вот почему им нельзя доверять. Они обманут тебя, а потом убьют, так же как убили меня. Тебя ждёт та же участь.
    0x229F, // Да чёрта с два…
    0x22BC, // Я не могу сдержаться и произношу это вслух.
    0x230B, // Эй! Какого чёрта это значит?!
    0x233F, // И это ты меня спрашиваешь?
    0x236F, // Это лучшее из того, что я могу придумать.
    0x23B9, // И что? Ты не должен был так реагировать на мою речь! Это чертовски грубо.
    0x243C, // Так на чём я остановился? Ах да, великий феминистский заговор.
    0x24AD, // Стой. Прекрати! Я давно уже перестал понимать, о чём ты. Начиная где-то с «феминистского нашествия».
    0x2562, // Сложно воспринять на слух? Ничего, у меня в комнате есть кое-какие графики. И куклы. Любишь кукол?
    0x2612, // Никаких кукол.
    0x262D, // Не любишь кукол, ладно. Но против графиков ты ничего не имеешь, да?
    0x26A5, // Он говорит энергично, не дожидаясь моих ответов, при этом внушительно и грозно жестикулируя, точно античный оратор.
    0x2779, // Какой-то он чудаковатый. А ведь я поначалу принял его за вполне нормального парня.
    0x280F, // О чём задумался, чувак?
    0x2839, // О том, каково это – быть последним здравомыслящим человеком в безумном мире.
    0x28C6, // Кендзи хмурится, принимая расстроенный вид.
    0x2917, // Ты про себя, да? Это невозможно, ибо я – тот последний здравомыслящий в безумном мире. Это моя мечта, а ты не можешь так просто украсть у человека мечту.
    0x2A2A, // Какого чёрта? Не может быть двух последних здравомыслящих. Тогда бы нельзя было сказать «последний»… а это как раз самое важное!
    0x2B16, // Должен остаться только один. Как в том иностранном фильме, где должен был остаться лишь один, и один чувак и остался, потому что в этом была вся суть.
    0x2C24, // Я никогда раньше не видел, чтобы человек так самозабвенно, с таким жаром отстаивал какой-то пустяк.
    0x2CD9, // Ну ладно, если ты подождёшь, я вынесу графики. Ещё у меня есть список других тёмных и замысловатых заговоров, за которыми стоит эта школа, запутанных, словно…
    0x2DF9, // Срочно, закончи метафору. Будь другом.
    0x2E3F, // Всё, я пошёл спать. Время уже очень позднее.
    0x2E8E, // Что-то это не похоже на метафору. Ну и ладно.
    0x2EDE, // Ты мне нравишься. Похоже, ты – классный чувак.
    0x2F32, // Большинство людей ничего не понимают, когда я пытаюсь открыть им глаза на этот широкомасштабный феминистский заговор. Они отказываются принять истину, и это ужасно.
    0x3061, // До встречи.
    0x3076, // Он хлопает меня по спине на прощание, а затем быстро и тихо исчезает за дверью, словно пройдя сквозь неё, как призрак.
    0x314B, // Я и не пытаюсь переварить всё, что мне наговорил сейчас Кендзи, а просто захожу в свою комнату, скидываю башмаки и падаю на кровать вниз лицом.
    0x324E, // Проходит немало времени, прежде чем я прихожу в себя и принимаюсь за домашнее задание.
    0x32EC, // Это из-за простыней. В их приятной прохладе хочется просто валяться с закрытыми глазами.
    0x338E, // Эта школа кажется мне резервацией абсурда. Сокрытая на вершине горы, где обитатели – один причудливей другого.
    0x345A, // И мне тут совсем не место. Какая ирония: не удаётся вписаться в компанию, состоящую из людей, которые никуда не вписываются.
    0x353B, // Может быть, я слишком упорно стараюсь?
    0x3581, // Я говорю это вслух, но легче от этого не становится – слова лишь отражаются эхом от голых стен.
    0x362E, // Впрочем, всё могло быть и хуже. По крайней мере, это место больше похоже на школу, чем на больницу, замаскированную под школу, как я думал вначале.
    0x3736, // Да и пейзаж красив.
    0x3759, // Я приоткрываю один глаз, чтобы взглянуть на склянки с лекарствами, стоящие на письменном столе бок о бок с учебниками.
    0x3831, // Может быть, это место даже слишком похоже на обычную школу.
    0x389D, // Симпатичная.
    0x38B5, // Не очень.
};

#endif // KS_A1_TUESDAY_BIZARRE_AND_SURREAL_RU_TL_INDEX