#ifndef KS_A1_TUESDAY_SMALLTALK_RU_TL_INDEX
#define KS_A1_TUESDAY_SMALLTALK_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_29E71EEB_ru_intl[] = {
    0x0000, // Я просыпаюсь в незнакомой комнате.
    0x0040, // Прошлым вечером я забыл занавесить окно, поэтому светло-серый потолок залит ярким утренним светом.
    0x00F6, // Я?
    0x00FA, // Это ведь моя комната?
    0x0121, // Моя комната…
    0x013A, // Уже третья за этот год комната, которую я должен считать своей.
    0x01AD, // Вокруг расставлены мои вещи, а это значит, что комната действительно моя.
    0x0233, // Мои сумки на полу, мои новые учебники на столе.
    0x0288, // Мои бесчисленные лекарства на тумбочке.
    0x02D2, // С минуту раздумывая, я гляжу на пузырьки, беру один из них, вытряхиваю таблетку, а вторую выдавливаю из упаковки.
    0x039F, // Быстро запивая их глотком воды, я стараюсь не думать о том, как может быть вредна вся эта химия.
    0x044C, // Моя форма висит в шкафу.
    0x0478, // Я вылезаю из-под одеяла и, потянувшись, принимаюсь одеваться.
    0x04E8, // Надевать новую школьную форму – всё равно что примерять чужие вещи.
    0x0565, // Синтетический запах стирального порошка бьёт мне в нос, но ощущать свежесть новой одежды всё же приятно.
    0x0625, // Форма как форма. Не сильно отличается от той, что я носил раньше.
    0x069A, // То же можно сказать и об остальном. Не так уж много отличий от обычной школы.
    0x0725, // Только люди.
    0x073C, // Я вспоминаю свой вчерашний разговор с Кендзи, смешливость Миши и яростную жестикуляцию Сидзунэ.
    0x07ED, // Пока что я познакомился только с тремя учениками. Может быть, они и не совсем обычные, но я уверен, что это скорее исключение.
    0x08D0, // Или, возможно, именно такие люди здесь и являются нормальными?
    0x0942, // Что здесь вообще считается нормальным? Чем люди занимаются?
    0x09B0, // Я не видел, чтобы кто-нибудь слонялся по школе после занятий, так что, наверное, тут есть кружки. Если так, может стоит вступить в какой-нибудь?
    0x0AB2, // На протяжении всего урока этот вопрос не выходит у меня из головы, поэтому, когда мы делимся на группы, я решаюсь задать его Сидзунэ.
    0x0BA3, // В конце концов, она ведь говорила, что я могу спрашивать её обо всём, что меня интересует.
    0x0C45, // …
    0x0C49, // …
    0x0C4D, // Сидзунэ скрещивает руки на груди и медленно переводит взгляд на Мишу, которая увлечена стиранием ластика на конце карандаша до получения идеально гладкой поверхности.
    0x0D82, // …
    0x0D86, // А-ха-ха~! Извини, извини, Ситтян! Ты что-то хотела?
    0x0DDE, // А… Вот оно что~! Хм… Хороший вопрос, Хиттян.
    0x0E2E, // Первое, о чём я подумал, – она не знает ответа, и это плохо. Но, может, я зря готовлюсь к худшему. В любом случае, Миша, пожалуйста, не давай подтверждения моей догадке.
    0x0F5A, // …
    0x0F5E, // Точно! У нас всех поощряют вступать в кружки. Многие так и делают, потому что больше тут всё равно заняться нечем.
    0x102C, // Ещё есть школьные мероприятия вроде фестиваля, который будет через несколько дней. Почти все ученики принимают участие в его подготовке по мере своих сил и возможностей.
    0x1164, // Так что~! Ты перевёлся в очень интересное время… может, и для тебя найдётся занятие~!
    0x11FE, // Я не против.
    0x1214, // А в честь чего фестиваль?
    0x1242, // Миша замирает.
    0x125D, // …Ва-ха-ха-ха~! Я не знаю, Хиттян, дело в том, что это местный праздник, а я нездешняя, поэтому…
    0x1305, // Миша в растерянности обращается к Сидзунэ, кажется прося её о помощи. Сидзунэ величественно поправляет очки и начинает уверенно и быстро жестикулировать.
    0x1421, // …
    0x1425, // Что? А…
    0x1433, // Да какая разница?
    0x1453, // Набрав воздуха в лёгкие, с несоразмерной торжественностью и громкостью озвучивает она Сидзунэ.
    0x1503, // Слишком громко; к нам обернулось уже несколько человек.
    0x1569, // Потише нельзя?
    0x1584, // …
    0x1588, // Люди эволюционируют с каждым новым поколением! Вместе с ними неизбежно изменится и смысл фестиваля!
    0x1640, // …!
    0x1645, // Сейчас главное – это вкусная еда и весёлые аттракционы, в которых можно что-нибудь выиграть~! Ха-ха-ха-ха~!
    0x1706, // Учитель, пристально глянув на нас, громко откашливается, при этом похлопывая длинной деревянной указкой по ладони, словно дубинкой.
    0x17F8, // Вспомнив наконец, где находится, Миша едва сдерживает вскрик и замолкает. Сидзунэ, нисколько не смутившись, только отмахивается.
    0x18E4, // …
    0x18E8, // Уже середина урока, и пора бы приступать к работе.
    0x1943, // Точно, Ситтян~!
    0x195E, // Что? Точно~! Хиттян, ты спросил, потому что хочешь вступить в кружок?
    0x19D9, // Может, это лишь игра моего воображения, но мне показалось, что девочки подозрительно переглянулись. Интонация Миши также изменилась… Хотя она и так постоянно меняется.
    0x1B0E, // Да, я подумывал об этом.
    0x1B39, // Миша и Сидзунэ снова переглядываются.
    0x1B7F, // Я собираюсь спросить, не хотят ли они чего-то предложить, но тут моё внимание привлекает чья-то тёмная фигура, которую я улавливаю боковым зрением.
    0x1C8B, // Краем глаза я замечаю, как девочка с длинными тёмными волосами встаёт из-за парты и беззвучно выскальзывает за дверь.
    0x1D62, // Не похоже, чтобы она работала в какой-то из групп, и никто, кроме меня, не обращает на неё внимания.
    0x1E14, // Я поворачиваюсь к учителю, который тоже видел, как она уходила.
    0x1E87, // Почему он ничего не сказал?
    0x1EB9, // Хиттян? Что-то не так?
    0x1EE0, // Моё замешательство настолько очевидно?
    0x1F29, // Или Миша заметила, как я смотрел на ту девочку?
    0x1F7E, // Нет, всё в порядке.
    0x1FA0, // …
    0x1FA4, // Отлично~! Значит, у тебя нет никаких планов на большую перемену?
    0x2018, // Вообще-то, я собирался пойти в библиотеку взять пару книжек.
    0x2086, // …Да нет, в принципе.
    0x20AB, // Тогда давай поедим вместе?
    0x20DC, // Давай.
    0x20E8, // …
    0x20EC, // Ура~! А-ха-ха-ха~! Отлично, Хиттян~! Здорово!
    0x2138, // Оставшаяся часть урока обходится без происшествий. Длинноволосая девочка так и не возвращается.
    0x21EA, // Я не успеваю придумать, куда бы она могла пропасть, когда учитель объявляет, что пора сдавать работы.
    0x22A2, // Сидзунэ, похоже, расстроена, что мы едва успели закончить в срок. Я же рад, что мы вообще закончили. Это ведь не соревнование какое-нибудь.
    0x239C, // …
    0x23A0, // Ещё как соревнование, Хиттян!
    0x23D6, // Не может быть.
    0x23F0, // Да ну?
    0x23FB, // Ну да.
    0x2406, // Я давно приметил, что Миша всегда сопровождает жестами не только свои слова, но и реплики окружающих – со стороны это выглядит очень забавно.
    0x2509, // Очевидно, это для того, чтобы Сидзунэ понимала, что происходит вокруг. Её взгляд постоянно переключается с Мишиных рук на меня и обратно.
    0x2603, // Я не совсем понимаю, на кого мне нужно смотреть. Разговор идёт через Мишу, но, может быть, я должен обращаться к Сидзунэ? Я привык смотреть на того, чей голос слышу, но…
    0x2732, // Сидзунэ не может меня слышать, но было бы неуважением говорить с ней только через Мишу. Впрочем, разве она не делает так же? Но при этом она смотрит на меня… Это обескураживает, и к этому, видимо, ещё придётся привыкнуть.
    0x28C1, // Это не соревнование, потому что соревнования – это борьба за призы. Нет приза – нет и соревнования.
    0x2977, // Глаза Сидзунэ вспыхивают. Она смотрит на меня так, словно я бросил ей вызов. Похоже, для неё это действительно является состязанием.
    0x2A68, // Я никогда раньше не замечал, насколько завораживает тёмная синева её глаз.
    0x2AF1, // …
    0x2AF5, // Уверен, Хиттян?
    0x2B11, // Абсолютно.
    0x2B25, // …
    0x2B29, // Ха-ха-ха! Ты не прав, Хиттян. Потому что~! Я не хочу быть самой медленной в классе. Поэтому ставка – уверенность в своих силах, а приз – подтверждение моих способностей.
    0x2C59, // Ва-ха-ха-ха-ха~!
    0x2C74, // Сидзунэ поправляет очки, всем видом выражая уверенность в своих словах.
    0x2CF8, // Я бы ещё поспорил, но тут звенит колокол. Вскочив, Миша подхватывает портфель и в нетерпении поворачивается ко мне.
    0x2DCA, // Я чуть не забыл, что собирался с ними перекусить.
    0x2E23, // …
    0x2E27, // Где хочешь поесть?
    0x2E49, // …В столовой?
    0x2E61, // Ха-ха-ха~! Так банально… Ладно~! Пошли!
    0x2EA6, // Банально? Да, пожалуй…
    0x2ED0, // В прежней школе у меня было своё местечко на открытом воздухе позади здания, где я обычно ел. Отличное место – жаль, что я нашёл его только в конце первого года.
    0x2FF3, // Интересно, есть ли здесь что-то подобное? Должно быть, Миша это и имела в виду.
    0x3080, // Сидзунэ и Миша притаскивают меня в столовую, как ни странно полупустую. Видимо, многие и правда предпочитают есть в классе или на улице. Я видел коробки с ланчами у некоторых одноклассников.
    0x31DB, // После еды Миша возвращается к разговору, который мы начали в классе.
    0x3258, // Итак, Хиттян, ты хотел узнать о кружках и всяком таком, да? Да~?
    0x32C8, // …
    0x32CC, // Да, Ситтян! Думаю, лучше сначала спросить.
    0x3318, // Кивнув друг другу, они снова поворачиваются ко мне. Миша выпрямляется, будто собираясь произнести речь.
    0x33D6, // Хиттян, у тебя есть какое-нибудь увлечение?
    0x3425, // Раньше я играл в футбол, но без особого интереса. И никогда ни за кого не болел.
    0x34B4, // В последнее время я стал много читать.
    0x34FA, // Хм… Здесь есть литературный кружок, да, Ситтян? Да! Но~! Кажется, у них нет свободных мест. Извини, Хиттян… Они очень популярны.
    0x35E0, // …
    0x35E4, // А, да! Но ближе к делу, Хиттян! Не значит ли это, что у тебя нет других идей?
    0x3669, // В самом деле, нет.
    0x3689, // …
    0x368D, // Хорошо! Отлично~! Это отлично, Хиттян! Замечательно! Ха-ха-ха~! Ва-ха-ха-ха-ха~!
    0x3717, // Почему это так уж прям замечательно?
    0x375A, // Да неважно.
    0x376F, // Дело в том, Хиттян, что кроме кружков и приближающегося фестиваля здесь есть ещё такая вещь…
    0x3819, // Школьный совет!
    0x3836, // Понятно. Не знал, что в этой школе есть ученический совет. Хотя непонятно, зачем они разыграли целый спектакль, чтобы сообщить мне об этом.
    0x3932, // Они и сами замечают, что перестарались: Сидзунэ немного смущается, а Миша заливается смехом.
    0x39DB, // Сидзунэ тут же пытается взять разговор под контроль, если так можно выразиться, – ведь говорит она всё равно через Мишу.
    0x3AB7, // …
    0x3ABB, // Ха-ха-ха~! Хм? Да, да… Хиттян, может, тебе стоит вступить в Школьный совет? Им могут пригодиться новые люди~ Да! Точно! Тебе точно надо вступить!
    0x3BBC, // Зачем?
    0x3BC8, // Ну, например, затем, чтобы каждый день быть вместе, Хиттян~! Мы с Ситтян тоже в Совете.
    0x3C62, // И Ситтян – его президент.
    0x3C91, // Хм…
    0x3C99, // Как я и подозревал, у них свой интерес в этом разговоре.
    0x3CFE, // Словно прочитав мои мысли, Сидзунэ быстро поправляет очки и говорит что-то Мише.
    0x3D91, // …
    0x3D95, // Ха-ха-ха~! Конечно, мы не пытаемся убедить тебя вступить только потому, что нам так нужно, и не станем наста—
    0x3E59, // Так, значит, ты признаёшь, что—
    0x3E92, // …
    0x3E96, // А-ха-ха~! Нет! Мы ничего не признаём~! Я имею в виду, Хиттян, что было бы здорово, если бы ты вступил, и мы были бы очень рады.
    0x3F71, // Но дело не только в этом. Вступление в Совет – это проявление здорового интереса к школьным делам.
    0x4025, // Да~! Это так, Хиттян. Кроме того, разве ты не хочешь после школы проводить время с нами, Хиттян?
    0x40CF, // Не могу определить, говорит она искренне или просто хорошо притворяется. Обе, кажется, пытаются быть со мной как можно милее… Хотя они и так очень милы…
    0x41E6, // Ну что ж…
    0x41F8, // …
    0x41FC, // Итак, решено! Добро пожаловать в Школьный совет, Хиттян~!
    0x4263, // Что? Нет. Нет!
    0x427B, // У-у-у… Видишь, Ситтян? Я же говорила, что будет не так просто.
    0x42E9, // …
    0x42ED, // Угу! Конечно, если бы всё прошло легко, было бы даже скучно. А, да~! Ситтян теперь должна мне конфетку!
    0x43A3, // Вы что, поспорили? Эй, моя жизнь не игра!
    0x43EB, // Похоже, Сидзунэ заинтриговали мои слова; в её глазах вспыхивает огонёк азарта.
    0x447B, // …
    0x447F, // Ва-ха-ха~! А это мысль, Хиттян. Давай сыграем в игру!
    0x44DB, // Я не об этом.
    0x44F2, // Как насчёт «Богач, бедняк», Хиттян? Если проиграешь – должен будешь вступить в Совет~!
    0x458F, // Нет, однозначно нет.
    0x45B4, // У-у~, почему нет?
    0x45D1, // Ну, потому что у вас обеих одна и та же цель – затащить меня в Школьный совет, так?
    0x4665, // …
    0x4669, // Ага~!
    0x4672, // А мне это не нужно. Значит, вы можете объединиться и я окажусь в проигрышном положении. Поэтому я не буду играть.
    0x473E, // …
    0x4742, // Хиттян! Я крайне оскорблена! Ты не доверяешь нам настолько, что думаешь, будто мы способны на нечто столь и-из—во—рот—ли—во-е? Печально слышать от тебя такое…
    0x4867, // Извини?
    0x4875, // Сложно сказать, где заканчиваются слова Сидзунэ и начинаются Мишины мысли.
    0x48FF, // …
    0x4903, // Чтобы загладить свою вину перед девушкой, чьи чувства ты оскорбил, ты определённо должен вступить в Школьный совет!
    0x49D7, // Нет!
    0x49DF, // Тогда как насчёт партии в бумажный футбол вместо «Богач, бедняк»?
    0x4A57, // Бумажный футбол?
    0x4A76, // Да~! Это игра, в которую играют в Америке~! Ты делаешь бумажный треугольник и пытаешься забить им гол в ворота, которые другой игрок делает из своих пальцев!
    0x4B91, // Разве не круто~? Это настоящий поединок, Хиттян~!
    0x4BE9, // …
    0x4BED, // …И в него играют школьники в младшей и средней школах, Ситтян? А-ха-ха! Значит, это игра, отличающая мальчиков от мужчин!
    0x4CC7, // Скорее мальчиков помладше от мальчиков постарше. В любом случае в неё я тоже играть не буду. Раз вы о ней знаете, значит хорошо в неё играете.
    0x4DC7, // Ха-ха-ха~! Да, да~, это так! Как ты догадался, Хиттян?
    0x4E22, // Сидзунэ мрачно смотрит на Мишу, и это наводит меня на мысль о том, что та не должна была с такой готовностью в этом сознаваться.
    0x4F09, // Не скажу, что мне нравятся их попытки навязать своё предложение, но мне интересно, чем же здесь занимается Школьный совет.
    0x4FE8, // Я не состоял в нём в прежней школе и даже не был знаком с кем-то из его членов. Кроме того, Сидзунэ и Миша мне вроде как нравятся, так что, возможно, это не такая уж плохая идея.
    0x5123, // …
    0x5127, // Ладно, Хиттян, тогда как насчёт «Риска»? Это такая игра в мировое господство!
    0x51B3, // Не знаю такой.
    0x51CD, // Она очень интересная, Хиттян. Борьба за власть над миром, армии, войны и всё такое!
    0x5262, // Сидзунэ, должно быть, хороша в этом деле.
    0x52AC, // Если хочешь, можем сыграть после уроков.
    0x52F6, // …
    0x52FA, // А, да, Ситтян? Можем сыграть просто на интерес, Хиттян. Ситтян давно не играла, поэтому, если захочешь, поиграем безо всяких условий.
    0x53E9, // Ну, хорошо…
    0x53FF, // Хорошо! Хорошо, хорошо~! Превосходно~! Тогда увидимся после школы в кабинете Школьного совета, Хиттян!
    0x54B8, // Стоп, почему там?
    0x54D7, // Потому что~! Там набор для игры.
    0x5510, // Ва-ха-ха-ха-ха~!
    0x552B, // Я строю недовольную гримасу, но лишь для вида.
    0x557F, // В конце концов я соглашаюсь, уяснив для Сидзунэ, что моё согласие не подразумевает ничего, кроме желания сыграть.
    0x564E, // Ланч заканчивается, и мы возвращаемся в класс.
    0x56A3, // После ланча длинноволосая девочка возвращается в класс и молча занимает своё место.
    0x573E, // Её снова то ли не замечают, то ли игнорируют. Я хочу спросить об этом у Миши, но боюсь показаться чересчур любопытным.
};

#endif // KS_A1_TUESDAY_SMALLTALK_RU_TL_INDEX