#ifndef KS_CHOICE_TAKE_IT_EASY_RU_TL_INDEX
#define KS_CHOICE_TAKE_IT_EASY_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_890886E3_ru_intl[] = {
    0x0000, // Я позволяю Эми бежать как ей нравится – и она беспощадна: мгновенно уходит вперёд на полкруга.
    0x00AD, // Я её не виню.
    0x00C4, // В смысле, я ведь тут ни с кем не соревнуюсь, да?
    0x0118, // Наоборот, я просто бегу в ровном темпе, что я и должен делать, верно?
    0x0193, // На данном этапе нет нужды пытаться выйти за пределы своих возможностей.
    0x0217, // Боже, это хотя бы того стоит?
    0x024B, // Когда мы заканчиваем второй круг, я снова останавливаюсь.
    0x02B5, // Эми продолжает бежать, и мне кажется, что она разочарована.
    0x0321, // Ну, это глупо.
    0x033A, // Я не обязан ничего ей доказывать, а если уж на то пошло, то и себе я ничего доказывать не обязан.
    0x03E7, // Мне и так хорошо.
    0x0406, // И я вовсе не бегун.
    0x0428, // Наверное, это было плохой идеей.
    0x0463, // Может, вместо этого можно делать что-то другое?
    0x04B9, // Всё равно так рано вставать не по мне. Должен быть какой-то другой способ поддерживать себя в форме.
    0x056F, // Прогулки, например. Приятные дневные прогулки.
    0x05C5, // Да, звучит отлично. Ну его, этот бег.
    0x0606, // Я машу Эми рукой и возвращаюсь обратно в свою комнату.
    0x0669, // Потом что-нибудь придумаю.
};

#endif // KS_CHOICE_TAKE_IT_EASY_RU_TL_INDEX