#ifndef KS_A1_FRIDAY_HOME_FIELD_ADVANTAGE_RU_TL_INDEX
#define KS_A1_FRIDAY_HOME_FIELD_ADVANTAGE_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_5697F250_ru_intl[] = {
    0x0000, // Дверь в конце коридора со скрежетом распахивается и со всего маху бьёт о стену. За грохотом следует взрыв смеха, и я сразу понимаю, кто это.
    0x00FD, // В тот момент, когда Сидзунэ и Миша входят в коридор, Кендзи, словно ниндзя, исчезает в своей комнате и захлопывает за собой дверь. Сидзунэ идёт небольшими чёткими шагами, а Миша немного виляет от стены к стене.
    0x0279, // Я пытаюсь последовать примеру Кендзи, но уже слишком поздно. Миша ставит ногу в дверной проём, чтобы я не смог закрыть дверь, так что у меня не остаётся иного выбора, кроме как впустить их.
    0x03CE, // …
    0x03D2, // Привет, Хиттян~! Привет-привет~!
    0x040B, // Привет.
    0x0419, // Что вы здесь делаете?
    0x0440, // Достаточно ли длительной была пауза между этими двумя предложениями, чтобы быть вежливой?
    0x04E6, // …
    0x04EA, // Хиттян, это грубо~! Мы пришли забрать тебя!
    0x0537, // Ты подумал, что мы решили, что ты собирался сбежать, и пришли, чтобы не позволить тебе этого? Конечно же нет, Хиттян~!
    0x0609, // Эй, я не говорил, что вы здесь для этого.
    0x0651, // Но теперь я знаю, что они здесь именно по этой причине.
    0x06B4, // Пришло время для работы в Совете, да-да~!
    0x06FD, // Ты разве не счастлив, Хиттян, что сможешь помочь це~лой школе~? Ты прямо как герой~! Грядущие поколения будут слагать легенды об этом дне!
    0x07F5, // Интересно. Не думал, что вступление в Школьный совет будет подвигом, достойным Геракла.
    0x0895, // Ну… Раз я пообещал, то…
    0x08C1, // Сидзунэ, которую я только сейчас замечаю краем глаза, заглядывает мне через плечо, чтобы осмотреть мою комнату. Её цепкий взгляд мечется от предмета к предмету…
    0x09E8, // В душу закрадывается неприятное чувство беззащитности из-за такого бесцеремонного вторжения. К счастью, на полу нет грязного белья или чего-нибудь в этом роде.
    0x0B0D, // …
    0x0B11, // М? Что такое, Ситтян?
    0x0B36, // Да, это комната Хиттяна~! И правда, мы же её раньше не видели!
    0x0BA3, // Выглядит скучновато, но у Хиттяна просто не было времени, чтобы её украсить, да~?
    0x0C35, // А это что?
    0x0C47, // Она указывает на коллекцию лекарств на тумбочке.
    0x0CA1, // Попытаться уйти от темы.
    0x0CCE, // Выгнать их из комнаты.
};

#endif // KS_A1_FRIDAY_HOME_FIELD_ADVANTAGE_RU_TL_INDEX