#ifndef KS_CHOICE_GO_FOR_IT_RU_TL_INDEX
#define KS_CHOICE_GO_FOR_IT_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_2DC5D5B3_ru_intl[] = {
    0x0000, // Что же это я?
    0x0017, // Неужели я собираюсь сдаться и позволить Эми выбиться вперёд?
    0x0087, // Я ускоряюсь.
    0x009E, // Быстро пролетает второй круг, и, даже не обратив на это внимания, я продолжаю бежать.
    0x0138, // Эми оборачивается через плечо и ухмыляется.
    0x0189, // Всё бежишь?
    0x019E, // Не хочу, чтоб… уф… ты подумала, что я… уф… не в форме… уф…
    0x020B, // Не сбавляя ходу, Эми смеётся. Мало того – она ещё ускоряется.
    0x027A, // Что ж, если у нас теперь такие правила…
    0x02C2, // Я тоже разгоняюсь.
    0x02E4, // Я чувствую, как горят мои лёгкие, а ноги вопрошают, что же, чёрт побери, я делаю.
    0x0373, // Молочная кислота в мышцах возражает против этой гонки, но я не обращаю на это внимания.
    0x0412, // Я не могу позволить себе сбавить темп, потому что это будет равносильно поражению.
    0x04A9, // Голос разума в голове осторожно интересуется, когда это мы начали играть в игру.
    0x053C, // Я бы ему ответил, но думать сейчас сложновато.
    0x0590, // Она такая {b}быстрая{/b}.
    0x05B9, // Как, чёрт возьми, ей удаётся—{w=.5}{nw}
    0x05F9, // В груди как будто потянули за струну, появляется душащее чувство тесноты и боль.
    0x068C, // Я успеваю подумать лишь «вот дерьмо», и тут дорожка уходит у меня из-под ног.
    0x0717, // Я спотыкаюсь, одной рукой хватаюсь за грудь, а другой защищаю лицо от удара о беговую дорожку.
    0x07C2, // Эми оборачивается, её глаза округляются.
    0x080D, // Хисао!
    0x0819, // Кричит она, бросаясь ко мне с другого конца стадиона.
    0x087A, // Что случилось?
    0x0895, // Н-н-н… Ничего, просто…
    0x08BF, // Дыши ровно.
    0x08D4, // Успокойся. Не паникуй.
    0x08FD, // Не паникуй.
    0x0912, // Позвать фельдшера?
    0x0935, // Я закрываю глаза, отгораживаясь от окружающего мира.
    0x0996, // Сердце изо всех сил пытается выровнять ритм.
    0x09E8, // Боль в груди начинает медленно отступать.
    0x0A35, // Вскоре она проходит, будто ничего и не было.
    0x0A85, // Ничего… страшного не случилось? Нет, что-то всё-таки произошло.
    0x0AF9, // Я открываю глаза и поднимаю взгляд на взволнованную Эми.
    0x0B61, // Думаю, я в порядке.
    0x0B83, // Мой голос даже мне кажется неестественным: он странно ровный и сухой. Это заставляет Эми нахмуриться.
    0x0C3D, // А я так не думаю.
    0x0C5B, // Будто приняв решение, она кивает сама себе.
    0x0CAA, // Да. Ты пойдёшь со мной.
    0x0CD3, // Тебе нужно показаться фельдшеру.
    0x0D10, // Эми берёт меня за руку и тащит за собой. Меня слегка покачивает, но от предложенного Эми для поддержки плеча я отказываюсь.
    0x0DF0, // Если честно, я немного стыжусь собственной слабости.
    0x0E51, // Я не хотел, чтобы Эми обо мне беспокоилась, но, кажется, уже слишком поздно.
    0x0ED9, // Чёрт, лучше бы вообще никому не было дела до моей болезни, хотя для этого теперь тоже уже слишком поздно.
    0x0F97, // Я бы предпочёл разбираться со всем этим сам, не становясь ни для кого обузой.
    0x1023, // А если уж и желать чего-то, так лучше бы у меня вообще не было этой болезни.
    0x10AA, // Фельдшер!
    0x10BC, // Эми врывается в его кабинет без стука, но его это ничуть не беспокоит.
    0x113B, // Доброе утро, солнышко. Что случилось?
    0x117F, // «Солнышко»? Ладно, неважно. Он спокойно прихлёбывает кофе, но, проследив за взглядом Эми, устремлённым на мою мнущуюся в дверях персону, ставит чашку на стол.
    0x129E, // Хисао? Какими судьбами?
    0x12C9, // Мы бегали, а он споткнулся и схватился за грудь, и я подумала, что нужно сгонять за вами, оставив его там, но он сказал, что всё в порядке. Но я решила, что вам всё же нужно его осмотреть, и—{w=1.5}{nw}
    0x1426, // Подожди, Эми. Успокойся.
    0x1452, // Что случилось, Хисао?
    0x1479, // Я не знаю. Мы бежали, а потом у меня заболело в груди, как в прошлый раз, но через несколько секунд всё прошло.
    0x153E, // Это было всего лишь трепетание или типа того.
    0x1591, // Фельдшер хмурится, будто сочетание «всего лишь трепетание» противоречит само себе.
    0x162B, // Я не совсем это имел в виду, когда рекомендовал делать какие-то упражнения. Тебе нужно быть осторожнее, Хисао.
    0x16F3, // Я был осторожен, просто…
    0x1721, // Если подумать, то «я просто ввязался в гонку с членом команды по бегу» не настолько хорошее оправдание, как я предполагал.
    0x1800, // Что – «просто»?
    0x181D, // Э… в общем…
    0x1834, // Я гнался за Эми.
    0x1851, // Эми, это правда?
    0x186E, // Эми начинает беспокойно ёрзать на месте, всем видом выражая умильное раскаяние.
    0x1901, // Эм, ну…
    0x190F, // В конце концов, так и не сумев сознаться вслух, она просто кивает.
    0x1986, // Фельдшер вздыхает и устало трёт рукой лоб.
    0x19D4, // Эми, тебе надо быть более внимательной к пределам возможностей других людей!
    0x1A61, // Я не знаю, говорил ли он тебе, но у Хисао больное сердце, и заставлять его гнаться за собой было крайне безответственно.
    0x1B3A, // Эм, на самом деле это я начал.
    0x1B6F, // Фельдшер ошеломлён моим заявлением.
    0x1BB2, // ЧТО?
    0x1BBA, // Мы просто бежали, потом Эми начала отрываться и я… подбавил, чтоб догнать её.
    0x1C47, // Фельдшер возводит очи горе, бормоча молитвы о терпении какому-то из богов, затем снова опускает глаза на нас.
    0x1D0E, // Значит, вы {b}оба{/b} тупицы.
    0x1D3D, // Думаю, это послужит вам утешением.
    0x1D7C, // Теперь давай, Хисао. Надо убедиться, что сердце у тебя не собирается взорваться или что-нибудь в этом роде.
    0x1E3E, // Я покорно подчиняюсь и следую за ним в соседнюю комнату, где он убеждается, что я действительно не собираюсь упасть замертво.
    0x1F23, // Как ощущения?
    0x1F3C, // Я не знаю. Ничего особенного. Устал, но это, наверное, просто от пробежки.
    0x1FC0, // Тебе придётся остаться здесь на несколько часов и отдохнуть, а потом посмотрим, как ты себя будешь чувствовать.
    0x208C, // Я не собираюсь возражать и просто ложусь на кушетку.
    0x20EC, // После выговора, полученного от фельдшера в соседней комнате, заходит чудовищно несчастная Эми.
    0x219B, // Сквозь закрытую дверь я не слышал, что он ей говорил, но уверен, что не любезности.
    0x2230, // Слушай, мне очень, очень жаль.
    0x2266, // Мне следовало быть осторожнее.
    0x229F, // Эй, ты же не знала. Ты не виновата.
    0x22DC, // Она выглядит ужасно расстроенной и огорчённой, даже мои заверения не помогают ей взбодриться.
    0x2389, // Я хочу как-нибудь загладить вину.
    0x23C6, // Она снова решительно кивает.
    0x23FB, // Так что мы с тобой обязательно перекусим вместе.
    0x2454, // Я тебе принесу, ладно? Что-нибудь очень-очень вкусное!
    0x24B6, // Я начинаю тянуть «тебе вовсе не обязательно…», но затем затыкаюсь и молча киваю, глянув на её лицо.
    0x256B, // Отлично!
    0x257B, // Мы встречаемся на крыше.
    0x25A8, // «Мы»?
    0x25B2, // Угу! Погода прекрасная, и крыша – замечательное место для ланча.
    0x2628, // Понятно.
    0x2638, // Ты ведь придёшь, да?
    0x265C, // Не лишишь меня возможности загладить вину?
    0x26AB, // Конечно нет.
    0x26C2, // Здорово! Тогда увидимся!
    0x26EF, // Я болтаюсь где-то между сном и бодрствованием, чувствуя себя совершенно измождённым.
    0x278B, // Не только моё тело – весь я ослаб и обезволен, кроме моих чувств.
    0x2801, // С трудом сглотнув, я решаю лежать настолько спокойно, насколько могу, что в таком состоянии вовсе не сложно.
    0x28C6, // Фельдшер суетится по ту сторону занавесок. Я вижу его тень, двигающуюся в солнечном свете.
    0x296B, // Он открыл в кабинете окна. На улице ветрено.
    0x29BB, // Чистые белые занавески развеваются на лёгком ветерке, тяжело и медленно покачиваясь, словно волны. Свет вяло проникает сквозь них, наполовину поглощаясь тканью.
    0x2AE3, // Я закрываю глаза. Бриз на лице – как мягкая ткань занавесок.
    0x2B51, // Я, затаив дыхание, прислушиваюсь к биению сердца, пытаясь игнорировать звук клавиш компьютера, на котором печатает фельдшер.
    0x2C36, // Сердце бьётся ровно.
    0x2C5C, // Блин, и недели не прошло, как я снова оказался в таком положении. На этот раз я сильно облажался. Надо было головой думать, а не изображать из себя недоделанную звезду спорта в присутствии настоящей.
    0x2DC5, // И с чего я так храбрился, изображая, что сердечное трепетание – ерунда, хотя на самом деле оно довольно опасно?
    0x2E8F, // Это был просто рефлекс – отбросить мысли о болезни, удержать всё в себе.
    0x2F13, // Я не хотел, чтобы это случилось.
    0x2F4D, // Не хотел, чтобы Эми это увидела.
    0x2F87, // А-а-а!..
    0x2F93, // Болванболванболван.
    0x2FB9, // Мне нужно быть осторожнее, иначе снова окажусь в больнице, а то и чего похуже.
    0x3046, // …
    0x304A, // После этой мысли я уступаю усталости.
    0x308F, // Я уснул. Как долго я спал? Сколько сейчас времени?
    0x30E9, // У меня немного кружится голова, и я никак не могу перестать моргать.
    0x3165, // Отдёрнув занавеску, я щурюсь от льющегося из окна солнечного света. Занавески на ощупь совсем не такие, каким был ветер на лице.
    0x324E, // Фельдшер, сидя на том же месте, что и раньше, отрывает глаза от работы.
    0x32CD, // Как самочувствие?
    0x32EE, // Не могу точно определиться, как я себя чувствую, поэтому ничего не отвечаю. Мне несколько не по себе из-за того, что уснул в такое необычное время. Надеюсь, я не выгляжу слишком странно.
    0x343D, // Который час?
    0x3454, // Хриплым голосом задаю я вопрос, надеясь немного сориентироваться. Фельдшер, прежде чем ответить, бросает взгляд на наручные часы.
    0x3542, // Всё происходит будто в замедленной съёмке.
    0x3591, // Пятнадцать минут одиннадцатого.
    0x35CD, // Я пытаюсь понять, что это значит, но не слишком успешно.
    0x3632, // Ты не ответил на мой вопрос, Хисао.
    0x3671, // А. Хорошо.
    0x3683, // Тогда слезай с кровати, посмотрим, как ты. И не…
    0x36DA, // Я пытаюсь встать, но из-за резкого движения перед глазами всё плывёт и я чуть не падаю. Фельдшер подхватывает меня под руку и вздыхает.
    0x37CF, // «…не вставай слишком быстро», – вот что я собирался сказать. Просто посиди, я измерю давление.
    0x387C, // Да уж, хотел как лучше, а получилось как всегда. Смутившись, я умолкаю, пока фельдшер возится с моей рукой и старомодным устройством. Через пару минут он убирает его с лицом, не выражающим ни удовлетворения, ни недовольства.
    0x3A12, // Ты в порядке. Голова перестала кружиться?
    0x3A5E, // Ага.
    0x3A66, // Хорошо. А как внутри?
    0x3A8C, // Ты сегодня поступил неблагоразумно, Хисао.
    0x3ADB, // Я воздерживаюсь от резкого ответа, который так и хочется выпалить. У меня и у самого в голове такие мысли крутились, но, услышав их от кого-то другого, хочется что-нибудь возразить.
    0x3C22, // Не слишком приятно слушать то, что он говорит. Но от этого он не становится неправ.
    0x3CB8, // Неблагоразумно.
    0x3CD6, // Он кивает со всё тем же нейтральным выражением лица.
    0x3D36, // Было бы легче злиться на него, если б он сказал что-нибудь вроде «а я ведь предупреждал», но он этого не делает.
    0x3DFF, // Я могу стараться помочь тебе поддерживать здоровье, но без соответствующих шагов с твоей стороны это бесполезно. Надеюсь, сегодняшнее событие послужит тебе уроком.
    0x3F2D, // Вот записка для учителя. Чтобы не было лишних вопросов.
    0x3F92, // Поскольку мне больше нечего сказать, да и не хочется, я беру протянутую им бумажку и поворачиваюсь к выходу.
    0x4057, // Не делай глупостей, ясно? В этот раз ты отделался лёгким испугом, но в следующий раз всё может обернуться иначе.
    0x4122, // Мне всё ясно.
    0x413A, // Существует какой-то способ добраться из административный корпуса в школу не выходя на улицу, но я не горю желанием искать его и, возможно, потеряться, так что отправляюсь тем путём, который точно знаю.
    0x42A8, // Я останавливаюсь на ступеньках, размышляя: сходить ли мне за учебниками в общежитие или отправиться сразу на урок.
    0x437A, // Солнце ярко светит мне в глаза, и я направляюсь к общежитию.
};

#endif // KS_CHOICE_GO_FOR_IT_RU_TL_INDEX