#ifndef KS_A1_SATURDAY_CREATIVE_PAIN_RU_TL_INDEX
#define KS_A1_SATURDAY_CREATIVE_PAIN_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_4EF4D576_ru_intl[] = {
    0x0000, // Эми тяжело вздыхает.
    0x0026, // Значит, надо вернуться и взять.
    0x005F, // Но я обещала помочь своему классу с проектом, поэтому вернусь попозже. Потерпишь без неё несколько часов?
    0x0120, // Рин кивает, и Эми уходит.
    0x014D, // Я остаюсь, потому что мне нравится смотреть, как рисует Рин, и потому что всё равно других дел у меня нет.
    0x020B, // Я сажусь на коробку и достаю из портфеля книгу. Она повествует о трёх парнях, которые полмесяца только то и делали, что пили пиво и ничего не делали.
    0x0318, // Рин оставляет недокрашенным синий участок и переходит на другое место.
    0x039B, // Её нога твёрдо водит кистью по оштукатуренной стене. Слой за слоем, фреска медленно обретает форму.
    0x0451, // Я не спеша переворачиваю страницы. В этой главе они пьют пиво у друга главного героя. В предыдущей – дома у самого главного героя.
    0x053E, // Это не захватывающий рассказ, а просто отрывок чьей-то выдуманной жизни, рождающий вопрос, зачем вообще было такое писать.
    0x061E, // И действительно, зачем? Причины занятия чем-то творческим… абсолютно непостижимы.
    0x06B6, // Как, например, почему Рин рисует. Похоже, она, как и Эми, идёт против судьбы, действуя ей вопреки.
    0x0764, // Рин даже говорила что-то подобное. «Делать вещи, которые не можешь делать, просто потому, что можешь».
    0x081D, // Это она и имела в виду? Это её причина? Хотя это скорее причина Эми - она создаёт впечатление настойчивого человека.
    0x08EF, // А Рин такой атмосферы не создаёт. Если подумать, то она вообще никакой не создаёт. Или создаёт разную каждый раз, когда я с ней говорю.
    0x09E2, // Почему она сказала то, что сказала? Почему она, и вообще кто-либо, рисует, чертит, лепит скульптуры или пишет?
    0x0AA7, // У меня никогда не было творческих порывов, поэтому не думаю, что я способен это понять.
    0x0B45, // Чувствую себя из-за этого пустым внутри.
    0x0B8F, // Какая мрачная мысль. Но я даже не могу определить, верна ли она.
    0x0C02, // Устраивает ли меня быть таким? Не могу отрицать, что немного завидую Рин, но и серьёзным недостатком это не считаю.
    0x0CD3, // Я – это я, а она – это она.
    0x0D02, // И всё же мне нужно что-то найти. Что-нибудь, что бы помогло… немного разобраться в себе, вместо того чтобы топить себя в этих книгах, как я делал в больнице.
    0x0E1C, // Я не могу отделаться от чувства растерянности; новая школа, стиль жизни, люди – всё вносит свой вклад в это ощущение.
    0x0EF1, // Я стараюсь вписаться в существующие социальные группы, и большинство из тех, кого я встретил, были очень милы.
    0x0FBA, // Но всё равно создаётся впечатление, что я чужак, будто мне здесь не место.
    0x1040, // Я отгоняю это чувство, осознав, что слишком задумался. И книгу не читаю, и Рин не помогаю.
    0x10E1, // Не попросив меня, она пытается налить ногами краску из большой банки. Хотя, может быть, она и просила, а я просто не слышал.
    0x11BF, // Так или иначе, выглядит это опасно.
    0x11FF, // Я тут же подскакиваю к ней, чтобы помочь, иначе она рискует залить краской весь тротуар.
    0x129F, // Взяв из её ног банку, я наливаю немного в чашу.
    0x12F3, // Мы помалкиваем. Она лишь раз бросает на меня взгляд из-под растрёпанной чёлки.
    0x1382, // По выражению её лица ничего понять невозможно. Оно бесстрастное, со слабой примесью лёгкого удивления.
    0x143F, // Интересно, о чём она думает? Возможно, спрашивает себя, о чём думаю я. А может быть, ни о чём.
    0x14E4, // Монетку бы дал за твои мысли.
    0x1519, // У тебя с собой есть монеты?
    0x154A, // Не думаю.
    0x155B, // Тогда я не думаю, что скажу. Но тебе повезло: я всё равно ни о чём не думаю. Кроме разговора.
    0x15FF, // Она с очень недовольным видом хмурится.
    0x1648, // Трудно ни о чём не думать. Но это важно.
    0x168F, // Я собираюсь спросить, почему это важно, но тут к нам подходит пожилой мужчина, у которого, похоже, дело к Рин.
    0x1754, // Добрый день. Как успехи?
    0x1780, // Справлюсь.
    0x1794, // Рин не отрывает глаз от стены и отвечает вполне естественно, поэтому я предполагаю, что они знакомы.
    0x184B, // Я ещё не встречал этого мужчину, и, естественно, мне интересно, кто это. Может быть, учитель?
    0x18F1, // Его волосы серебристо-серые, настолько яркие, что кажется, будто они окрашены. Я надеюсь, что это не так.
    0x19AE, // На его переносице сидят маленькие круглые очки, но он постоянно смотрит поверх, а не сквозь них.
    0x1A5D, // Он пристально изучает фреску поверх упомянутых очков.
    0x1AC1, // Хорошо, хорошо.
    0x1ADD, // Какая у тебя тут сильная композиция!
    0x1B20, // Он подходит, чтобы поближе рассмотреть фреску, размышляя о ней вслух довольно громко и не оставляя сомнений в том, что хочет, чтобы мы тоже слышали.
    0x1C2D, // Очень хорошо. Правда, очень хорошо…
    0x1C6F, // Я не знаю, как на это реагировать, но Рин, кажется, безразлично. Она оглядывает своё рабочее место, разбросанные повсюду чаши с красками различных оттенков.
    0x1D8B, // Хисао.
    0x1D97, // М-м?
    0x1D9E, // Немного больше вот этого.
    0x1DCD, // Секунду.
    0x1DDD, // Я смешиваю пополам краски из двух банок, чтобы получить бледно-розовый оттенок, похожий на тот, что Рин использовала для человеческого лица.
    0x1EDE, // Рин наблюдает за моими действиями, из-за чего мне становится немного не по себе. На её лице написано такое бесстрастное выражение, что кажется, будто она только и ждёт, что я в чём-нибудь напортачу.
    0x2044, // Мужчина поворачивается, чтобы рассмотреть и меня, удивлённый, как будто только что заметил моё присутствие.
    0x210A, // …Может, так и есть.
    0x212D, // О, привет. Кто это у нас тут?
    0x215F, // А, я переведённый ученик из класса 3-3. Хисао Накай. Приятно познакомиться.
    0x21E5, // Класс Муто, значит? Ну, ты в этом не виноват!
    0x2234, // Воздух сотрясают раскаты его хохота. Невероятно громкого. С соседнего дерева даже вспархивает несколько птичек.
    0x2303, // Я Синити Номия, учитель рисования.
    0x2342, // Так, значит, учитель рисования. Следовало бы догадаться. Он даже выглядит похоже.
    0x23D6, // Как же оказалось, что ты стал помогать моей протеже?
    0x2435, // Думаю, просто застрял тут с ней.
    0x246F, // Мне интересен кружок рисования.
};

#endif // KS_A1_SATURDAY_CREATIVE_PAIN_RU_TL_INDEX