#ifndef KS_A1_SUNDAY_THE_DEEP_END_RU_TL_INDEX
#define KS_A1_SUNDAY_THE_DEEP_END_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_AA11AECF_ru_intl[] = {
    0x0000, // Чем мне заняться? У меня нет никаких планов. Как ни крути, это довольно глупо.
    0x008C, // Может, мне стоило пригласить девушку? Но, с другой стороны, вряд ли я смог бы . Это ведь моя первая неделя.
    0x014A, // Неделя, которую я потратил впустую, неуклюже ведя себя со всеми, спотыкаясь на каждом шагу, пытаясь понять, как здесь всё устроено.
    0x0238, // Если подумать, чего я добился?
    0x026F, // Кого я мог бы пригласить?
    0x029D, // Чёрт, как ни крути, а выходит, что Кендзи – мой единственный шанс на свидание сегодня.
    0x0339, // Это самое грустное, что случалось со мной с тех пор, как я схлопотал инфаркт из-за девушки, признавшейся мне в любви.
    0x040C, // Ничего не поделаешь.
    0x0432, // Я не знаю, правда. Хоть мне и нечем заняться, но крепость – это, кажется, перебор.
    0x04C4, // Ты уверен, что не хочешь пойти на улицу? Посетители обязательно заявятся сегодня в общежитие.
    0x056F, // Эти слова его словно громом поражают.
    0x05B4, // Чёрт, а ты прав. Это место сегодня небезопасно.
    0x0609, // Надо найти где спрятаться.
    0x063A, // На миг он задумывается.
    0x0665, // Крыша.
    0x0671, // Что «крыша»?
    0x0688, // Мы пойдём и схоронимся там до позднего вечера.
    0x06DD, // Идеальное место, туда никто никогда не поднимается.
    0x073C, // Жди меня там через час. Мне надо приготовиться.
    0x0792, // Он захлопывает дверь и закрывает её на замок.
    0x07E5, // Блин, да что, чёрт побери, не так с этим парнем?
    0x0839, // И, подумать только, я сейчас готов смириться с его безумствами. Меня это и правда угнетает.
    0x08DE, // Чувствую себя неудачником…
    0x0912, // Я делаю шаг наружу, и меня приветствует оглушительный шум толпы.
    0x0988, // Вся школа кипит от бурной деятельности.
    0x09D1, // Повсюду видны киоски, между которыми роятся внушительных размеров толпы.
    0x0A58, // Я не ожидал, что фестиваль привлечёт столько гостей.
    0x0AB8, // Должен признать, что люди, отвечающие за украшение территории, знатно постарались, и это заметно.
    0x0B6A, // Народу, похоже, весело, и атмосфера яркая, красочная и счастливая.
    0x0BE2, // То есть была бы, если бы не моё паршивое настроение.
    0x0C40, // Поэтому сейчас фестиваль меня скорее раздражает.
    0x0C9B, // Ну, деваться некуда. Я решаю придерживаться изначального плана и поесть, а потом придётся взглянуть, что затеял Кендзи на крыше.
    0x0D85, // …
    0x0D89, // Чтобы убить время, я неспешно прохаживаюсь взад-вперёд, поглядывая на киоски, но настроения играть в игры у меня нет никакого.
    0x0E6F, // Кричащие цвета режут глаз, и с каждой минутой мне становится всё хуже.
    0x0EEF, // Я даже не могу решить, что бы мне съесть, и большой выбор в сочетании с оживлёнными толпами празднующего народа задачу тоже не упрощает.
    0x0FE7, // Я просто направляюсь к ближайшему лотку, предлагающему что-то хотя бы наполовину съедобное, и встаю в очередь.
    0x10B1, // Оказывается, это лапша.
    0x10DC, // Также выясняется, что она не очень-то хорошо приготовлена.
    0x1147, // Ну, по крайней мере, питательная. А ничего другого мне сейчас и не требуется.
    0x11D2, // Помешивая свою сомнительного качества лапшу, я вяло задумываюсь, чем сейчас занимаются остальные.
    0x1287, // Сидзунэ и Миша определённо где-то что-то организовывают.
    0x12EF, // Мне лучше держаться от них подальше. Думаю, они так быстро не простят, что я бросил их наедине со всей этой работой.
    0x13C0, // Эми, мне представляется, шныряет туда-сюда по территории, будучи удручающе жизнерадостной.
    0x1467, // Нет ни малейшего шанса её найти, равно как и избежать случайной встречи, так что пофиг.
    0x1505, // Лилли, вероятно, помогает своему классу с праздничным мероприятием и определённо слишком занята, чтобы составить кому-то компанию.
    0x15F6, // Ханако не станет ни с кем общаться. Она либо держится ото всех подальше, либо помогает Лилли.
    0x169F, // Рин, должно быть, на посту у своей фрески, пусть и вряд ли чем-нибудь может помочь интересующимся, если таковые найдутся.
    0x177A, // Пойти туда ради тишины и спокойствия кажется самым лучшим выбором из имеющихся, но я всё же не могу представить, каким образом заталкивание в мой мозг искусства сможет поднять мне настроение, так что воздержусь.
    0x18FD, // Пока я размышляю, моя еда вместе с голодом куда-то исчезает.
    0x196A, // Видимо, я просто мысленно отгородился от вкуса еды, что, вообще-то, неплохо.
    0x19F3, // Сытый, но не довольный, я разворачиваюсь и иду к главному школьному зданию. Час уже почти прошёл.
    0x1AA3, // Толпа здесь даже плотнее, чем снаружи.
    0x1AE9, // В коридорах не протолкнуться, и я боюсь представить, что творится внутри классных комнат.
    0x1B8D, // Я поднимаюсь по лестнице, ведущей к моей цели.
    0x1BE1, // Крыше.
    0x1BED, // К счастью, дверь наверх не заперта, но сейчас на ней висит написанная от руки табличка:
    0x1C8B, // Ну, это не мне.
    0x1CA5, // Шум праздника здесь практически не слышен, а крыша выглядит заброшенной, как и ожидалось.
    0x1D49, // Рядом с местом, где повалено проволочное ограждение, лежит кипа одеял, странно выделяющаяся на общем фоне.
    0x1E0C, // Погодите.
    0x1E1E, // Мне кажется, или куча шевелится?
    0x1E59, // Удивительно, учитывая полное безветрие.
    0x1EA3, // Я осторожно вытягиваю руку и тыкаю её.
    0x1EE9, // Испугавшись, я отпрыгиваю назад.
    0x1F25, // Кто там?
    0x1F34, // Чёрт тебя побери, Кендзи. Это я.
    0x1F6D, // Ох блин, чувак, ты меня напугал.
    0x1FA6, // Так что мы здесь делаем?
    0x1FD2, // Мы устроим пикник.
    0x1FF4, // Что?
    0x1FFC, // То. У меня есть одеяла, крендельки и виски. Идеальный набор, чувак.
    0x2074, // Виски?
    0x2080, // Ты разве не слишком молод для выпивки?
    0x20C6, // Мне, знаешь ли, двадцать.
    0x20F3, // …Вовсе нет.
    0x2109, // И мне, и тебе.
    0x2121, // Чего? Что за бред?
    0x2141, // Эй, ТЫ-то, по крайней мере, кое-что с того получил, а мне досталась всего-навсего бутылка виски…
    0x21EE, // Он несёт какую-то несуразицу, но я решаю ему подыграть.
    0x2252, // Так откуда у тебя бутылка виски?
    0x228D, // Моя мама не смогла приехать на фестиваль, поэтому взамен прислала мне дорогого односолодового вискаря.
    0x234B, // Звучит правдоподобно.
    0x2374, // Хочешь глотнуть?
    0x2393, // …
    0x2397, // А что мне, собственно, терять? Этот день хуже стать уже не может.
    0x240B, // …Почему бы и нет.
    0x242B, // Мы располагаемся на куче одеял, которые Кендзи сюда притащил.
    0x249C, // Он достаёт почти полную бутылку виски и передаёт её мне.
    0x2503, // Ты даже не принёс стаканы?
    0x2533, // Не, это ж не пикник какой-нибудь романтичной принцесски. Какого хрена, чувак?
    0x25BF, // Это настоящий мужской пикник.
    0x25F6, // Никаких стаканов.
    0x2617, // Никаких салфеточек.
    0x263C, // Только виски. Выпивка настоящих мужчин.
    0x2685, // Как скажешь.
    0x269C, // И крендельки.
    0x26B5, // Я рассматриваю бутылку поближе.
    0x26F0, // Односолодовый виски двенадцатилетней выдержки, как он и сказал.
    0x2766, // Пожав плечами, я делаю глоток. Выпивка обжигает горло, словно кислота, но на вкус вполне неплохо.
    0x2816, // Я чувствую, что виски ударяет в голову, а его послевкусие, задержавшееся во рту, так и просит сделать ещё глоток.
    0x28E2, // Нам стоит обсудить ответный удар и промыть косточки знакомым женщинам, пока они нас не слышат.
    0x298F, // Чёрт, я забыл принести свои графики.
    0x29D1, // Я решаю поиграть с собой в игру-напивашку. Каждый раз, как Кендзи упоминает «заговор женщин», я делаю глоток.
    0x2A97, // Четыре или пять часов, а может, несколько дней спустя {w}(я сбился со счёта)...
    0x2B20, // Не кисни, чувак! Расслабься нахрен! Не, ну правда!
    0x2B79, // Я расслаблен, мать твою!
    0x2BA5, // Говорю, что вижу!
    0x2BC4, // Подумай об этом. Когда начали дорожать земля и дома? Когда женщины начали появляться в качестве рабочей силы, потому что это создало ядрёные двухдоходные семьи.
    0x2CEA, // Я, конечно, забыл свои графики, но, поверь мне на слово, женщины стоят за разложением всего общества.
    0x2DA0, // Ну да. В это сложно поверить.
    0x2DD4, // Хоть я так и говорю, однако то, что говорит Кендзи, начинает потихоньку приобретать смысл.
    0x2E78, // Всё начинает сходиться, но я не могу понять: то ли Кендзи объясняет лучше, когда пьяный, то ли я, выпив, мыслю яснее.
    0x2F48, // Нет, чувак, думай. Думай! Подумай о глубоких подоплёках!
    0x2FAD, // Люди теперь могут сказать что-то типа: «А, ну раз в семье сейчас приносят деньги два человека против одного, то они точно могут позволить себе платить за собственность больше».
    0x30EE, // Я понял, о чём ты. Но земля в Японии всегда была дорогой.
    0x3153, // …И цена на землю идёт вверх в основном тогда, когда в стране начинается индустриализация. …Но нет! Это из-за женщин! Корреляция сама за себя говорит.
    0x3263, // А мне-то казалось, что подобные рассуждения – логическая ошибка. Ну ладно, пофиг, может, ты и прав.
    0x3315, // Я всегда прав. Да-а, могу поспорить, женщины придумали индустриализацию, чтобы прикрыть свои следы.
    0x33CA, // Дьявольски умный план.
    0x33F4, // Так что да, все могут идти на хрен!
    0x3432, // Он встаёт, впечатляя меня, потому что я почти уверен, что не смог бы этого сделать, даже если бы и захотел. Его крик такой громкий, словно у Кендзи сорвало переключатель мощности. Я дёргаюсь, испытывая желание зажать уши.
    0x35C1, // А-а-ах, как здорово было б оказаться сейчас там, внизу… Но нет. Видишь ли, такие мысли – это ловушка: тебе кажется, что ты что-то упускаешь, но в конце этого пути нет ничего, кроме отчаяния…
    0x3716, // Кендзи выхватывает у меня бутылку и запрокидывает голову, собираясь влить выпивку себе в рот, но в итоге лишь проливает её на себя.
    0x3805, // Вот чёрт! Гляди, я сбил прицел! И, что самое поганое в выпивке, – он сбивается всё сильней, чем больше ты пьёшь.
    0x38CC, // Сегодня день отчаяния.
    0x38F6, // Его голос разом опускается до шёпота, но он начинает тараторить, слегка коверкая слова из-за выпитого.
    0x39B1, // Толкая речь, он размахивает бутылкой, расплёскивая её содержимое там и сям.
    0x3A3B, // Да, знаешь, какое было самое ужасное событие в моей жизни?
    0x3AA4, // Я смутно припоминаю, как он рассказывал мне о своём втором-самом-ужасном-событии-в-жизни, а именно – когда птичка нагадила ему на голову.
    0x3B9E, // Я не особо много жду от его ответа, но всё равно киваю, чтоб он продолжал.
    0x3C22, // Не поверишь, но у меня когда-то была девушка, вроде бы в прошлом году.
    0x3C9F, // Эге, я сейчас сорвал тебе крышу, а? Понимаешь, я никому раньше этого не говорил.
    0x3D2E, // И правда, крышу у меня от этой мысли сносит серьёзно. Мне вдруг начинает хотеться выпить. Я отбираю у Кендзи бутылку и заливаю в себя столько виски, сколько могу.
    0x3E53, // Я был тогда более невинен и думал, что она в своём уме, в отличие от большинства женщин. Но однажды мы… переспали.
    0x3F21, // Вышло вполне себе здорово, но сразу после случилось такое, ты не поверишь, странное и пугающее одновременно.
    0x3FE7, // Он шарахается к забору, прислоняясь к нему и щуря глаза.
    0x404D, // Я почувствовал себя ужасно усталым и сонным! Это ненормально, чувак! Что за хрень?
    0x40E2, // В смысле, это же должен быть пиковый, адреналиновый момент жизни любого чела, но вся моя энергия словно сливалась в унитаз!
    0x41C2, // Тут было замешано что-то зловещее, я это чувствовал.
    0x4221, // И тогда я понял… Женщины опасны, они высасывают жизнь из всех мужчин средством, которое доступно практически им одним!
    0x42FB, // Омерзительно.
    0x4315, // Да, братан, тебе стоило бы поостеречься этого…
    0x436B, // Кендзи прав, сегодня и впрямь день отчаяния. Я опрокидываю ещё, чтобы избежать раздумий над только что сказанным им.
    0x443F, // Теперь я последний разумный человек в безумном мире… Когда другие это поймут, случится война, великая война между мужчинами и силами феминизма.
    0x4548, // Но подвох в том, что не все мужики будут сражаться на моей стороне… что хреново. Я мог бы опустить планку до минимума, принимать в свои ряды любого мужика. Но только не тех, кого воспитывала мамочка или сестра, это точно.
    0x46D7, // И не тех, кому нравятся членодевки.
    0x4717, // Ха… Я думаю, это вряд ли случится, типа вряд ли, типа… вероятность очень низкая.
    0x47A9, // Похоже, сказывается выпитое.
    0x47DE, // Но мне всё равно горько находиться сейчас здесь.
    0x4837, // По правде говоря, я не ждал фестиваля с той же радостью и предвкушением, как остальные в школе, но тем не менее.
    0x4900, // Было бы здорово с кем-нибудь пойти на него. Глядя отсюда кажется, что все весело проводят время. Наверное, я многое упускаю.
    0x49E0, // Просто так вышло, что мне оказалось не с кем пойти.
    0x4A3C, // Может, кто-то и был. Если вспомнить, то было столько возможностей, но я их все прохлопал.
    0x4ADB, // Чёрт, это и есть истинное отчаяние… Самое худшее, что я иногда чувствую, что мне не предоставлено никакого выбора в жизни, понимаешь?
    0x4BCE, // Как будто у меня и не было шанса принять решение, вся херня просто шла своим чередом.
    0x4C68, // Как будто всё заранее запрограммировано. Похоже на судьбу… или что-то вроде того. Как будто у меня нет права голоса в определении своих поступков.
    0x4D74, // Скорее, задай мне вопрос!
    0x4DA2, // Хм…
    0x4DAA, // Быстро!
    0x4DB8, // Я что-то не совсем…
    0x4DDC, // Видишь? Вот ещё один пример! Чёрт! Дерьмо! Чёрт! Видишь, да? Я сейчас пытаюсь пойти против судьбы и взять управление своей жизнью в свои руки, но у меня даже нет возможности.
    0x4F13, // Блин, чувак, ты меня обломал. Обломал меня в последний раз. Гад.
    0x4F85, // Он падает на колени, затем валится набок, растягиваясь на гравии крыши.
    0x5007, // Эй, ты в порядке?
    0x5025, // Нет, я не в порядке, не видишь – я в отчаянии?
    0x5076, // Отвечает он мне язвительно.
    0x50A9, // Внезапно Кендзи садится, неловко отряхивается и протягивает ко мне руку за бутылкой. Я передаю ему остатки.
    0x516E, // Что за чёрт? Блин, ты прикончил почти целую бутылку. Видишь, это как моя жизнь – никаких альтернатив…
    0x5227, // Так и будет теперь всё время?
    0x525C, // Ну, я вполне уверен, что всё время так не будет.
    0x52B1, // О чём бы он ни толковал. У меня кружится голова. Я встаю и прислоняюсь к ограде, надеясь, что это поможет мне немного собраться.
    0x5397, // Да-а, я знаю. Надо превозмогать, сражаться всем, что имеем. Только так и можно жить.
    0x542C, // Ты неплохой парень.
    0x5450, // Наша братская связь – то, что поддерживает меня в эти тёмные времена.
    0x54CF, // Айда троллить женщин.
    0x54F7, // Тралить женщин? Чего?
    0x551E, // Троллить женщин. Троллить за женщин. Но нам надо начинать сейчас, пока я не потерял пьяную храбрость.
    0x55D6, // Он дико размахивает руками. Безумно даже.
    0x5622, // Я отступаю назад.
    0x5642, // Он шагает вперёд.
    0x5662, // Что с тобой? Не в настроении для любви?
    0x56A8, // Если честно… нет.
    0x56C9, // Я делаю ещё шаг назад.
    0x56F1, // Он делает ещё шаг вперёд.
    0x571F, // Он чересчур близко наклоняется ко мне.
    0x5766, // Что за чёрт, перестань ко мне прижиматься, мне это не нравится.
    0x57D8, // Как прижиматься? Эй, не стоит так опираться на ограду, это небезопасно.
    0x5859, // Я стараюсь отодвинуться от Кендзи, но моё равновесие меня подводит.
    0x58D5, // Пошатываясь от головокружения, я хватаюсь за столбик ограды, но он поддаётся, как только я наваливаюсь на него своим весом.
    0x59B6, // …Нехорошо это. Хотя мой пропитанный алкоголем мозг не может дать ответ почему.
    0x5A47, // Хотя лицо Кендзи, кажется, становится меньше – хоть какое-то облегчение.
    0x5ACC, // Вообще-то намного меньше. И с такой скоростью.
    0x5B20, // И, похоже, начинает дуть ветер. Из-за этого я почему-то кажусь себе почти невесомым.
    0x5BB7, // Я в ступоре, будто мой разум полностью опустел.
    0x5C0D, // Я… падаю?
    0x5C1F, // Я перевожу взгляд на ночное небо. Бутылка выпадает из моих пальцев и бесследно исчезает, пока я лечу.
    0x5CD7, // Я понимаю, что это подходящий конец для плохого, по-настоящему плохого дня.
};

#endif // KS_A1_SUNDAY_THE_DEEP_END_RU_TL_INDEX