#ifndef KS_LILLY_AND_HANAKO_UNION_RU_TL_INDEX
#define KS_LILLY_AND_HANAKO_UNION_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_42266804_ru_intl[] = {
    0x0000, // Я покупаю пластиковую тарелку такояки в киоске соседнего с нашим класса, сажусь в школьном сквере и принимаюсь глядеть на прохожих, неуверенно ковыряя по кусочку довольно безвкусную еду.
    0x0158, // Полагаю, жаловаться не стоит. Всё же лучше, чем ничего, и стоит недорого.
    0x01DB, // Я гляжу на школу – созерцание приходящих и уходящих людей оказывается удивительно неплохим способом скоротать время во время еды.
    0x02CC, // Маленькие дети в сопровождении родителей или бабушек-дедушек шумно носятся от одного развлечения к другому; одной рукой они цепляются за сопровождающего, а в другой держат красочную сладкую вату непомерной величины.
    0x045B, // Кажется, преобладают люди пожилого возраста. Это я заметил, ещё когда гулял по городу.
    0x04F8, // Должно быть, это один из тех городков, где остались только коренные жители, решительно отказывающиеся его покидать, а также те, кто хочет прожить остаток своих дней в одном из спокойных мест, которых остаётся всё меньше.
    0x0689, // Думаю, это заодно и объясняет, откуда взялась такая консервативность в обычаях школы «Ямаку».
    0x0735, // Я не против. Мне, в общем, нравится спокойствие «Ямаку» и окрестностей.
    0x07B6, // А вот жара – совсем другое дело. Так долго просидев на солнцепёке, я теперь могу думать только о всё усиливающемся зное.
    0x0891, // Мне лучше двигать отсюда, если я—{w=.5}{nw}
    0x08D9, // Гхе!
    0x08E1, // Колокольный звон застаёт меня врасплох, пока я поднимаюсь со скамьи, – то же случается и с несколькими проходящими мимо людьми.
    0x09CB, // Вслед за окончанием перезвона с треском пробуждается к жизни система вещания. О её возрасте можно судить по едва разборчивому объявлению директора, который говорит об открытии и без того идущего полным ходом праздника.
    0x0B5E, // Довольно примечателен контраст между довольными улыбками стариков и, напротив, скучающими и кислыми гримасами людей помоложе. Что же до учеников, то им попросту наплевать.
    0x0C9A, // Тем не менее, когда обращение заканчивается, все дружно, пусть и без особого энтузиазма, хлопают и возвращаются к своим делам.
    0x0D80, // Сунув руки в карманы, чтобы смотреться как можно более расслабленным, я мимоходом оглядываюсь по сторонам.
    0x0E44, // …Особо далеко не посмотришь: кругом люди.
    0x0E91, // Я решаю положиться на проверенное правило: идти туда, куда идут все. Прямо сейчас народ направляется в сторону школьного двора и его окрестностей.
    0x0F9D, // Выбросив тарелку в бак для мусора, я иду к главному зданию.
    0x1008, // Я удивляюсь, увидев, сколько здесь расставлено киосков. Должно быть, немало классов скооперировалось, чтобы выставить их сразу по несколько штук.
    0x1113, // Решая, какой посетить первым, я замечаю знакомый плакат с синей узорчатой окантовкой и красным текстом.
    0x11D1, // Вполне можно начать обход с киоска Лилли. Мне любопытно узнать, как у неё идут дела после всех потраченных на его устройство усилий.
    0x12C2, // Подойдя ближе, я начинаю понимать, почему её классу так долго пришлось возиться, чтобы всё обустроить.
    0x137D, // Он как минимум вдвое шире большинства других киосков, и повсюду вокруг него расставлено кухонное оборудование, так что он скорее ближе к ресторану на открытом воздухе, чем к фестивальному проекту.
    0x14E6, // Ученик впереди меня берёт миску лапши и отходит, а я приближаюсь к прилавку.
    0x1571, // Девушка за ним кажется довольно сердитой и велит мне подождать, а затем исчезает под прилавком.
    0x1620, // Улучив момент, я быстренько оглядываюсь по сторонам.
    0x1681, // Пар поднимается как будто отовсюду: из медленно кипящих кастрюль, из небольших котелков. Наиболее плохо видящие ученики под присмотром, вероятно, классного руководителя, распаковывают продукты.
    0x17E7, // Вскоре я замечаю Лилли, которая разговаривает с учительницей, ловко пересчитывая пальцами коробки и пакеты.
    0x18AE, // Судя по её выражению и тому, что она, равно как и учитель, находится в состоянии лёгкого замешательства, очевидно у них некие проблемы со снабжением.
    0x19BD, // Из-под прилавка, закрывая мне обзор, возникает девушка и тут же оборачивается назад с вопросом, где запасная коробка со сдачей.
    0x1AA5, // Лилли на миг замирает, затем они с девушкой меняются местами за прилавком, а учительница быстро куда-то уходит.
    0x1B70, // Простите, у нас небольшие проблемы. Что вы хотели?
    0x1BCB, // Мне требуется несколько секунд, чтобы вспомнить, зачем я здесь. Я поспешно перевожу взгляд на выставленное на прилавке меню.
    0x1CAF, // Хм, ну, я думаю, немного… мисо-супа?
    0x1CEF, // А, это ты, Хисао?
    0x1D0C, // Ага. Похоже, вы неслабо заняты.
    0x1D44, // Сбросив личину официантки, она всем своим видом выражает полнейшее согласие.
    0x1DD2, // Где-то в цепочке доставки наш заказ оказался перепутан. Мы сейчас стараемся всё поправить, но похоже, что у нас есть лишь половина необходимого.
    0x1ED9, // Порции поменьше не решат вашу проблему?
    0x1F22, // Видимо, нам так и придётся поступить, хотя я предпочла бы этого избежать. В том, что добрая половина нашего класса куда-то запропастилась, хорошего тоже мало.
    0x2041, // Я заглядываю ей за спину, чтобы оценить, сколько людей работает в киоске.
    0x20C6, // Их максимум восемь.
    0x20EA, // Могу поспорить, учитель ушла именно поэтому?
    0x213C, // Да, верно. Она рассчитывает пойти и пригнать на помощь ещё несколько наших одноклассников.
    0x21E2, // Заслышав позади себя звуки шагов, я украдкой бросаю взгляд назад, обнаруживая позади себя пожилую пару, занимающую место в очереди. Полагаю, мне стоит перестать мешкать и прекратить болтовню.
    0x2341, // Вот деньги за суп.
    0x2362, // Суп… А, да, минуточку.
    0x238A, // Лилли поворачивается и просит чашу мисо-супа, а я тем временем отдаю ей деньги.
    0x241A, // Вложив монеты в её ладонь, я непроизвольно замечаю, как сноровисто она пересчитывает их своими длинными бледными пальчиками. Обрадовавшись тому, что я дал ей точную сумму без сдачи, она кладёт её в маленький металлический лоток.
    0x25BC, // Спустя всего пару минут суп оказывается готов и бережно вложен в её руки, после чего она разворачивается и без промедления передаёт его мне.
    0x26BD, // Спасибо. Я зайду снова и верну плошку.
    0x2702, // Спасибо тебе, Хисао. О, и ещё кое-что. Ты не видел Ханако?
    0x2767, // Ханако… Нет, сегодня не видел. А что?
    0x27AA, // Она вздыхает со смиренным разочарованием.
    0x27F8, // Да ничего. Мне просто было любопытно, пойдёт ли она на фестиваль.
    0x286E, // Значит, ты зайдёшь, когда закончишь?
    0x28B0, // Конечно. И я посмотрю, не попадётся ли мне Ханако.
    0x290A, // Спасибо, Хисао.
    0x2926, // Я отхожу от киоска и присаживаюсь, бережно держа обеими руками исходящую паром деревянную плошку.
    0x29DA, // По сравнению с такояки, которые я брал до этого, совсем неплохо. Холоднее, чем должен быть суп, но запах восхитительный.
    0x2AB3, // Пока я ем, не могу избавиться от смутного чувства вины за то, что не принимаю такого активного участия в обустройстве фестиваля, как остальные ученики.
    0x2BC7, // Ничего не поделаешь, ведь меня занесло в эту школу всего лишь неделю назад, но всё равно мне как-то совестно.
    0x2C8C, // К тому же некоторые ученики явно проводят время на фестивале не настолько весело, как посетители.
    0x2D3F, // Так или иначе, я доедаю и отправляюсь к киоску, чтобы вернуть плошку.
    0x2DBC, // Приняв во внимание, что очереди почти нет, я возвращаюсь не спеша.
    0x2E34, // Видимо, миссия учителя завершилась успешно: я вижу более чем дюжину прилежно работающих учеников и большая часть распаковки уже выполнена.
    0x2F34, // Несмотря на то что большинство спокойно делают свою работу, Лилли, кажется, чем-то расстроена.
};

#endif // KS_LILLY_AND_HANAKO_UNION_RU_TL_INDEX