#ifndef KS_A1_THURSDAY_PAINT_BY_NUMBERS_RU_TL_INDEX
#define KS_A1_THURSDAY_PAINT_BY_NUMBERS_RU_TL_INDEX

#include "bn_vector.h"
constexpr unsigned int tl_F133B6D2_ru_intl[] = {
    0x0000, // Тебе нужно её найти? Она искала тебя утром, но вы, наверное, разминулись.
    0x0083, // Она немного медлит, не отвечая на простой вопрос, с таким видом, будто не уверена, стоит ли вообще отвечать.
    0x0146, // Д… да.
    0x0152, // Я могу с тобой сходить.
    0x017C, // Если ты не против.
    0x019D, // Ханако вся напрягается и слабо кивает, будучи всё ещё настороже. Я чувствую, что ей уютнее было бы остаться одной, но отступать уже поздно.
    0x0299, // На её лице застыло обычное для неё обеспокоенное выражение, из-за которого я и сам напрягаюсь. Непонятно почему.
    0x0366, // Я, в принципе, понимаю, почему она всё время такая настороженная… или скорее почему она стала такой.
    0x041D, // Но всё ещё понятия не имею, как себя с ней вести.
    0x0474, // Скоро обеденный перерыв. Ты хотела пойти на обед с Лилли?
    0x04DC, // Она еле заметно кивает.
    0x0507, // Видимо, она пыталась попасть в столовую.
    0x0551, // Ну, и во время обеда там полно народа, почти столько же, сколько и во время ланча.
    0x05E3, // Однако не так много, потому что обед длится дольше ланча. Но я понимаю, почему Ханако не решалась пойти туда в одиночку.
    0x06BC, // Я беру портфель, и мы выходим. Ханако шагает немного вприпрыжку, чтобы поспеть за мной, так что я сбавляю ход, подстраиваясь под неё.
    0x07AC, // Вскоре мы уже шагаем по коридору с устраивающей нас обоих скоростью.
    0x082A, // Это похоже на прогулку с девушкой, чего я никогда раньше не делал.
    0x08A2, // Однако у Ханако, похоже, сейчас нет ничего такого в мыслях. Даже несмотря на то, что мы идём наравне, она не приближается ко мне и на расстояние вытянутой руки.
    0x09C2, // Наверное, ей до сих пор неуютно в моей компании. Учитывая, какая она застенчивая, с этим ничего не поделать, во всяком случае сейчас.
    0x0AB2, // К моменту, когда мы входим в столовую, толпа уже успевает рассосаться, но Лилли нигде не видно.
    0x0B5E, // Ханако опускает голову ещё ниже, чем обычно.
    0x0BAF, // Ты искала ещё где-нибудь?
    0x0BDD, // Т-только в библиотеке… Я читала…
    0x0C1B, // Так она всё-таки прогуливает уроки в библиотеке.
    0x0C74, // А, значит, это был не слишком тщательный поиск. Ну, если подумать, она может быть в своём классе, как и сказала Сидзунэ, правда?
    0x0D58, // П-правда.
    0x0D69, // Ханако соглашается с моими аргументами едва заметным кивком.
    0x0DDA, // Господи, как же с ней трудно.
    0x0E0E, // Мне словно нужны перчатки из двойного слоя шёлка с набивкой, только чтобы начать с ней как-то взаимодействовать.
    0x0EDC, // Беседа может помочь ей привыкнуть ко мне. Нетрудно заметить, что повисшее в воздухе молчание тяготит нас обоих.
    0x0FA8, // Так вы с Лилли время после уроков обычно проводите вместе, да?
    0x1019, // Д-да.
    0x1022, // Не знаю, какого ещё от неё можно было ждать ответа и зачем я вообще задал этот вопрос. Это, в общем-то, и так было вполне очевидно.
    0x110B, // Она явно не из тех людей, что собирают вокруг себя толпу друзей, а потому подозреваю, что Лилли – её единственная подруга.
    0x11E9, // Наверное, тяжело быть в разных классах.
    0x1231, // Она резко, почти рефлекторно кивает. По сравнению с тем, как Лилли внимательно следит за своей речью и жестами, Ханако спешит давать как можно более прямые и краткие ответы.
    0x136C, // Но Лилли… приходит к нам в класс. Даже если занята…
    0x13CB, // Она тихонько улыбается, произнося это, явно ценя то, что Лилли отклоняется от маршрута, чтобы помочь ей.
    0x1488, // Это очень мило. Больше нам сказать друг другу нечего, и разговор заканчивается.
    0x1519, // Поднимаясь по лестнице в вестибюль, мы встречаем группу спускающихся учеников. Они похожи на косяк рыб, меняющий место кормёжки.
    0x1605, // Они общаются между собой, не обращая на нас внимания, но не успеваю я опомниться, как Ханако прячется у меня за спиной.
    0x16DC, // Эй, ты в порядке?
    0x16FA, // П-просто продолжай идти…
    0x1729, // Ученики проходят мимо, даже не взглянув на нас, и Ханако снова занимает место рядом со мной, когда мы входим в здание, а её отступившее было смущение снова возвращается.
    0x185C, // Она не расслабляется, даже когда мы доходим до третьего этажа.
    0x18CE, // Не то чтобы я не был знаком с застенчивыми людьми, среди которых были и девушки, но Ханако в своей боязни людей выходит далеко за рамки, которые я бы назвал «нормальными».
    0x1A04, // Если бы Лилли не выступила в качестве посредника, сомневаюсь, что Ханако смогла бы вот так идти рядом со мной. Она полностью закрывается в присутствии других людей.
    0x1B30, // Остаток прогулки до класса Лилли проходит в напряжённой тишине, из-за которой я сожалею о её полной неспособности общаться.
    0x1C13, // Когда мы поднимаемся на нужный этаж, гул из класса Лилли становится слышен во всём коридоре. Я такого шума не ожидал.
    0x1CE8, // Ну, думаю, мы её нашли…
    0x1D12, // Это было несложно. Не заходила ли Ханако сначала сюда, а потом – ко мне за подкреплением?
    0x1DB4, // Ну, если это так, значит она начинает мне немного доверять. Это определённо хорошо.
    0x1E4B, // Наконец мы доходим до двери класса 3-2. Ханако прячется у меня за спиной, и я открываю дверь.
    0x1EF0, // Внутри царит рабочая обстановка: все ученики разговаривают одновременно, работая каждый над своей задачей.
    0x1FB6, // Судя по банкам с краской, украшениям и изготавливаемым растяжкам, они готовятся к фестивалю.
    0x2060, // Думаю, в первую очередь надо найти Лилли…
    0x20AD, // …{w} Вот она.
    0x20C3, // Найти её среди неразберихи оказывается удивительно просто, не в последнюю очередь из-за её внешности.
    0x217E, // Она стоит в передней части класса с несколькими учениками, собравшимися вокруг неё, и сразу видно, что она – главная по подготовке или как минимум занята раздачей указаний.
    0x22BA, // Осторожно ступая между учениками, сгорбленными на полу из-за недостатка места на партах, я по привычке поднимаю руку, когда мы наконец доходим до Лилли.
    0x23D0, // Привет, Лилли.
    0x23EA, // Она перестаёт говорить с одноклассницей, заметно уступающей ей в росте, и поднимает голову, внимательно прислушиваясь.
    0x24C5, // Простите, кто…
    0x24E1, // А, извини. Хисао. И Ханако со мной.
    0x251E, // П-привет.
    0x252F, // Она очень стесняется. Учитывая количество людей вокруг, нетрудно понять почему.
    0x25C2, // Лилли на секунду замолкает, чтобы оценить ситуацию, а затем опять переключается на другого ученика.
    0x2679, // Пока попроси совета у Мории. Кендзи уже занят – рисует один из плакатов.
    0x26FD, // Быстро кивнув, она уходит, осторожно скользя пальцами вдоль стены для ориентации.
    0x2793, // Стоп… Кендзи? Тот самый Кендзи?
    0x27CD, // Я быстро оборачиваюсь, наклонившись, чтобы заглянуть за Ханако.
    0x2842, // Ошибки быть не может: в углу комнаты действительно скрючился Кендзи, разрисовывая кусок ткани. Его глаза находятся в нескольких сантиметрах от кисти, напоминая, насколько близко ему нужно подойти, чтобы различить моё лицо.
    0x29DA, // Очень жаль. У нас в классе мало учащихся с хотя бы частичным зрением, так что на них большой спрос.
    0x2A8C, // Верно, ведь класс 3-2 – специальный класс для учеников с плохим зрением. Им, должно быть, тяжело готовиться к фестивалю.
    0x2B64, // Нужна помощь? Я могу помочь, если нужно. И Ханако, наверное, тоже.
    0x2BD9, // Если чем-то её занять, это пойдёт ей на пользу, но сомневаюсь, что у неё хватит смелости спросить напрямую. После моих слов она быстро кивает, подтверждая догадку о том, что я сделал верный ход.
    0x2D36, // Лилли вздыхает с облегчением.
    0x2D6D, // Очень хорошо. Теперь мы, возможно, закончим до того, как все уйдут на ужин.
    0x2DF3, // Не могли бы вы помочь человеку, который рисует главный плакат? Там много работы, но помочь ему некому.
    0x2EAC, // Кендзи? Конечно.
    0x2ECA, // Она, кажется, удивлена, что я его знаю. Что и неудивительно.
    0x2F35, // Я так понимаю, вы встречались?
    0x2F6C, // Мы живём в соседних комнатах в общежитии. Очень трудно разминуться.
    0x2FE8, // Приятно видеть, что ты так быстро заводишь друзей.
    0x3044, // Друг… Интересно, подходящее ли это для него слово?
    0x30A1, // Молчание Ханако напоминает мне о причине, по которой я вообще вызвался помочь.
    0x3131, // Тогда мы пойдём к нему. Он знает, что нужно делать, так ведь?
    0x319D, // Именно. Если будут проблемы – спрашивайте.
    0x31EC, // Хором соглашаясь, мы с Ханако пускаемся в очередное путешествие через класс.
    0x3279, // Кендзи сидит на полу сгорбленный, не отрывая глаз от белого полотна перед собой.
    0x330C, // Привет, Кендзи.
    0x3328, // …Нет ответа. Он продолжает водить кистью по большому, наполовину раскрашенному иероглифу, начерченному карандашом.
    0x33FE, // Кендзи?
    0x340C, // А? Что? Кто это?
    0x3427, // Если он так общается с одноклассниками, то неудивительно, что он работает один.
    0x34B8, // Это я. Хисао. Из—{w=.5}{nw}
    0x34E1, // Да, да, знаю, чувак. Но что ты здесь делаешь?
    0x352F, // Его пренебрежительное отношение меня раздражает.
    0x358B, // Наверное, он из тех, кто полностью сосредотачивается на работе и терпеть не может, когда его отвлекают.
    0x3647, // Звук шагов Ханако, выходящей у меня из-за спины, напоминает о её присутствии.
    0x36D3, // Я собирался помочь с плакатом. Точнее, мы с Ханако.
    0x372F, // П… Привет…
    0x3745, // А. Э, привет. Никаких проблем.
    0x377A, // Как только к нам присоединяется Ханако, его отношение меняется на совершенно противоположное. Его внезапное ложное радушие немного тревожит.
    0x387F, // А, точно. Женщины. Теперь кажется, что, возможно, это было не такой уж хорошей идеей.
    0x3916, // Мы с Ханако нехотя опускаемся с противоположной от Кендзи стороны плаката, заметив несколько небольших баночек краски на полу вокруг него.
    0x3A16, // Класс 3-2… киоск с лапшой?
    0x3A44, // На воскресном фестивале вы будете продавать лапшу?
    0x3AA2, // Да, будет несколько киосков. Или вроде того.
    0x3AF2, // «Вроде того»? Его уклончивая манера вызывает у меня серьёзные подозрения. Но дело прежде всего.
    0x3BA1, // Так как ты хочешь разделить работу? Мы делаем края, а ты – текст? Или хочешь поменяться и делать края?
    0x3C59, // Текст – мой. Делайте края.
    0x3C89, // Оказывается, он серьёзно к этому относится.
    0x3CD9, // Я тянусь за кистью и замечаю, что Ханако уже решает, какой выбрать цвет.
    0x3D5B, // К моменту, когда я притрагиваюсь кистью к материи, она уже начинает работать над сложным узором. Похоже, моя идея отвлечь её от окружающих сработала.
    0x3E6B, // Мы втроём молча принимаемся наносить тёмно-синие штрихи.
    0x3ED4, // Правда, сперва Кендзи наклоняется ко мне и заговорщически шепчет, пользуясь тем, что Ханако увлеклась работой.
    0x3F9F, // Ладно, чувак, зачем ты здесь?
    0x3FD3, // Ханако попросила помочь найти Лилли, вот и всё.
    0x4029, // Видно, что мой ответ восторга у него не вызывает.
    0x4082, // Я понял. Похоже, я тебя недооценил.
    0x40C1, // Ты внедряешься, да? Работаешь под прикрытием?
    0x4114, // Следовало бы догадаться. Не сказать всей правды, возможно, будет лучше, чем откровенно лгать или злить его.
    0x41D7, // Ты здесь именно за этим?
    0x4203, // Ясное дело. Отстой, конечно, но нет лучшего способа получить разведданные, чем пойти в разведку самому.
    0x42BF, // Нам надо держаться вместе, чувак. Это суровая школа, суровый мир.
    0x4335, // Да, очень суровый.
    0x4356, // Он не улавливает скрытого смысла в моих словах и откидывается назад, удовлетворённый моим полным согласием. Лучше приняться за работу.
    0x444E, // Готово.
    0x445C, // У меня вроде тоже. Хорошая работа.
    0x449A, // Мы соединяем линии своих узоров; я пытался скопировать её узор как можно точнее.
    0x452D, // Я, кряхтя, поднимаюсь с пола и оглядываюсь.
    0x457B, // Кроме нас с Ханако, в классе только Кендзи, заканчивающий надпись, а также Лилли и пара учеников, болтающих между собой.
    0x4655, // Это неудивительно, ведь, судя по часам, время уже позднее.
    0x46BE, // Тебе помочь?
    0x46D5, // Я протягиваю руку Ханако, и она поднимается, ухватившись за неё.
    0x474A, // Я не могу удержаться от взгляда на её запястье; если шрамы простираются даже досюда, то насколько велик обожжённый участок её тела?
    0x483A, // Но я всё же чувствую укол вины, когда она прикрывает запястье другой рукой.
    0x48C3, // Неплохо выглядит, правда?
    0x48F2, // Она заметно удивляется, но потом понимает, что я говорю о плакате.
    0x496A, // Да… Наверное.
    0x4984, // Её улыбка свидетельствует о том, что она горда результатом, как и я.
    0x49FF, // Поскольку украшения сейчас убраны на парты и полки, пол стал гораздо свободнее и добраться до Лилли в противоположном конце класса оказывается легче.
    0x4B13, // Мы закончили плакат. Видимо, это всё, что было нужно?
    0x4B72, // Лилли признательно кивает.
    0x4BA4, // Спасибо, Хисао, Ханако. Как я могу вас отблагодарить?..
    0x4C06, // Не стоит. Всё лучше, чем корпеть в комнате над учебниками.
    0x4C6F, // Мне тоже было несложно.
    0x4C9A, // Лилли кивает и вдруг вспоминает кое о ком ещё.
    0x4CEE, // Ой, а Кендзи ещё здесь?
    0x4D17, // Как только я открываю рот, Кендзи подаёт голос с другого конца комнаты.
    0x4D99, // Да, как раз закончил.
    0x4DBF, // Он осторожно кладёт плакат на свободную полку, чтобы тот высох, и быстро проходит мимо нас за дверь.
    0x4E75, // Увидимся, чувак.
    0x4E93, // Пока.
    0x4E9D, // Последние два ученика прощаются с Лилли, прежде чем тоже уйти, и мы остаёмся втроём.
    0x4F36, // Ну, похоже, все ушли.
    0x4F5B, // Надеюсь, нам не придётся делать что-то подобное снова.
    0x4FBE, // Работать после уроков?
    0x4FE8, // Именно. Планы класса в этом году были амбициозны. Может, даже чересчур.
    0x5069, // Но киоски красивые.
    0x508D, // Она права. Видно, что на них потратили много усилий.
    0x50EB, // Вот как? Уверена, многие из наших ребят были бы рады это услышать. В любом случае теперь до фестиваля осталось не так много работы.
    0x51D8, // Эм-м… время близится к ночи. Может, пойдём?
    0x5226, // Хорошая идея. Ты тоже возвращаешься в общежитие, Хисао?
    0x528B, // Да, прогуляюсь, пожалуй, с вами.
    0x52C4, // Ночью в свете фонарей сквер выглядит абсолютно по-другому. По сравнению с обычным видом буйной зелени, сейчас вокруг намного спокойнее.
    0x53BD, // Тут роль играет и отсутствие людей, учитывая поздний час. Можно увидеть разве что одного-двух учеников, направляющихся в общежития или из них, спешащих по максимуму использовать оставшееся до отбоя время, и всё.
    0x553F, // Слышны только наши шаги и лёгкое постукивание трости Лилли по земле.
    0x55BD, // Хорошо наконец немного расслабиться после сумасшедшей суеты в школе.
    0x563D, // Не успев спохватиться, я тихонько зеваю.
    0x5687, // Устал?
    0x5693, // Да. Наверное, ещё не привык к круговороту событий.
    0x56EE, // Но та… э… ситуация… с Сидзунэ застала меня врасплох.
    0x5751, // Я стискиваю зубы, невольно напомнив об их публичной перебранке. К слову, хотелось бы выяснить, что же, чёрт возьми, за всем этим кроется.
    0x5848, // А… насчёт этого…
    0x5869, // Прости, что тебе пришлось стать невольным свидетелем нашей ссоры. Мы с Сидзунэ… у нас это давно.
    0x5919, // Её голос становится немного раздражённым, когда она вспоминает про Сидзунэ. Дальше эту тему, я думаю, она обсуждать не захочет.
    0x5A01, // Я смотрю на Ханако с целью узнать, что она об этом думает, но по выражению её лица трудно что-либо понять.
    0x5ABF, // В любом случае, думаю, извинения Лилли дорогого стоят, даже если моё любопытство остаётся неутолённым.
    0x5B7B, // Как бы то ни было, я буду рада, когда фестиваль закончится.
    0x5BE5, // Смена темы быстро разряжает атмосферу.
    0x5C2D, // Представляю. Фестивали в моей старой школе были куда скромнее, чем этот.
    0x5CB1, // «Ямаку» делает упор на идею школьного сообщества, поэтому персонал любит устраивать фестивали и подобные мероприятия.
    0x5D8C, // А вся работа ложится на учеников. Мир несправедлив.
    0x5DEA, // Ханако и Лилли, смеясь, соглашаются, радуясь тому, что никто из работников школы сейчас не слышит наших жалоб.
    0x5EB2, // Думаю, в «Ямаку» мне помогло то, что я перевелась сюда из пансиона для девочек. Здесь, по сравнению с ним, гораздо спокойнее.
    0x5F93, // Это во многом объясняет её благовоспитанные речь и поведение.
    0x6005, // Когда мы подходим к общежитиям, приходит время расходиться по комнатам.
    0x6089, // Увидимся, Лилли, Ханако.
    0x60B5, // Обе вежливо кивают, прежде чем отправиться в сторону женского общежития, расположенного рядом с мужским.
    0x6176, // Как и следовало ожидать от местного уклада, неподалёку ходит охранник, готовый пресечь любые ночные безобразия.
    0x6244, // Проходя мимо него, я быстро потягиваюсь и потираю шею, побаливающую после долгой работы на полу, а затем иду в свою комнату.
    0x6325, // Хорошо всё же, когда есть цель. После долгого времени, проведённого в больнице, жизнь в мире каждодневной учёбы, домашних заданий и учителей кажется практически благословением.
    0x6469, // Думаю, если так будет продолжаться, я проведу время в «Ямаку» не так плохо, как думал.
};

#endif // KS_A1_THURSDAY_PAINT_BY_NUMBERS_RU_TL_INDEX