#ifndef KS_FONTS_INFO
#define KS_FONTS_INFO

#include "bn_sprite_font.h"
#include "bn_utf8_characters_map.h"
#include "bn_sprite_items_font_playtime.h"
#include "bn_sprite_items_font_playtime_bold.h"
#include "bn_sprite_items_font_playtime_small.h"

constexpr bn::utf8_character font_playtime_utf8_characters[] = {
    "¡", "«", "»", "¿", "Á", "É", "Í", "Ñ", "Ó", "Ú", "Ü", "á", "é", "í", "ñ", "ó", "ú", "ü", "Ё", "А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я", "а", "б", "в", "г", "д", "е", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я", "ё", "–", "—", "…"
};

constexpr bn::utf8_character font_playtime_bold_utf8_characters[] = {
    "¡", "«", "»", "¿", "Á", "É", "Í", "Ñ", "Ó", "Ú", "Ü", "á", "é", "í", "ñ", "ó", "ú", "ü", "Ё", "А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я", "а", "б", "в", "г", "д", "е", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я", "ё", "–", "—", "…"
};

constexpr bn::utf8_character font_playtime_small_utf8_characters[] = {
    "¡", "«", "»", "¿", "Á", "É", "Í", "Ñ", "Ó", "Ú", "Ü", "á", "é", "í", "ñ", "ó", "ú", "ü", "Ё", "А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я", "а", "б", "в", "г", "д", "е", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я", "ё", "–", "—", "…"
};

constexpr int8_t font_playtime_character_widths[] = {
4,     // Space
3,    // !
5,    // "
7,    // #
8,    // $
9,    // %
9,    // &
3,    // '
4,    // (
4,    // )
4,    // *
7,    // +
3,    // ,
5,    // -
3,    // .
6,    // /
7,    // 0
4,    // 1
7,    // 2
7,    // 3
7,    // 4
7,    // 5
7,    // 6
7,    // 7
8,    // 8
7,    // 9
3,    // :
3,    // ;
7,    // <
7,    // =
7,    // >
6,    // ?
10,    // @
8,    // A
8,    // B
8,    // C
9,    // D
7,    // E
6,    // F
9,    // G
8,    // H
3,    // I
6,    // J
8,    // K
6,    // L
10,    // M
8,    // N
9,    // O
7,    // P
9,    // Q
8,    // R
8,    // S
6,    // T
8,    // U
7,    // V
10,    // W
8,    // X
7,    // Y
8,    // Z
4,    // [
6,    // Backslash
4,    // ]
7,    // ^
5,    // _
4,    // `
6,    // a
6,    // b
6,    // c
6,    // d
6,    // e
5,    // f
6,    // g
6,    // h
2,    // i
5,    // j
6,    // k
3,    // l
8,    // m
6,    // n
6,    // o
6,    // p
6,    // q
5,    // r
6,    // s
5,    // t
6,    // u
6,    // v
8,    // w
6,    // x
6,    // y
5,    // z
4,    // {
4,    // |
4,    // }
6,    // ~
3,    // ¡
6,    // «
6,    // »
6,    // ¿
8,    // Á
7,    // É
3,    // Í
8,    // Ñ
9,    // Ó
8,    // Ú
8,    // Ü
6,    // á
6,    // é
2,    // í
6,    // ñ
6,    // ó
6,    // ú
6,    // ü
7,    // Ё
8,    // А
8,    // Б
8,    // В
6,    // Г
9,    // Д
7,    // Е
13,    // Ж
7,    // З
8,    // И
8,    // Й
8,    // К
7,    // Л
10,    // М
8,    // Н
9,    // О
8,    // П
7,    // Р
8,    // С
6,    // Т
7,    // У
11,    // Ф
8,    // Х
8,    // Ц
7,    // Ч
12,    // Ш
13,    // Щ
8,    // Ъ
9,    // Ы
7,    // Ь
7,    // Э
12,    // Ю
7,    // Я
6,    // а
5,    // б
6,    // в
6,    // г
6,    // д
6,    // е
10,    // ж
6,    // з
6,    // и
6,    // й
6,    // к
6,    // л
8,    // м
7,    // н
6,    // о
6,    // п
6,    // р
6,    // с
8,    // т
6,    // у
10,    // ф
6,    // х
6,    // ц
6,    // ч
9,    // ш
10,    // щ
7,    // ъ
8,    // ы
6,    // ь
5,    // э
8,    // ю
5,    // я
6,    // ё
8,    // –
10,    // —
9,    // …

};

constexpr int8_t font_playtime_bold_character_widths[] = {
4,     // Space
3,    // !
5,    // "
7,    // #
8,    // $
9,    // %
9,    // &
3,    // '
4,    // (
4,    // )
4,    // *
7,    // +
3,    // ,
5,    // -
3,    // .
6,    // /
7,    // 0
4,    // 1
7,    // 2
7,    // 3
7,    // 4
7,    // 5
7,    // 6
7,    // 7
8,    // 8
7,    // 9
3,    // :
3,    // ;
7,    // <
7,    // =
7,    // >
6,    // ?
10,    // @
8,    // A
8,    // B
8,    // C
9,    // D
7,    // E
6,    // F
9,    // G
8,    // H
3,    // I
6,    // J
8,    // K
6,    // L
10,    // M
8,    // N
9,    // O
7,    // P
9,    // Q
8,    // R
8,    // S
6,    // T
8,    // U
7,    // V
10,    // W
8,    // X
7,    // Y
8,    // Z
4,    // [
6,    // Backslash
4,    // ]
7,    // ^
5,    // _
4,    // `
6,    // a
6,    // b
6,    // c
6,    // d
6,    // e
5,    // f
6,    // g
6,    // h
2,    // i
5,    // j
6,    // k
3,    // l
8,    // m
6,    // n
6,    // o
6,    // p
6,    // q
5,    // r
6,    // s
5,    // t
6,    // u
6,    // v
8,    // w
6,    // x
6,    // y
5,    // z
4,    // {
4,    // |
4,    // }
6,    // ~
3,    // ¡
6,    // «
6,    // »
6,    // ¿
8,    // Á
7,    // É
3,    // Í
8,    // Ñ
9,    // Ó
8,    // Ú
8,    // Ü
6,    // á
6,    // é
2,    // í
6,    // ñ
6,    // ó
6,    // ú
6,    // ü
7,    // Ё
8,    // А
8,    // Б
8,    // В
6,    // Г
9,    // Д
7,    // Е
13,    // Ж
7,    // З
8,    // И
8,    // Й
8,    // К
7,    // Л
10,    // М
8,    // Н
9,    // О
8,    // П
7,    // Р
8,    // С
6,    // Т
7,    // У
11,    // Ф
8,    // Х
8,    // Ц
7,    // Ч
12,    // Ш
13,    // Щ
8,    // Ъ
9,    // Ы
7,    // Ь
7,    // Э
12,    // Ю
7,    // Я
6,    // а
5,    // б
6,    // в
6,    // г
6,    // д
6,    // е
10,    // ж
6,    // з
6,    // и
6,    // й
6,    // к
6,    // л
8,    // м
7,    // н
6,    // о
6,    // п
6,    // р
6,    // с
8,    // т
6,    // у
10,    // ф
6,    // х
6,    // ц
6,    // ч
9,    // ш
10,    // щ
7,    // ъ
8,    // ы
6,    // ь
5,    // э
8,    // ю
5,    // я
6,    // ё
8,    // –
10,    // —
9,    // …

};


constexpr int8_t font_playtime_small_character_widths[] = {
3,     // Space
3,    // !
4,    // "
6,    // #
6,    // $
8,    // %
8,    // &
2,    // '
4,    // (
4,    // )
4,    // *
6,    // +
3,    // ,
4,    // -
3,    // .
5,    // /
6,    // 0
3,    // 1
6,    // 2
6,    // 3
6,    // 4
6,    // 5
6,    // 6
6,    // 7
6,    // 8
6,    // 9
3,    // :
3,    // ;
6,    // <
6,    // =
6,    // >
5,    // ?
8,    // @
6,    // A
7,    // B
7,    // C
7,    // D
6,    // E
5,    // F
8,    // G
7,    // H
3,    // I
5,    // J
6,    // K
5,    // L
9,    // M
7,    // N
8,    // O
6,    // P
8,    // Q
6,    // R
6,    // S
5,    // T
6,    // U
6,    // V
9,    // W
7,    // X
6,    // Y
7,    // Z
4,    // [
5,    // Backslash
4,    // ]
6,    // ^
4,    // _
3,    // `
5,    // a
5,    // b
5,    // c
5,    // d
5,    // e
4,    // f
5,    // g
5,    // h
2,    // i
4,    // j
5,    // k
2,    // l
7,    // m
5,    // n
5,    // o
5,    // p
5,    // q
4,    // r
5,    // s
4,    // t
5,    // u
5,    // v
6,    // w
5,    // x
5,    // y
4,    // z
4,    // {
4,    // |
4,    // }
5,    // ~
3,    // ¡
5,    // «
5,    // »
5,    // ¿
6,    // Á
6,    // É
3,    // Í
7,    // Ñ
8,    // Ó
6,    // Ú
6,    // Ü
5,    // á
5,    // é
2,    // í
5,    // ñ
5,    // ó
5,    // ú
5,    // ü
6,    // Ё
6,    // А
7,    // Б
7,    // В
5,    // Г
8,    // Д
6,    // Е
11,    // Ж
6,    // З
7,    // И
7,    // Й
6,    // К
6,    // Л
9,    // М
7,    // Н
8,    // О
7,    // П
6,    // Р
7,    // С
5,    // Т
6,    // У
9,    // Ф
7,    // Х
7,    // Ц
6,    // Ч
10,    // Ш
11,    // Щ
7,    // Ъ
8,    // Ы
6,    // Ь
6,    // Э
10,    // Ю
6,    // Я
5,    // а
5,    // б
5,    // в
5,    // г
5,    // д
5,    // е
8,    // ж
5,    // з
5,    // и
5,    // й
5,    // к
5,    // л
6,    // м
6,    // н
5,    // о
5,    // п
5,    // р
5,    // с
7,    // т
5,    // у
8,    // ф
5,    // х
5,    // ц
5,    // ч
8,    // ш
8,    // щ
6,    // ъ
7,    // ы
5,    // ь
4,    // э
7,    // ю
4,    // я
5,    // ё
7,    // –
8,    // —
8,    // …

};

constexpr bn::span<const bn::utf8_character> font_playtime_utf8_characters_span(
        font_playtime_utf8_characters);

constexpr bn::span<const bn::utf8_character> font_playtime_bold_utf8_characters_span(
        font_playtime_bold_utf8_characters);

constexpr bn::span<const bn::utf8_character> font_playtime_small_utf8_characters_span(
        font_playtime_small_utf8_characters);

constexpr auto font_playtime_utf8_characters_map =
        bn::utf8_characters_map<font_playtime_utf8_characters_span>();

constexpr auto font_playtime_bold_utf8_characters_map =
        bn::utf8_characters_map<font_playtime_bold_utf8_characters_span>();

constexpr auto font_playtime_small_utf8_characters_map =
        bn::utf8_characters_map<font_playtime_small_utf8_characters_span>();

constexpr bn::sprite_font font_playtime_sprite_font(
        bn::sprite_items::font_playtime, font_playtime_utf8_characters_map.reference(),
        font_playtime_character_widths);

constexpr bn::sprite_font font_playtime_bold_sprite_font(
        bn::sprite_items::font_playtime_bold, font_playtime_bold_utf8_characters_map.reference(),
        font_playtime_bold_character_widths);

constexpr bn::sprite_font font_playtime_small_sprite_font(
        bn::sprite_items::font_playtime_small, font_playtime_small_utf8_characters_map.reference(),
        font_playtime_small_character_widths);

#endif
